[
    {
      "id": "1",
      "session_id": "1",
      "job_unique_id": "job_f2ee679edfca464b",
      "job_title": "Sr. Principal Analyst – Data Analytics & AI in Insurance and Financial Services (Remote US)",
      "company_name": "Gartner",
      "location_name": "Stamford, Connecticut, United States",
      "job_type": "Hybrid",
      "job_time": "Full-time",
      "salary": "$105,000 - $140,000 a year",
      "accessibility_status": "True",
      "job_description": "Gartner Analysts are industry thought leaders who create must-have research, market predictions and best practices for a broad range of world-leading organizations. A Sr Principal Analyst possesses a keen eye for identifying gaps, problems, and solutions within their market. They use their knowledge to help clients make better decisions, solve complex issues and execute new practices that propel clients’ businesses toward critical objectives. An Analyst publishes these insights as pragmatic and provocative research. Additionally, they reinforce Gartner’s value every day by engaging clients via in-person and virtual meetings, sales support visits, Gartner conferences and industry events. This includes writing about, presenting and advising financial services and insurance organizations about market trends, vendors, services, governance and best practices in Data & Analytics and AI.",
      "job_requirement": "Bachelor’s degree or equivalent experience; Graduate degree preferred. 8-10 years of experience with insurance services AI topics or working in D&A on AI related topics. Relative insurance experience with increasing scope and responsibility in one or more lines of business such as property and casualty, and life and annuities. Also, wealth management and investment services within the insurance context. Experience with the deployment of advanced analytics capabilities to support short-, mid- or long-term decision making in one or more functions such as actuarial science, underwriting, claims/billing, operations, call center, insurance asset management, etc. Ability to work in a small team setting. Self-starter with the ability to successfully navigate through a matrixed organization. Strong written and verbal proficiency, analytical and presentation skills; ability to engage clients and respond effectively to questions. Exposure to advanced analytics tools and approaches via on-the-job experience or formalized education (backgrounds in math, statistics, and physics a plus). Exposure to using AI/ML in forecasting, or experience with quantitative analytics, statistics and coding languages (preferably Python) a bonus. Moderate willingness to travel; though primarily a virtual role, Analysts occasionally have opportunities for domestic and international travel.",
      "link_logo": "https://drive.google.com/file/d/17TZh_8jclbKMyOU7B2bqy2w6VFmRG2Zu/view?usp=drive_link",
      "job_link": "https://www.indeed.com/rc/clk?jk=f2ee679edfca464b&bb=wTHCgc-9RPAPB5i20LOfMSTPj0QlMoT7hmFF7JawrhFloffBTaeZsLjG9rAZCTu7zP0zvwKGFsHDKfnKPVMU1sG8lNVpXJbKrrPklpWnzV_JjA54An8K2A%3D%3D&xkcb=SoDK67M35-rXN1SkJJ0LbzkdCdPP&fccid=be293f1def77a963&vjs=3",
      "timestamp": "2024-12-10 12:45:58",
      "skills_needed": ["data visualization","tableau","sql","statistics","python","data analysis","business analysis","excel","power bi"]
    },
    {
      "id": "2",
      "session_id": "1",
      "job_unique_id": "job_874d8ef92e7ed8b1",
      "job_title": "System Analytics - Pharmacy Analyst",
      "company_name": "Boston Medical Center",
      "location_name": "Boston, Massachussets, United States",
      "job_type": "Remote",
      "job_time": "Full-time",
      "salary": "Not specified",
      "accessibility_status": "True",
      "job_description": "Boston Medical Center Health System is a $4B integrated health system devoted to the proposition that every person regardless of their social or economic circumstances deserves the best health care. Our mission is to provide Exceptional Care, Without Exception and our vision is to make Boston the healthiest urban population in the world. The Pharmacy department is one of the largest and most clinically advanced pharmacy programs in the US, comprising a large retail pharmacy network, specialty pharmacy programs, and clinical services. The analyst plays a key role in helping the Pharmacy department succeed by analyzing and interpreting data, proactively identifying trends, and supporting reporting and programmatic analysis.",
      "job_requirement": "Bachelor’s degree, preference for concentration in economics, finance, information sciences, biology, biostatistics, data science, statistics, or computer science; Masters degree preferred. Two to three years of data analytics experience working with large data sets; ability to conduct advanced analytics using SQL; proficiency in Excel; knowledge of healthcare claims, pharmacy, and/or EMR data is a plus. Experience with Tableau, PowerBI, or other analytics reporting tools preferred. Familiarity with retail pharmacy systems and CRM/cloud data systems like Salesforce preferred.",
      "link_logo": "https://drive.google.com/file/d/165D5CVVzkA64eDeobcrfmNIezhPUsY8A/view?usp=drive_link",
      "job_link": "https://www.indeed.com/viewjob?jk=874d8ef92e7ed8b1&xpse=SoCR67I34YapeGwh350LbzkdCdPP&xfps=b4cae9fd-875b-47e1-b63d-4e562e09850c&xkcb=SoB-67M35-rXN1SkJJ0KbzkdCdPP&vjs=3",
      "timestamp": "2024-11-30 12:45:58",
      "skills_needed": ["data visualization","sql","statistics","python","business analysis"]
    },
    {
      "id": "3",
      "session_id": "1",
      "job_unique_id": "job_ac065fff717d91b6",
      "job_title": "Data Analyst",
      "company_name": "Terrabis",
      "location_name": "Missouri, United States",
      "job_type": "Remote",
      "job_time": "Full-time",
      "salary": "Not specified",
      "accessibility_status": "True",
      "job_description": "Terrabis is a leading privately held cannabis company with a bold growth strategy. Operating in both wholesale and retail, we're at the forefront of the industry, setting new standards, and pushing boundaries. Join us in shaping the future of cannabis. The Data Analyst will build and maintain dashboards to monitor business performance, customer behavior, marketing performance, and operational KPIs. The role will ensure data integrity, enhance quality, value, and usability of data through effective data operations and ad hoc analysis to support strategic decisions.",
      "job_requirement": "Bachelor's degree in Data Science, Analytics, Computer Science, Statistics, or related field. 2+ years of experience in data analytics or business intelligence, including customer and marketing analytics. Proficiency in SQL, Python, and other programming languages. Experience with managing and maintaining ETL/ELT pipelines and data integrations. Proficiency in visualization tools such as Power BI and developing analytics dashboards. Strong analytical skills and problem-solving abilities.",
      "link_logo": "https://drive.google.com/file/d/1FSXJWwFHECEqFaBbEBeCcHzH_PU-VklQ/view?usp=drive_link",
      "job_link": "https://www.indeed.com/viewjob?jk=ac065fff717d91b6&from=serp&vjs=3",
      "timestamp": "2024-11-30 12:45:59",
      "skills_needed": ["data visualization","tableau","sql","statistics","python","data analysis","business analysis","excel","power bi"]
    },
    {
      "id": "4",
      "session_id": "1",
      "job_unique_id": "job_aa46d46166dff070",
      "job_title": "Junior Business Intelligence Analyst (Remote)",
      "company_name": "Koniag Data Solutions, LLC",
      "location_name": "Washington DC, United States",
      "job_type": "Remote",
      "job_time": "Full-time",
      "salary": "Not specified",
      "accessibility_status": "True",
      "job_description": "Koniag Data Solutions is seeking an experienced Junior Business Intelligence Analyst to support KDS and HUD/OCIO. The role involves collaboration with internal and external stakeholders to ensure efficient data storage, operations, and maintenance services. Responsibilities include supporting storage services, troubleshooting ETL/ELT pipelines, creating dashboards, performing ad hoc analysis, and helping with security measures to protect data. The role also supports various IT modernization initiatives at HUD.",
      "job_requirement": "Bachelor's degree in computer and information technology or a related field. 3+ years of experience in business intelligence, data storage, and ETL/ELT pipelines. Strong knowledge of SQL, Python, and experience with Agile methodology. Experience in Federal consulting is a plus.",
      "link_logo": "https://drive.google.com/file/d/1DApYtw-WhS-_k9r7tTTaH1bHi0yNtSuI/view?usp=drive_link",
      "job_link": "https://www.indeed.com/viewjob?jk=aa46d46166dff070&from=serp&vjs=3",
      "timestamp": "2024-11-30 12:45:59",
      "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
      "id": "5",
      "session_id": "1",
      "job_unique_id": "job_ca63e5dd5249a719",
      "job_title": "Business Intelligence/Data Analytics Consultant Support",
      "company_name": "Effervescent Consulting",
      "location_name": "United States",
      "job_type": "Remote",
      "job_time": "On call",
      "salary": "$90 - $100 an hour",
      "accessibility_status": "True",
      "job_description": "We are seeking a skilled and motivated Intelligence Consultant to join our dynamic team. In this role, you will leverage your analytical expertise to provide insights and strategic recommendations that drive decision-making processes. You will work closely with various stakeholders to gather data, analyze trends, and develop actionable intelligence that supports our organizational goals. The ideal candidate will possess strong data analysis skills and a solid understanding of various methodologies and tools.",
      "job_requirement": "At least 3 SAP Business Warehouse full lifecycle implementations. 8 to 10 years of SAP Business Warehouse experience on HANA, Analysis for Office, and SAP Analytics Cloud experience preferred. SAP HANA studio experience with various perspectives (ABAP, BW, HANA). At least 4 years of experience supporting SAP BusinessObjects platform. Strong data modeling skills. Strong ABAP programming skills including Object Oriented ABAP. Experience with SAP BW 4HANA, SAP BusinessObjects, SAP HANA, ABAP, data warehouse, and business intelligence. Strong teamwork and customer support focus, excellent communication skills, and the ability to handle multiple conflicting priorities.",
      "link_logo": "https://drive.google.com/file/d/1lfXAZow9rjhSoyeCbQ-vxgMBOaT1e-1F/view?usp=drive_link",
      "job_link": "https://www.indeed.com/viewjob?cmp=EFFERVESCENT-CONSULTING-LLC&t=Intelligence+Consultant&jk=ca63e5dd5249a719&xpse=SoBk67I34Yp68dwv8Z0LbzkdCdPP&xfps=f218235c-f8c4-4731-b6e2-fff1ee0d50ab&xkcb=SoBt67M35-rXN1SkJJ0ObzkdCdPP&vjs=3",
      "timestamp": "2024-11-30 12:45:59",
      "skills_needed": ["tableau","sql","communication","statistics","strategy","python","data analysis","business analysis","excel","power bi"]
    },
    {
      "id": "6",
      "session_id": "1",
      "job_unique_id": "job_dcaae36c3497136d",
      "job_title": "Utility Billing Analyst",
      "company_name": "Resource Energy",
      "location_name": "Virtual",
      "job_type": "Remote",
      "job_time": "Full-time",
      "salary": "$50,000 - $65,000 a year",
      "accessibility_status": "True",
      "job_description": "Resource Energy (RES) provides highly customized energy procurement and energy use and data management solutions to commercial real estate companies and industrial businesses. The Energy Billing Analyst supports multiple clients with responsibility for tenant utility billing calculations, energy savings tracking, and energy consumption analysis. This role also includes reporting, utility tariff data maintenance, and client utility budget management.",
      "job_requirement": "BA/BS in Energy, Accounting, Engineering, Computer Science, or similar analytical discipline. Previous experience with energy calculations, accounting concepts, or commercial real estate preferred. Proficiency in MS Excel for data analysis and reporting. Strong client service orientation and attention to detail, with excellent time management and project management skills.",
      "link_logo": "https://drive.google.com/file/d/10o272uZ4h8AnVX4PrUSGamB67bWvoHkd/view?usp=drive_link",
      "job_link": "https://www.indeed.com/viewjob?jk=dcaae36c3497136d&xpse=SoAL67I34YuflQANUj0LbzkdCdPP&xfps=53235ef4-1854-47c3-8936-107835805957&xkcb=SoDw67M35-rXN1SkJJ0NbzkdCdPP&vjs=3",
      "timestamp": "2024-11-30 12:45:59",
      "skills_needed": ["data visualization","sql","statistics","python","business analysis"]
    },
    {
      "id": "7",
      "session_id": "1",
      "job_unique_id": "job_2a685b68a8e2bba1",
      "job_title": "Delivery Analyst",
      "company_name": "IQVIA",
      "location_name": "Boston, Massachusetts, United States",
      "job_type": "Remote",
      "job_time": "Full-time",
      "salary": "$82,500 - $137,500 a year",
      "accessibility_status": "True",
      "job_description": "This position supports the IQVIA Customer Health Intelligence Project Platform (CHIP). Key responsibilities include operational support, communication with clients and vendors, and application and tier 1 ETL support. The role also involves triaging platform issues, quality control, and managing production support.",
      "job_requirement": "1-3 years of experience with Snowflake, Atomic, and Python. Experience with data warehousing, cloud technologies like Snowflake, Redshift, or Databricks, and cloud warehouse management. Strong communication, analytical, and problem-solving skills required.",
      "link_logo": "https://drive.google.com/file/d/1XzwvUVcmxoN8jZ-pq956zZ_m2_WvZRH3/view?usp=drive_link",
      "job_link": "https://www.indeed.com/viewjob?jk=2a685b68a8e2bba1&xpse=SoCl67I34YuZ9cxSoR0LbzkdCdPP&xfps=639fef14-31c4-41a9-860a-b3b3f90b5556&xkcb=SoBE67M35-rXN1SkJJ0NbzkdCdPP&vjs=3",
      "timestamp": "2024-11-30 12:45:59",
      "skills_needed": ["data visualization","sql","statistics","python","business analysis"]
    },
    {
      "id": "8",
      "session_id": "1",
      "job_unique_id": "job_7dcef2e10a3946c1",
      "job_title": "Web Scraping Data Analyst - Remote Volunteer",
      "company_name": "iHealth and Wellness Foundation",
      "location_name": "New York, United States",
      "job_type": "Remote",
      "job_time": "Part-time",
      "salary": "Unpaid (Future salary promised after seed funding)",
      "accessibility_status": "True",
      "job_description": "iHealth and Wellness Foundation is a pre-money nonprofit/tech startup seeking volunteers for the Web Scraping Data Analyst role. The role focuses on developing strategies for web scraping, configuring data extraction, ensuring data accuracy, and maintaining existing data collection apps. This is a volunteer role with a promise of future salary after the seed funding round.",
      "job_requirement": "Experience in web scraping (3+ years), data processing (3+ years), and object-oriented programming. Familiarity with project management tools (e.g., Jira) and detail-oriented work is required. HealthTech experience and previous startup or consulting company experience are a plus. Candidates must commit to at least 4+ hours per week and attend weekly standup meetings.",
      "link_logo": "https://drive.google.com/file/d/122QboZWfonSPA8H5-SfmLak-Z4Xim1H5/view?usp=drive_link",
      "job_link": "https://www.indeed.com/viewjob?cmp=iHealth-and-Wellness-Foundation&t=Data+Analyst&jk=7dcef2e10a3946c1&xpse=SoAp67I34ZLdw2xWFZ0LbzkdCdPP&xfps=4ed26d9a-01be-4000-9dc8-bf1727ea2122&xkcb=SoCt67M35-rXN1SkJJ0DbzkdCdPP&vjs=3",
      "timestamp": "2024-11-30 12:45:59",
      "skills_needed": ["data visualization","tableau","sql","statistics","python","data analysis","business analysis","excel","power bi"]
    },
    {
      "id": "9",
      "session_id": "1",
      "job_unique_id": "job_146679a681d2fdfe",
      "job_title": "Business Analyst (Remote)",
      "company_name": "MGI Infotech",
      "location_name": "Virtual",
      "job_type": "Remote",
      "job_time": "Full-time - 8 hour shift",
      "salary": "$90,000 - $105,000 a year",
      "accessibility_status": "True",
      "job_description": "MGI Infotech is seeking a Business Analyst for a remote, full-time contract position. The role involves interfacing with business stakeholders to understand their needs and requirements, explaining them to the development team, and maintaining documentation. The ideal candidate will have experience in business analysis, Agile methodology, and tools like Jira.",
      "job_requirement": "Experience in business analysis, excellent communication skills, ability to collect requirements, and good documentation practices. Familiarity with Agile methodology, tools like Jira, MS Office, MS Project, and Visio. Experience in validating and verifying business requirements to outcomes is required.",
      "link_logo": "https://drive.google.com/file/d/1X34_kmr4NgqeraVDB6kCAyjQpyF_LIFC/view?usp=drive_link",
      "job_link": "https://www.indeed.com/viewjob?cmp=Digipath-Infotech&t=Business+Analyst&jk=146679a681d2fdfe&xpse=SoCZ67I34ZMJZ5QrEx0LbzkdCdPP&xfps=1fc8615e-9236-4976-953b-91e4fae749e9&xkcb=SoAZ67M35-rXN1SkJJ0CbzkdCdPP&vjs=3",
      "timestamp": "2024-11-30 12:45:59",
      "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
      "id": "10",
      "session_id": "1",
      "job_unique_id": "job_9508022ce16271ef",
      "job_title": "Data Analyst",
      "company_name": "Flipped.ai",
      "location_name": "Virtual",
      "job_type": "Remote",
      "job_time": "Full-time",
      "salary": "$45 - $55 an hour",
      "accessibility_status": "True",
      "job_description": "Flipped.ai is seeking a Data Analyst for a remote, full-time position. The role involves collecting and analyzing marketing data, preparing reports and visualizations, and collaborating with cross-functional teams. The ideal candidate will have experience in data analysis tools like Excel, SQL, and Python, with a focus on marketing data analysis.",
      "job_requirement": "Bachelor's degree in statistics, mathematics, marketing, or a related field. Proven experience with data analysis tools such as Excel, SQL, and Python. Strong analytical skills and experience in marketing or market research is preferred. Familiarity with data visualization tools like Tableau or Power BI is a plus.",
      "link_logo": "https://drive.google.com/file/d/1mIvNokT2ZjsFxIRhVLSZmdLqdJ2KU-et/view?usp=drive_link",
      "job_link": "https://www.indeed.com/viewjob?cmp=Flipped.ai&t=Data+Analyst&jk=9508022ce16271ef&xpse=SoAF67I34ZMyd-AFub0LbzkdCdPP&xfps=bb456fb7-6582-4920-b38b-0d4163ec6c98&xkcb=SoCE67M35-rXN1SkJJ0BbzkdCdPP&vjs=3",
      "timestamp": "2024-11-30 12:46:00",
      "skills_needed": ["data visualization","tableau","sql","statistics","python","data analysis","business analysis","excel","power bi"]
    },
    {
      "id": "11",
      "session_id": "1",
      "job_unique_id": "job_5088e2e47e5b0e0e",
      "job_title": "Data Analyst",
      "company_name": "Village Green, LLC",
      "location_name": "Spring, TX 77389",
      "job_type": "Remote",
      "job_time": "Full-time - Flexible schedule",
      "salary": "$45 - $60 an hour",
      "accessibility_status": "True",
      "job_description": "Village Green LLC is looking for a detail-oriented and self-motivated Remote Data Analyst. Responsibilities include cleaning, processing, and analyzing large datasets, creating reports, dashboards, and data visualizations to monitor KPIs and business metrics. The role also involves collaborating with cross-functional teams and communicating data insights to non-technical stakeholders.",
      "job_requirement": "Bachelor's degree in Data Science, Statistics, Computer Science, Mathematics, Economics, or a related field. Proven experience as a Data Analyst, proficiency in Excel, SQL, Python, and data visualization tools like Tableau or Power BI. Experience with cloud platforms and machine learning is a plus. Strong communication skills and the ability to manage tasks independently in a remote work environment.",
      "link_logo": "https://drive.google.com/file/d/1n2GAZ4MA7OoUBtJkS-QOaRkRkbh6nF2L/view?usp=drive_link",
      "job_link": "https://www.indeed.com/viewjob?jk=5088e2e47e5b0e0e&from=serp&vjs=3",
      "timestamp": "2024-11-30 12:46:00",
      "skills_needed": ["data visualization","tableau","sql","statistics","python","data analysis","business analysis","excel","power bi"]
    },
    {
      "id": "12",
      "session_id": "1",
      "job_unique_id": "job_81d97d2806df07f0",
      "job_title": "Senior Data Analyst",
      "company_name": "XRHealth",
      "location_name": "Tel Aviv-Yafo, Israel",
      "job_type": "Remote",
      "job_time": "Full-time - Flexible",
      "salary": "Not specified",
      "accessibility_status": "True",
      "job_description": "XRHealth is looking for a Senior Data Analyst to help integrate data warehouses and BI tools, develop KPI visualizations, and influence strategic decisions. The role involves analyzing patient lifecycles, marketing funnels, and trends, as well as leading data-related projects. The analyst will also work on resource allocation decisions across business units and communicate analytics outcomes to business stakeholders.",
      "job_requirement": "4+ years of experience with advanced skills in SQL and BI Tools, knowledge in data engineering, ETL/ELT processes, and DWH architecture. A B.A./B.Sc. degree with a focus on statistical and analytical skills. Experience with product/marketing analytic tools (Mixpanel, Pixel, Google Tag Manager), and Python for statistical analysis is a plus. Strong communication and teamwork skills required.",
      "link_logo": "https://drive.google.com/file/d/1tBUFeov1x5SK2upfFOeN0q1qNtYaz5ri/view?usp=drive_link",
      "job_link": "https://www.indeed.com/viewjob?jk=81d97d2806df07f0&from=serp&vjs=3",
      "timestamp": "2024-11-30 12:46:00",
      "skills_needed": ["data visualization","tableau","sql","statistics","python","data analysis","business analysis","excel","power bi"]
    },
    {
        "id": "13",
        "session_id": "1",
        "job_unique_id": "job_b36fc48837958dc7",
        "job_title": "Strategy Analyst I",
        "company_name": "CivicPlus, LLC",
        "location_name": "Remote",
        "job_type": "Remote",
        "job_time": "Full-time - Monday to Friday",
        "salary": "$61,700 - $87,600 a year",
        "accessibility_status": "True",
        "job_description": "CivicPlus is looking for a Strategy Analyst I to support the organization with sales, marketing, and payments reporting and analysis. The role involves developing and maintaining dashboards, performing forecasting, analyzing performance, and providing insights to key stakeholders. The successful candidate will have experience with data visualization tools, CRM systems, and analytics platforms.",
        "job_requirement": "Bachelor's degree in Business, Data Analytics, Finance, or related field. Experience with SQL, Python, R, Salesforce, and financial systems. Strong communication and project management skills, with the ability to work in fast-paced environments. Experience in SaaS, tech, or high-growth industries is preferred.",
        "link_logo": "https://drive.google.com/file/d/1KSb6KO-5EEVLUbLtqVx_owNFMM9wGse9/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=b36fc48837958dc7&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:00",
        "skills_needed": ["data visualization","sql","statistics","python","business analysis"]
    },
    {
        "id": "14",
        "session_id": "1",
        "job_unique_id": "job_69d2305307e18740",
        "job_title": "Student Assistant - CA DMV - Analyst (Remote)",
        "company_name": "University Enterprises, Inc.",
        "location_name": "Sacramento, CA 95819",
        "job_type": "Remote",
        "job_time": "Part-time - Monday to Friday",
        "salary": "$16.50 an hour",
        "accessibility_status": "True",
        "job_description": "University Enterprises, Inc. is seeking a student assistant to compile and analyze data, conduct research, and prepare reports for the Executive Division of the CA Department of Motor Vehicles (DMV). The role involves data processing, report creation, and contributing to various projects. This is a part-time, remote student position. Applicants must be enrolled as a student and reside in California.",
        "job_requirement": "The candidate must be a college student enrolled in at least 6 semester units or 9 quarter units (undergraduate) or 4 semester units or 6 quarter units (graduate) in Political Science or Data Analytics. Experience in technical analysis or research is required. Proficiency in Microsoft 365, Teams, WebEx, and strong written and verbal communication skills are essential. Project management experience and the ability to adapt in a fast-paced environment are preferred.",
        "link_logo": "https://drive.google.com/file/d/18FBTHhLCjRSRe1-v5uWdC76ed_fergN5/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=69d2305307e18740&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:00",
        "skills_needed": ["data visualization","sql","statistics","python","business analysis"]
    },
    {
        "id": "15",
        "session_id": "1",
        "job_unique_id": "job_df9371daf6d98418",
        "job_title": "Contract Data Analyst - Indonesian Language",
        "company_name": "Lightcast",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time - (40 hours/week)",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Lightcast is seeking data-driven professionals with specialized language skills to support the expansion of global features. The role involves analyzing and improving multilingual text classifiers, working with linguistics and engineering teams to build new parsers across languages, and translating various taxonomies such as Skills, Titles, and Occupations. The position requires proficiency in Indonesian and experience in data analysis.",
        "job_requirement": "Bachelor’s degree in Linguistics, Data Analytics, NLP, or a related field is preferred. Proficiency in Indonesian (reading and writing), experience with Microsoft Excel, SQL, RegEx, and Python is required. Ability to work independently, manage time effectively, and follow complex instructions in a remote setting is essential.",
        "link_logo": "https://drive.google.com/file/d/19shnyaKTSqzrimxrmnxZ62asSSuIDTl1/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=df9371daf6d98418&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:03",
        "skills_needed": ["data visualization","tableau","sql","statistics","python","data analysis","business analysis","excel","power bi"]
    },      
    {
        "id": "16",
        "session_id": "1",
        "job_unique_id": "job_68f5309f211c57c9",
        "job_title": "Recovery and Resolution Analyst - National Remote",
        "company_name": "Optum (part of UnitedHealth Group)",
        "location_name": "Dallas, TX 75201",
        "job_type": "Remote",
        "job_time": "Full-time - Monday – Friday, 8:00am – 4:30pm",
        "salary": "$23.22 - $45.43 an hour",
        "accessibility_status": "True",
        "job_description": "Optum is seeking a Recovery and Resolution Analyst to evaluate, negotiate, and resolve healthcare subrogation matters for a multi-million dollar portfolio. Responsibilities include managing subrogation cases, analyzing legal research, negotiating settlements, and maintaining compliance with regulations. The role also involves a high volume of outbound calls, documentation, and working independently. This remote position offers flexibility but requires telecommuting and maintaining a dedicated work area.",
        "job_requirement": "High School Diploma/GED required, with 2+ years of healthcare claims experience. Understanding of subrogation principles is essential. Experience with P&C insurance and negotiations is preferred. The role requires strong analytical skills, effective communication, and the ability to work independently. Telecommuting requirements include secure handling of sensitive documents and a reliable high-speed internet connection.",
        "link_logo": "https://drive.google.com/file/d/1Z_AkM3IE13l394wdve9SKIDkCwbh6fsB/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=68f5309f211c57c9&xpse=SoAB67I34ZaISzgNXj0LbzkdCdPP&xfps=5b5d6940-2ada-4e43-a8bb-62b76e9d2266&xkcb=SoCm67M35-rVj3QvxZ0KbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:03",
        "skills_needed": ["data visualization","sql","statistics","python","business analysis"]
    },
    {
        "id": "17",
        "session_id": "1",
        "job_unique_id": "job_3c2b493c703c8480",
        "job_title": "Data and Reporting Analyst",
        "company_name": "Reli Group Inc",
        "location_name": "Baltimore, MD 21228, United States",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$90,000 - $110,000 a year",
        "accessibility_status": "True",
        "job_description": "Reli Group is seeking a Data and Reporting Analyst to develop reporting and analytics solutions for CMS under the Affordable Care Act (ACA). The role involves data mapping, defining calculation logic, creating data models and reports, and ensuring compliance with reporting standards. Responsibilities include building data lakes, assisting in business decisions, troubleshooting data integrity issues, and contributing to technical documentation. The position requires hands-on experience in ELT, SQL, Python, and tools like Quicksights and Databricks.",
        "job_requirement": "The candidate must have 3+ years of IT experience and 5 years of experience in reporting and data analytics. Experience with ELT, SQL, Python, reporting tools, data lakes, data warehouses (Hive, Redshift, Databricks), and healthcare data (ACA, Exchanges) is required. Experience with SAFe Agile methodology and Databricks concepts is also necessary. A Bachelor's degree is required.",
        "link_logo": "https://drive.google.com/file/d/1xzVLKxZK8H-mB3Qe4dBnW-x3-HtgVIby/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=3c2b493c703c8480&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:03",
        "skills_needed": ["data visualization","tableau","sql","statistics","python","data analysis","business analysis","excel","power bi"]
    },
    {
        "id": "18",
        "session_id": "1",
        "job_unique_id": "job_0b3895b0cf4be05c",
        "job_title": "Sr. Analyst People Analytics - Remote within 100 Miles of an Office Location",
        "company_name": "CarMax",
        "location_name": "Richmond, VA",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "The Senior Analyst of People Analytics at CarMax will leverage strong data analytics and strategic problem-solving skills to inform people decisions and initiatives. Responsibilities include advancing HR initiatives, building transformational analytical tools, deploying tests to drive change, and synthesizing complex data into key insights for leaders across the organization. This role impacts Talent Acquisition, Talent Development, Diversity and Inclusion, Compensation, Benefits, and Associate Experience for CarMax’s workforce of 30,000 associates.",
        "job_requirement": "The ideal candidate has two or more years of experience in an analytical or strategic role, a four-year undergraduate degree, and experience in conducting large-scale data analysis. Proficiency in data analysis tools such as SQL, Tableau, and PowerBI is required. The candidate should be able to apply business and technical knowledge to solve complex problems, produce results, and make recommendations. Excellent problem-solving, strategic thinking, and communication skills are essential.",
        "link_logo": "https://drive.google.com/file/d/10J3AaPzDHPKFqmQ0JZQmo0rzPPVHS-xr/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=0b3895b0cf4be05c&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:03",
        "skills_needed": ["data visualization","sql","statistics","python","business analysis"]
    },
    {
        "id": "19",
        "session_id": "1",
        "job_unique_id": "job_3073b174662bf888",
        "job_title": "SharePoint Business Analyst (Remote)",
        "company_name": "Excelraise, LLC",
        "location_name": "Raleigh, NC",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$65 - $70 an hour",
        "accessibility_status": "True",
        "job_description": "Excelraise, LLC is looking for a qualified SharePoint Business Analyst for a 12-month contract with the North Carolina Department of Transportation (NCDOT). The position involves designing, testing, and analyzing SharePoint solutions without any coding or administration tasks. The role requires designing SharePoint lists, libraries, and content types, testing web-based content management solutions, and collaborating with both IT users and business users. The ideal candidate will have experience as a SharePoint Business Analyst and a strong understanding of NCDOT's transportation lifecycle business processes.",
        "job_requirement": "The ideal candidate has 5+ years of experience as a Business Analyst, specifically in SharePoint design and content management. The candidate should be proficient with Microsoft SharePoint, SharePoint lists, libraries, and content types, and have experience with SCRUM/Agile development methodology. Familiarity with Microsoft Suite, Team Foundation Server (TFS), or Azure DevOps is also desired. Strong analytical, communication, and documentation skills are required, along with a working knowledge of application development lifecycle and business process re-engineering.",
        "link_logo": "https://drive.google.com/file/d/15o2BjH61Qx5Q1YlToWZHIXsIxVcB-dul/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=3073b174662bf888&xpse=SoCq67I34Zbrz8xOCR0LbzkdCdPP&xfps=39634209-8dbb-4cf6-bf3f-738f6835d4c0&xkcb=SoAB67M35-rVj3QvxZ0PbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:04",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "20",
        "session_id": "1",
        "job_unique_id": "job_5a9fee2444e47618",
        "job_title": "ERP Business Analyst Staff - 1LMX (Full Remote)",
        "company_name": "Lockheed Martin",
        "location_name": "Mount Laurel, NJ 08054",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$110,300 - $207,600 per year (depending on location)",
        "accessibility_status": "True",
        "job_description": "Lockheed Martin is seeking an ERP Business Analyst Staff for a Full-Time Remote position to support the 1LMX Value Stream and RMS super users with process documentation, data validation, and testing support. Responsibilities also include analytics, visualization support, and maintenance of the RMS 1LMX Value Stream Teams site and files. The role includes collaborating with internal teams to support data validation and testing for Release 3.",
        "job_requirement": "Experience with SAP, Microsoft Office Suite (including MS Project and MS Visio), strong analytical skills, and experience with financial systems. Proficiency in Alteryx and Tableau is preferred, as well as experience with Lean principles and process improvement. Must be capable of communicating across various functions and levels in the organization.",
        "link_logo": "https://drive.google.com/file/d/1xKm3kabKkfufcXgERfK02u2NObNCmKNf/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=5a9fee2444e47618&xpse=SoCg67I34ZbwZkzxTZ0LbzkdCdPP&xfps=b2574cfb-a3cb-44d5-ae66-f6592e2881ca&xkcb=SoC167M35-rVj3QvxZ0ObzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:04",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "21",
        "session_id": "1",
        "job_unique_id": "job_ca8fde8cc6fe46ac",
        "job_title": "Business Insight Analyst II (Remote based in the US)",
        "company_name": "Conifer Revenue Cycle Solutions",
        "location_name": "Frisco, TX",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$57,616 - $92,144 a year",
        "accessibility_status": "True",
        "job_description": "Conifer Revenue Cycle Solutions is seeking a Business Insight Analyst II for a remote role. The position involves preparing reports for business performance analysis, clarifying report needs with clients, auditing data for quality, and recommending analytics for accuracy. The role also includes collaborating with business units, performing ad-hoc reporting, and training junior analysts.",
        "job_requirement": "Experience in SQL, VBA, Tableau, Power BI, MicroStrategy, or similar tools. Proficiency with Microsoft Excel, Word, PowerPoint, Access. Experience with relational databases like MS SQL Server/MySQL. A 4-year degree in Business, Accounting, IS, Engineering, or 2-3 years of relevant experience. Healthcare experience is a plus.",
        "link_logo": "https://drive.google.com/file/d/1Xa8hWjW19pLhBb-fAC6og30DMokDzaFt/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=ca8fde8cc6fe46ac&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:04",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "22",
        "session_id": "1",
        "job_unique_id": "job_1fcef12bb34d801b",
        "job_title": "Senior Business Analyst",
        "company_name": "DMI",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "DMI is seeking a Senior Business Analyst to develop and analyze business requirements, system and application data, and support cybersecurity project planning and execution. Responsibilities include documenting project requirements, supporting risk and impact assessments, and ensuring compliance with security standards.",
        "job_requirement": "At least 5 years of proven experience in IT business analysis and requirements development, with knowledge in project management methodology, cybersecurity requirements, and experience with IT asset management systems. A bachelor's degree in Business Management, Cybersecurity, IT, or a related field is required.",
        "link_logo": "https://drive.google.com/file/d/1tgN3b0tF70SFpsq5md0tGACdFwEHeKcJ/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=1fcef12bb34d801b&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:05",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "23",
        "session_id": "1",
        "job_unique_id": "job_e866354dbebd71bd",
        "job_title": "SharePoint Business Analyst/Quality Assurance (Remote)",
        "company_name": "Excelraise, LLC",
        "location_name": "Raleigh, NC",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$65 - $70 an hour",
        "accessibility_status": "True",
        "job_description": "Excelraise, LLC is seeking a SharePoint Business Analyst/Quality Assurance specialist for a 12-month engagement with the North Carolina Department of Transportation (NCDOT). Responsibilities include designing SharePoint-based solutions, performing quality assurance testing, managing project timelines, and providing training materials for business process changes. The position is remote with minimal in-person engagement for candidates in Raleigh.",
        "job_requirement": "Experience with SharePoint design (custom lists, libraries, content types), business analysis processes, quality assurance testing, and business process transformation. Proficiency in project management and system development life cycle (SDLC). Bachelor's Degree and 5 years of experience in a related role required.",
        "link_logo": "https://drive.google.com/file/d/16jaSR1CCgwrRStkkNhgXIcsE00qw1I6n/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=e866354dbebd71bd&xpse=SoCQ67I34ZdqouQhyp0LbzkdCdPP&xfps=3a5d5de0-53eb-4e75-a25e-166f9c552f8a&xkcb=SoB167M35-rVj3QvxZ0DbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:05",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "24",
        "session_id": "1",
        "job_unique_id": "job_52b76bda3e101ed2",
        "job_title": "BI / Data Analytics Consultant Support",
        "company_name": "Link Technologies",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Link Technologies is seeking a BI/Data Analytics Consultant Support to augment the SAP Support Center for SAP BW on HANA, BW/4HANA, and SAP Analytics Cloud. Responsibilities include designing solutions for SAP Analytics Cloud, assisting with BW/4HANA migration, building HANA calculation views, and providing training and documentation. The position requires expertise in SAP BW, HANA, ABAP, and BusinessObjects 4.x.",
        "job_requirement": "Experience with SAP BW, HANA, BusinessObjects 4.x, ABAP programming (Object-Oriented), SAP Analytics Cloud, and Data Provisioning technologies. A minimum of 3 full-cycle SAP Business Warehouse implementations, along with 8-10 years of relevant experience. Strong communication and organizational skills are essential.",
        "link_logo": "https://drive.google.com/file/d/1s_DRHV9uANDbdbJP1EKUoPj0DpqoKWnd/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?cmp=Link-Technologies&t=Analytics+Consultant&jk=52b76bda3e101ed2&xpse=SoAm67I34ZdoKswrEx0LbzkdCdPP&xfps=33ffde12-5d0c-4977-9a30-f03ab7579ff0&xkcb=SoDB67M35-rVj3QvxZ0CbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:05",
        "skills_needed": ["tableau","sql","statistics","python","data analysis","excel","power bi"]
    },
    {
        "id": "25",
        "session_id": "1",
        "job_unique_id": "job_171d0f99f1f85092",
        "job_title": "Alteryx Analytics Cloud Governance Analyst",
        "company_name": "Alteryx, Inc.",
        "location_name": "Irvine, California",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$95,000 - $120,000 per year",
        "accessibility_status": "True",
        "job_description": "Alteryx is seeking an Analytics Cloud Governance Analyst to maintain and enhance their enterprise data analytics environment. The role includes supporting Alteryx Analytics Cloud features, creating guides, ensuring legal/audit compliance, and driving operational efficiency through best practices. Responsibilities also include collecting feedback, developing KPIs, and supporting product enhancements.",
        "job_requirement": "Experience in customer support, data governance, analytics, or related fields. Intermediate SQL skills, problem-solving abilities, strong communication, and experience with Alteryx Designer/Server are preferred. Experience with Jira, SDLC in Data & Analytics, and Data Governance methodology is also beneficial.",
        "link_logo": "https://drive.google.com/file/d/1ExypK5klVzw0NnQ2PTJJb5frn6yd8CPL/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=171d0f99f1f85092&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:06",
        "skills_needed": ["data visualization","sql","statistics","python","business analysis"]
    },
    {
        "id": "26",
        "session_id": "1",
        "job_unique_id": "job_430d14b039d601f3",
        "job_title": "Senior Business Intelligence Analyst, Revenue Operations",
        "company_name": "Enverus",
        "location_name": "Austin, TX 78746",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Enverus is seeking a Senior Business Intelligence Analyst to join their Revenue Operations team. This role involves designing and implementing data visualizations, interpreting complex data, improving data flow and quality, and automating reports and dashboards. The position also collaborates with cross-functional teams and ensures data integrity and accuracy across systems.",
        "job_requirement": "Advanced knowledge of Power BI and data modeling, 2+ years interacting with senior leadership, familiarity with Snowflake, SQL, Python, ETL, and experience in business intelligence, business analytics, or data visualization. A Bachelor's degree in Data Science or Computer Science and 5+ years of relevant experience are required.",
        "link_logo": "https://drive.google.com/file/d/1Oi3m08-0uQOh2QQVWJLpsq_FR-po1Vvw/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=430d14b039d601f3&xpse=SoAl67I34ZeDdkTxTZ0LbzkdCdPP&xfps=d268f17b-b0c8-4660-a02f-f5f40db8a312&xkcb=SoDo67M35-rVj3QvxZ0AbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:06",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "27",
        "session_id": "1",
        "job_unique_id": "job_68347c0534913900",
        "job_title": "Entry Level Business Analyst",
        "company_name": "Weboptimix",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$70,000 - $80,000 per year",
        "accessibility_status": "True",
        "job_description": "Weboptimix is seeking an Entry Level Business Analyst to gather customer requirements, define product specifications, identify market opportunities, and partner with the engineering team to implement solutions. The role involves tracking product development and collaborating with cross-functional teams to align product vision.",
        "job_requirement": "BA/BS in Computer Science, Business Administration, or related field. Strong analytical and financial modeling skills, excellent written and oral communication skills, and the ability to balance priorities in a lean environment. Ability to simplify complex issues and build consensus.",
        "link_logo": "https://drive.google.com/file/d/1PoxCHiyOIwV4pJ2Se3Wd0rSFuuKvFiqQ/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?cmp=Weboptimix&t=Entry+Level+Analyst&jk=68347c0534913900&xpse=SoBa67I34Zeph0QrCx0LbzkdCdPP&xfps=8b0dd0f1-2bae-40c0-9344-1507caaf7897&xkcb=SoBm67M35-rVj3QvxZ0HbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:06",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "28",
        "session_id": "1",
        "job_unique_id": "job_cae0dd7570fa5d9a",
        "job_title": "Sr. Analyst",
        "company_name": "Vacasa",
        "location_name": "Portland, OR 97209, United States",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$90,700 - $117,956 per year",
        "accessibility_status": "True",
        "job_description": "Vacasa is seeking a Senior Data Analyst to lead complex data analysis initiatives, provide strategic insights, and develop dashboards to communicate key metrics to stakeholders. The role involves cross-functional collaboration and mentorship for junior analysts. This position is 100% remote, available for applicants in select U.S. states.",
        "job_requirement": "3+ years of experience in data analytics or a comparable role, with preferred experience in hospitality or e-commerce. Strong skills in G-Suite, data analysis, and communication. Ability to work under pressure in a fast-paced, agile environment.",
        "link_logo": "https://drive.google.com/file/d/1qCnGTznLa67eJ_1jrT15PMKRjWXYW27a/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=cae0dd7570fa5d9a&xpse=SoAi67I34Ze1ozxQAJ0LbzkdCdPP&xfps=12b34620-24eb-4e0d-a093-7b8bef0c9eec&xkcb=SoDS67M35-rVj3QvxZ0GbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:06",
        "skills_needed": ["data visualization","sql","statistics","python","business analysis"]
    },
    {
        "id": "29",
        "session_id": "1",
        "job_unique_id": "job_ffadfc866cd885c0",
        "job_title": "Data Analyst",
        "company_name": "KesarWeb",
        "location_name": "Fresno, CA",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$79,000 - $96,000 per year",
        "accessibility_status": "True",
        "job_description": "KesarWeb is seeking a passionate Data Analyst to interpret data, analyze results using statistical techniques, and provide ongoing reports. The role involves developing and implementing data analytics strategies, maintaining databases, and working with management to prioritize business needs and improve processes. This position is remote, with a salary range of $79,000 - $96,000 per year.",
        "job_requirement": "Proven experience as a Data Analyst or Business Data Analyst. Expertise in data models, database design, data mining, and statistical analysis. Proficiency in reporting packages, databases (SQL), and programming (XML, Javascript). BS in Mathematics, Economics, Computer Science, Information Management, or Statistics.",
        "link_logo": "https://drive.google.com/file/d/13hMhAA9JcE0FxDDrN9V1Qf-GL7Y7VbYu/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?cmp=KesarWeb&t=Data+Analyst&jk=ffadfc866cd885c0&xpse=SoDj67I34ZfAIEwrAB0LbzkdCdPP&xfps=2b82085b-d235-4dee-bc80-f6975ef0edda&xkcb=SoBP67M35-rVj3QvxZ0FbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:06",
        "skills_needed": ["data visualization","tableau","sql","statistics","python","data analysis","business analysis","excel","power bi"]
    },
    {
        "id": "30",
        "session_id": "1",
        "job_unique_id": "job_86bbe17e8ebb6097",
        "job_title": "Data Analyst",
        "company_name": "Go Intellects Inc",
        "location_name": "Washington, DC",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Up to $80 per hour",
        "accessibility_status": "True",
        "job_description": "Go Intellects Inc. is seeking a Data Analyst to support the DCAS Program Administration, Executive Steering Committee, and stakeholders. Responsibilities include overseeing the data lifecycle, ensuring data quality and integrity, managing privacy and security, and defining policies and procedures. This remote contract position offers up to $80 per hour.",
        "job_requirement": "Bachelor’s degree in Information Technology or related field, with at least 3+ years of experience in data analysis. Experience in defining business data requirements, creating data standards, and analyzing complex data sets. Knowledge of privacy, security, and risk management policies is preferred.",
        "link_logo": "https://drive.google.com/file/d/1IyA0SD99Uuzo6nUt8RfZMoD7_3yeWVYd/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?cmp=Go-Intellects-Inc&t=Data+Analyst&jk=86bbe17e8ebb6097&xpse=SoA-67I34ZfThaSsQp0LbzkdCdPP&xfps=3bd00fb5-5f6c-4aea-8729-ab47684ae638&xkcb=SoDO67M35-rUyhSJ9p0LbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:08",
        "skills_needed": ["data visualization","tableau","sql","statistics","python","data analysis","business analysis","excel","power bi"]
    },
    {
        "id": "31",
        "session_id": "1",
        "job_unique_id": "job_321e90a1a4a95f0b",
        "job_title": "Business Analyst",
        "company_name": "GD Resources, LLC",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$120,000 - $150,000 per year",
        "accessibility_status": "True",
        "job_description": "GD Resources LLC is seeking a Senior Business Analyst to develop and analyze business requirements, system and application data, and support cybersecurity project planning and execution. The role includes critical analysis of statewide system and application inventory, contributing to the development of metrics, and ensuring compliance with security standards. This remote position requires candidates to work EST hours.",
        "job_requirement": "Bachelor's Degree in Business Management, Cybersecurity, Information Technology, or related field, with 5+ years of experience in IT Business Analysis and Requirements Development. Experience with IT solutions, project management, and cybersecurity requirements is required.",
        "link_logo": "https://drive.google.com/file/d/1Yv42hwGPPs1hHEW3ZtI9FMwf7C9xh2rs/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?cmp=GD-Resources-LLC&t=Business+Analyst&jk=321e90a1a4a95f0b&xpse=SoBE67I34Zf6eERf2J0LbzkdCdPP&xfps=db2f41de-26bb-43c1-8a10-e836d3a321f1&xkcb=SoB667M35-rUyhSJ9p0KbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:08",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "32",
        "session_id": "1",
        "job_unique_id": "job_ab28878e5136da77",
        "job_title": "Local News Sustainability Data Analyst",
        "company_name": "The GroundTruth Project",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$65,000 - $75,000 per year",
        "accessibility_status": "True",
        "job_description": "The Local News Sustainability Data Analyst will collaborate with partner newsrooms to enhance their ability to leverage data for raising philanthropic support. The role includes analyzing fundraising trends, providing mentorship, developing training sessions, managing sustainability data, and working closely with stakeholders to optimize fundraising efforts.",
        "job_requirement": "Bachelor's degree preferred, with a minimum of 5 years of experience in nonprofit fundraising or philanthropic advising. Strong communication, training, and project management skills, along with proficiency in fundraising tools like Airtable, Salesforce, and WordPress, are required.",
        "link_logo": "https://drive.google.com/file/d/1Oc91AS2Dbig6M41WKoGHc-943aUh_bY4/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=ab28878e5136da77&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:08",
        "skills_needed": ["data visualization","tableau","sql","statistics","python","data analysis","business analysis","excel","power bi"]
    },
    {
        "id": "33",
        "session_id": "1",
        "job_unique_id": "job_db255f631a8feb46",
        "job_title": "Part-Time EDI Analyst",
        "company_name": "REMEDI Electronic Commerce Group",
        "location_name": "Columbus, OH 43235, United States",
        "job_type": "Remote",
        "job_time": "Part-time",
        "salary": "Not specified",
        "accessibility_status": "False",
        "job_description": "REMEDI Electronic Commerce Group is looking for a Part-time EDI Analyst with experience in EDI integration within the Manufacturing Industry, specifically with Microsoft AX 2012 and Crowe Metals Accelerator (CMA). The role involves day-to-day EDI support, troubleshooting, partner onboarding, and requirements gathering with business teams.",
        "job_requirement": "Experience with EDI processes, Microsoft AX 2012, and CMA. Proficiency with X++ for custom coding is required. Strong troubleshooting, partner onboarding, and communication skills are a must. Minimum commitment of 10 hours per week for 23 months.",
        "link_logo": "https://drive.google.com/file/d/1RI9JYrKDPZU7rS3O4lqlFqwSYSBBR9A-/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=db255f631a8feb46&xpse=SoAZ67I34ZQsSVRSyh0LbzkdCdPP&xfps=9e10cf59-2c22-4ee2-92d5-2574895ccb39&xkcb=SoBT67M35-rUyhSJ9p0IbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:09",
        "skills_needed": ["data visualization","sql","statistics","python","business analysis"]
    },
    {
        "id": "34",
        "session_id": "1",
        "job_unique_id": "job_9bb885eeac35eed2",
        "job_title": "Travel Data Analyst",
        "company_name": "Triper Israel (via Keller Executive Search)",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$50,000 - $86,000 per year",
        "accessibility_status": "False",
        "job_description": "Triper Israel is seeking a meticulous and detail-oriented Travel Data Analyst to collect, analyze, and interpret travel-related data to inform business strategies and improve client offerings in the travel industry. The role involves transforming complex data into actionable insights to enhance decision-making and optimize travel services.",
        "job_requirement": "Bachelor's degree in Data Science, Statistics, Business Analytics, or related field. 2+ years of experience in data analysis, preferably in the travel or hospitality sectors. Proficiency in SQL, Excel, Python, and data visualization tools like Tableau or Power BI. Strong analytical, problem-solving, and communication skills. Knowledge of the travel industry is a plus.",
        "link_logo": "https://drive.google.com/file/d/1T_JhYyI1RExcONgfvA63OLnCA7kIArof/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=9bb885eeac35eed2&xpse=SoDW67I34ZQywWSsQp0LbzkdCdPP&xfps=cfe741e7-ca64-46c1-873e-2db4430daaf9&xkcb=SoDd67M35-rUyhSJ9p0PbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:09",
        "skills_needed": ["data visualization","tableau","sql","statistics","python","data analysis","business analysis","excel","power bi"]
    },
    {
        "id": "35",
        "session_id": "1",
        "job_unique_id": "job_98356052b511f42c",
        "job_title": "Program Analyst",
        "company_name": "Amerit Fleet Solutions",
        "location_name": "Walnut Creek, CA 94596, United States",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$80,000 - $90,000 per year",
        "accessibility_status": "True",
        "job_description": "Amerit Fleet Solutions is seeking a Senior Program Analyst responsible for converting data into actionable business insights. This role includes analyzing data, developing reports, designing automated data pipelines, and working closely with cross-functional teams to drive business outcomes.",
        "job_requirement": "Bachelor's degree in supply chain management, operations, engineering, analytics, or related field. 5+ years of business or financial analysis, 5+ years of SQL queries and BI tools experience (Power BI, Tableau). Strong proficiency in PowerPoint, Excel, and business intelligence tools. Knowledge of fleet operations is a plus.",
        "link_logo": "https://drive.google.com/file/d/1SvQjqBbA59dzZOsmy_itlgWIBeEr6ptp/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=98356052b511f42c&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:09",
        "skills_needed": ["data visualization","sql","statistics","python","business analysis"]
    },
    {
        "id": "36",
        "session_id": "1",
        "job_unique_id": "job_80d550659851a972",
        "job_title": "Data Engineering Management Analyst",
        "company_name": "Simple Technology Solutions",
        "location_name": "Washington, DC",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "False",
        "job_description": "The Data Engineering Management Analyst will be responsible for data migration, implementing business management principles, creating ETL jobs, and working with Azure Data Factory to create pipelines, data ingestion frameworks, and transformation frameworks. The role involves managing Big Data, working with Data Lake, reporting tools like PowerBI, and contributing to business management and forecasting.",
        "job_requirement": "7 years of position-related experience within the last 10 years. Experience with Azure Data Factory, PowerBI, Big Data, and Data Lake. Knowledge of data modeling techniques and Agile software development. Must be able to work 8 hours per day within 7am-6pm Eastern Time. No education requirements or certifications required.",
        "link_logo": "https://drive.google.com/file/d/1QZxLxsV6ovL0geY3SxTpVtmUw48uMB7s/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=80d550659851a972&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:10",
        "skills_needed": ["data visualization","tableau","sql","statistics","docker","python","cloud computing","java","kubernetes","data analysis","business analysis","excel","power bi","c++"]
    },
    {
        "id": "37",
        "session_id": "1",
        "job_unique_id": "job_4f9de52ada4dd536",
        "job_title": "Pharmacy Business-Data Analyst",
        "company_name": "EPIC Brokers",
        "location_name": "Dallas, TX",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$90,000 - $140,000 per year",
        "accessibility_status": "False",
        "job_description": "The Pharmacy Business-Data Analyst will support the Artemetrx software business, working closely with clients to gather data requirements, implementing client configurations, and ensuring accurate data execution. The role involves working with pharmacy claims, rebates, PBM contracting, and presenting client-facing documentation.",
        "job_requirement": "3+ years of experience in data analytics, preferably in healthcare. Strong knowledge of PBM contracting, pharmacy claim file layouts, and experience with data documentation for healthcare software solutions. Proficient in relational databases and business intelligence tools. Bachelor's degree in Analytics, Informatics, Business, Economics, Mathematics, or a related field.",
        "link_logo": "https://drive.google.com/file/d/124dXu0AoEDNgoNzlezYtIpqdgvY8viHg/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=4f9de52ada4dd536&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:10",
        "skills_needed": ["data visualization","tableau","sql","communication","statistics","strategy","python","data analysis","business analysis","excel","power bi"]
    },
    {
        "id": "38",
        "session_id": "1",
        "job_unique_id": "job_b744804c7c7c8930",
        "job_title": "Digital Business Analyst",
        "company_name": "Interactive Strategies",
        "location_name": "Washington, DC",
        "job_type": "Hybrid",
        "job_time": "Full-time",
        "salary": "$65,000 - $85,000 per year",
        "accessibility_status": "True",
        "job_description": "The Digital Business Analyst will collaborate with account managers, designers, and developers to define, clarify, and finalize technical requirements for web applications. Responsibilities include managing testing processes, creating user-interface flow diagrams, and ensuring effective communication between stakeholders to achieve project goals.",
        "job_requirement": "4+ years of experience in writing technical requirements for web development projects, including experience with QA testing, test scripts, and automated testing. Proficiency with content-management systems such as WordPress, and development methodologies like Agile and SCRUM. Experience with tools like Axure, Figma, and Silktide is a plus.",
        "link_logo": "https://drive.google.com/file/d/11tF7ZAOVDsHbMyaeAhcR0rl1fNWEzQin/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=b744804c7c7c8930&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:10",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "39",
        "session_id": "1",
        "job_unique_id": "job_510d62dd4c76d8be",
        "job_title": "Revenue Cycle Business Analyst II",
        "company_name": "Knowtion Health",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "From $68,000 per year",
        "accessibility_status": "True",
        "job_description": "The Revenue Cycle Business Analyst II will analyze claims inventory trends and patterns, working with leadership to prioritize accounts for processing. The role involves identifying areas for improvement in billing, claim reimbursement, and follow-up processes, with a focus on ensuring efficiency and accuracy in data analytics and operational improvements.",
        "job_requirement": "3+ years of experience in hospital revenue cycle analytics or equivalent experience in hospital accounts receivable claims management. Proficiency in Tableau, Microsoft Office applications (Excel, Visio, Word, PowerPoint), and hospital inventory management systems is required. Strong problem-solving, analytical skills, and an understanding of revenue cycle systems are also needed.",
        "link_logo": "https://drive.google.com/file/d/1-TJyHfgtffaCyBA7S81491F1azG5HZPz/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=510d62dd4c76d8be&xpse=SoDt67I34ZSzspgNXj0LbzkdCdPP&xfps=d87eaa40-21c3-454e-8c36-90531b08f536&xkcb=SoAd67M35-rUyhSJ9p0CbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:11",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "40",
        "session_id": "1",
        "job_unique_id": "job_a9d8e628ae3d9d19",
        "job_title": "SharePoint Business Analyst",
        "company_name": "Swanktek",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$80.00 per hour",
        "accessibility_status": "True",
        "job_description": "The SharePoint Business Analyst will design and implement SharePoint and web-based solutions to enhance critical Preconstruction processes within NCDOT’s Transportation Life Cycle. Responsibilities include gathering requirements, creating user stories, testing solutions, delivering training, and ensuring quality standards are met. The ideal candidate has business analysis experience, expertise in SharePoint design, strong analytical skills, and experience with AGILE development methodology.",
        "job_requirement": "8+ years of experience as a Business Analyst, proficiency in designing SharePoint solutions, experience in Quality Assurance testing, and familiarity with AGILE development methodology and SDLC. Strong communication, documentation, and organizational skills are required. Experience with NCDOT's Preconstruction processes and Azure DevOps is preferred.",
        "link_logo": "https://drive.google.com/file/d/1KjKcvM3jtQTxwinULI8PwnfyS8kb1AfU/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?cmp=Swanktek&t=Business+Analyst&jk=a9d8e628ae3d9d19&xpse=SoD567I34ZTdxvAFub0LbzkdCdPP&xfps=106c8d0f-da21-46af-b567-884c77a7c2ce&xkcb=SoCA67M35-rUyhSJ9p0BbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:11",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "41",
        "session_id": "1",
        "job_unique_id": "job_9a022e0a3f9d9958",
        "job_title": "Senior PACS Administrator",
        "company_name": "Nuvodia",
        "location_name": "Spokane Valley, Washington",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$65,675.20 - $105,572.67 a year",
        "accessibility_status": "True",
        "job_description": "Nuvodia, LLC is looking for a full-time qualified Senior PACS Administrator to join our Radiology Clinical IT support team. Scheduled Hours are M-F daytime shifts and is primarily a remote position.",
        "job_requirement": "Experience with XML, a valid Driver's License, and a Bachelor's degree are preferred.",
        "link_logo": "https://drive.google.com/file/d/1gWrba2pN3eGjy3hm0z46qG72VmRDn3rq/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?cmp=Nuvodia&t=Senior+Administrator&jk=9a022e0a3f9d9958&xpse=SoCI67I34Z3GQBQhwx0LbzkdCdPP&xfps=00ce3d1e-d429-43a4-9375-7ec6e068fa0b&xkcb=SoA067M35-rUyhSJ9p0AbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:12",
        "skills_needed": ["XML, Driver's License, Bachelor's degree"]
    },
    {
        "id": "42",
        "session_id": "1",
        "job_unique_id": "job_a57f87ce9d464803",
        "job_title": "Business Analyst Genesys Optimization",
        "company_name": "Chippenham Hospital",
        "location_name": "Richmond, VA 23225",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Parallon, a division of HCA Healthcare, is seeking a Business Analyst to join their Genesys Optimization team. This role offers the chance to work remotely while supporting the optimization of Genesys solutions in a healthcare environment.",
        "job_requirement": "Experience with Waterfall methodology and a Bachelor's degree are required.",
        "link_logo": "https://drive.google.com/file/d/1l-Shnih3UF_2RhFvyG96mWxlC0QYCN-X/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=a57f87ce9d464803&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:12",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "43",
        "session_id": "1",
        "job_unique_id": "job_711725c4c0c5d099",
        "job_title": "SharePoint Business Analyst",
        "company_name": "Buzz Clan",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Buzz Clan is seeking a SharePoint Business Analyst to design SharePoint and web-based content solutions. The role involves proficiency in Quality Assurance testing, AGILE methodology, and the Software Development Life Cycle (SDLC). This is a remote position with a focus on SharePoint, business process evaluation, and technical training.",
        "job_requirement": "8+ years of experience as a Business Analyst, SharePoint design experience, proficiency in Quality Assurance testing, and familiarity with AGILE methodology and SDLC. Strong communication, organizational, and analytical skills are required.",
        "link_logo": "https://drive.google.com/file/d/1TNGlWZWymeXM0S8uZj5mQlzGpwsUzSAz/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?cmp=buzz-clan&t=Business+Analyst&jk=711725c4c0c5d099&xpse=SoDP67I34aI777QhxB0LbzkdCdPP&xfps=86b0f6bc-859d-4c43-8bda-4b3c338febda&xkcb=SoAO67M35-rUyhSJ9p0GbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:12",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "44",
        "session_id": "1",
        "job_unique_id": "job_b8b10b5ae36031c0",
        "job_title": "Contact Center Optimization Business Analyst II",
        "company_name": "HCA FL SOUTH TAMPA HOSP - APP",
        "location_name": "Tampa, FL 33604",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "HCA Healthcare's Parallon division is seeking a full-time Business Analyst II to join their Contact Center Optimization team. This role is remote and supports the optimization of contact center processes, with a focus on revenue cycle management and other business analysis responsibilities.",
        "job_requirement": "Experience with Revenue Cycle Management and a Bachelor's degree are required.",
        "link_logo": "https://drive.google.com/file/d/1wO39kNU5erY5RbBVET0SpgMWo6fzrn2t/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=b8b10b5ae36031c0&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:12",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "45",
        "session_id": "1",
        "job_unique_id": "job_972897c72eaff8b7",
        "job_title": "Business Analyst Genesys Optimization",
        "company_name": "St. David's South Austin Medical Center",
        "location_name": "Austin, TX 78704",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Parallon, part of HCA Healthcare, is seeking a full-time Business Analyst for Genesys Optimization. The role focuses on enhancing contact center operations and utilizing Waterfall methodology for system optimizations. This position is remote.",
        "job_requirement": "Experience in Waterfall methodology and a Bachelor's degree are required.",
        "link_logo": "https://drive.google.com/file/d/16MLwuI_GCRvxeRbmDypx8wiUepBQpQ3N/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=972897c72eaff8b7&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:15",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "46",
        "session_id": "1",
        "job_unique_id": "job_0c561f43f988323b",
        "job_title": "Senior Data Analyst",
        "company_name": "MNTN",
        "location_name": "Austin, TX",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "MNTN is seeking a Senior Data Analyst to work remotely, handling cutting-edge online advertising technology. The role involves data transformations, analytics, and visualizations, driving measurable results in Connected TV advertising.",
        "job_requirement": "Experience in data transformations, analytics, and visualizations. Proficiency with data analysis tools and techniques. Strong understanding of online advertising technology and the ability to work with large data sets. Excellent communication and presentation skills are a must.",
        "link_logo": "https://drive.google.com/file/d/1SMsMFNGQY8iZN1sGqyTvl1-SgaJtmzno/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=0c561f43f988323b&xpse=SoBX67I34aJ_S6RSyh0LbzkdCdPP&xfps=8582f6d3-fec2-4eba-a3c8-446e92d33e6c&xkcb=SoB767M35-rUFZwGbZ0IbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:15",
        "skills_needed": ["data visualization","tableau","sql","statistics","python","data analysis","business analysis","excel","power bi"]
    },
    {
        "id": "47",
        "session_id": "1",
        "job_unique_id": "job_2cfbcaa3619c1bb3",
        "job_title": "Contact Center Optimization Business Analyst II",
        "company_name": "Medical City Children's Hospital (part of HCA Healthcare)",
        "location_name": "Dallas, TX 75230",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "HCA Healthcare's Parallon division is seeking a full-time Business Analyst II to join their Contact Center Optimization team. The role involves optimizing contact center operations, with a focus on revenue cycle management and business process improvements. This is a remote position.",
        "job_requirement": "Experience with Revenue Cycle Management and a Bachelor's degree are required. Strong analytical and communication skills, as well as proficiency in business analysis tools, are essential.",
        "link_logo": "https://drive.google.com/file/d/1xwjVrlcGQBjME81H95ovO7eH6rtz2wYR/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=2cfbcaa3619c1bb3&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:15",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "48",
        "session_id": "1",
        "job_unique_id": "job_a4722057dbaab0ca",
        "job_title": "Data Management Analyst",
        "company_name": "Goldbelt, Inc.",
        "location_name": "Florida",
        "job_type": "On-site",
        "job_time": "Full-time",
        "salary": "$100,000 - $140,000 a year",
        "accessibility_status": "True",
        "job_description": "Goldbelt, Inc. is seeking a full-time Data Management Analyst to support the Division of STD Prevention (DSTDP) at the CDC. The role involves data analysis, creating data dashboards, and managing health data for public health surveillance and research.",
        "job_requirement": "Experience in Word processing and a Master's degree are preferred. Strong skills in data management, data analysis, and the ability to work with health data are essential.",
        "link_logo": "https://drive.google.com/file/d/1W0FA7PazoR4WCP6YqlDgjZ8-RMHETDRw/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=a4722057dbaab0ca&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:16",
        "skills_needed": ["data visualization","tableau","sql","statistics","python","data analysis","business analysis","excel","power bi"]
    },
    {
        "id": "49",
        "session_id": "1",
        "job_unique_id": "job_f6529f3404c41920",
        "job_title": "Business Transformation Analyst - DODF12",
        "company_name": "QinetiQ US",
        "location_name": "Washington, DC",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "QinetiQ US is seeking a Business Transformation Analyst to support the Department of Defense (DOD). The role involves business analysis, supporting defense-related projects, and leveraging technologies such as Tableau for data analysis and visualization.",
        "job_requirement": "Experience with Tableau and a Bachelor's degree are required. Knowledge of defense, aerospace, security, or related fields is preferred. Strong analytical and communication skills are necessary.",
        "link_logo": "https://drive.google.com/file/d/12en5mR22v3yfNo-6jI6JT2kco3Vy694u/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=f6529f3404c41920&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:16",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "50",
        "session_id": "1",
        "job_unique_id": "job_b7e4cd894e1d7863",
        "job_title": "Business Analyst Genesys Optimization",
        "company_name": "HCA Florida Memorial Hospital (part of HCA Healthcare)",
        "location_name": "Jacksonville, FL 32216",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "HCA Florida Memorial Hospital is seeking a full-time Business Analyst for Genesys Optimization. The role involves optimizing contact center operations and supporting business transformation initiatives. This position is remote.",
        "job_requirement": "Experience with Waterfall methodology and a Bachelor's degree required. Strong analytical skills, business analysis expertise, and understanding of contact center technologies are essential.",
        "link_logo": "https://drive.google.com/file/d/19g8Sx_gNZxbTxG3kspiFUSsn7uRDK5lf/view?usp=drive_link",
        "job_link": "https://www.indeed.com/viewjob?jk=b7e4cd894e1d7863&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:16",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "51",
        "session_id": "1",
        "job_unique_id": "job_18fdb030a3ce4b25",
        "job_title": "Contact Center Optimization Business Analyst II",
        "company_name": "Reston Hospital Center",
        "location_name": "Reston, VA 20190",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Reston Hospital Center is seeking a full-time Business Analyst II for Contact Center Optimization. The role involves improving business processes in the contact center and supporting healthcare transformation initiatives. This is a remote position.",
        "job_requirement": "Experience with revenue cycle management and a Bachelor's degree required. Strong analytical skills, business process optimization expertise, and familiarity with healthcare contact center operations are essential.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=18fdb030a3ce4b25&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:17",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "52",
        "session_id": "1",
        "job_unique_id": "job_da3778ec5d622f29",
        "job_title": "Data Analyst - Remote",
        "company_name": "iMarketResearch",
        "location_name": "Longboat Key, FL 34228",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Competitive salary (please specify your requirements when applying)",
        "accessibility_status": "True",
        "job_description": "iMarketResearch is seeking a Data Analyst to join the Advanced Analytics team. The role involves advanced data analysis, providing data-driven insights, and collaborating with team members to refine methodologies. This is a remote position.",
        "job_requirement": "A Master's degree in Statistics, Mathematics, Data Science, or related quantitative field. Proficiency with Python or R for data analysis, and experience with statistical packages like SPSS. Strong problem-solving, analytical, and communication skills are required.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=da3778ec5d622f29&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:18",
        "skills_needed": ["data visualization","tableau","sql","statistics","python","data analysis","business analysis","excel","power bi"]
    },
    {
        "id": "53",
        "session_id": "1",
        "job_unique_id": "job_f5f3ce8acf945c52",
        "job_title": "Contact Center Optimization Business Analyst II",
        "company_name": "TriStar Mt. Juliet ER",
        "location_name": "Mount Juliet, TN 37122",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "TriStar Mt. Juliet ER is seeking a full-time Business Analyst II for Contact Center Optimization. The role involves optimizing business processes in the contact center and supporting healthcare transformation initiatives. This is a remote position.",
        "job_requirement": "Experience with revenue cycle management and a Bachelor's degree required. Strong analytical skills, business process optimization expertise, and familiarity with healthcare contact center operations are essential.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=f5f3ce8acf945c52&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:18",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "54",
        "session_id": "1",
        "job_unique_id": "job_0aa12f7b40ca0dd4",
        "job_title": "Contact Center Optimization Business Analyst II",
        "company_name": "St. David's North Austin Medical Center",
        "location_name": "Austin, TX 78758",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "St. David's North Austin Medical Center is seeking a Business Analyst II to optimize contact center operations, analyze business processes, and enhance operational efficiency within healthcare services. This position is remote.",
        "job_requirement": "A Bachelor's degree and at least 5 years of business analysis experience required. Knowledge of healthcare processes and experience in contact center operations are preferred. Genesys Contact Center experience is a plus.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=0aa12f7b40ca0dd4&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:19",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "55",
        "session_id": "1",
        "job_unique_id": "job_c232345270257e7a",
        "job_title": "Contact Center Optimization Business Analyst II",
        "company_name": "Parallon",
        "location_name": "Nashville, TN 37203",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Parallon is looking for a Business Analyst II to work on optimizing contact center operations. This is a remote, full-time position focused on analyzing business processes and improving operational efficiency within healthcare services.",
        "job_requirement": "Bachelor's degree preferred, with 5+ years of business analysis experience. Knowledge of contact center operations and experience in healthcare-related processes, such as patient scheduling, customer service, or collections, is required. Genesys Contact Center experience is preferred.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=c232345270257e7a&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:19",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "56",
        "session_id": "1",
        "job_unique_id": "job_2e3f81a63aac0f9b",
        "job_title": "Business Analyst Genesys Optimization",
        "company_name": "Portsmouth Regional Hospital",
        "location_name": "Portsmouth, NH 03801",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Parallon is seeking a Business Analyst to work on Genesys optimization within contact center operations. This is a remote, full-time position that involves analyzing and improving business processes to optimize the performance of contact centers.",
        "job_requirement": "Bachelor's degree preferred, with 3+ years of business analysis experience. Genesys experience is required. Knowledge of Agile and Waterfall methodologies, as well as experience in healthcare-related processes such as patient scheduling, customer service, or collections, is preferred.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=2e3f81a63aac0f9b&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:19",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "57",
        "session_id": "1",
        "job_unique_id": "job_4e663e54e7b4c29f",
        "job_title": "Business Analyst - No C2C",
        "company_name": "Elegant Enterprise Wide Solutions, Inc",
        "location_name": "Chantilly, Virginia",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$72 - $78 an hour",
        "accessibility_status": "True",
        "job_description": "Elegant Enterprise Wide Solutions, Inc is seeking a Business Analyst to provide critical analysis to statewide system and application inventory, develop business requirements for IT solutions, and evaluate IT technologies. The role involves supporting project objectives, risk assessments, and trend reporting in a remote, contract position.",
        "job_requirement": "Bachelor's Degree in Business Management, Cybersecurity, Information Technology, or related field. 5+ years of experience in IT business analysis and requirements development, with the ability to analyze data and manage project documentation. Experience with project management methodology is required. Cybersecurity experience and certifications are preferred.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Elegant-Enterprise-Wide-Solutions%2C-Inc.&t=Business+Analyst&jk=4e663e54e7b4c29f&xpse=SoBs67I34aON2eQvxR0LbzkdCdPP&xfps=18b97da0-a372-4863-809b-78c46576383e&xkcb=SoC767M35-rUFZwGbZ0FbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:20",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "58",
        "session_id": "1",
        "job_unique_id": "job_b5f0d994888f69f8",
        "job_title": "Business Analyst Genesys Optimization",
        "company_name": "Parallon (HCA Healthcare)",
        "location_name": "Nashville, TN 37203",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "As a Business Analyst, you will work with Operations users to define, interpret, and analyze business solutions, while developing, testing, and implementing enhanced business processes. You will contribute to business analysis, tool development, and collaborate with stakeholders to ensure that business requirements are clearly defined and communicated.",
        "job_requirement": "Bachelor's degree in Business or related field (equivalent work experience may substitute education requirement). 3+ years of business analysis experience, with expertise in Genesys, Agile, and Waterfall methodologies. Experience in contact center operations is preferred. Knowledge of healthcare patient scheduling, customer service, or collections is a plus.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=b5f0d994888f69f8&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:20",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "59",
        "session_id": "1",
        "job_unique_id": "job_77fac23123db796f",
        "job_title": "Salesforce Business Analyst",
        "company_name": "MetroStar",
        "location_name": "Washington, DC",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "As a Salesforce Business Analyst, you will connect business needs with technical solutions within the Salesforce ecosystem. You will be responsible for eliciting business requirements, translating them into functional specifications, and working closely with developers to deliver Salesforce solutions. Additionally, you'll ensure smooth transitions and user adoption during Salesforce's tri-annual releases.",
        "job_requirement": "Bachelor's degree in Business Administration, Information Systems, or a related field. An active Secret security clearance is required. 5+ years of experience as a Salesforce Business Analyst, with expertise in Salesforce Service Cloud and/or Public Sector Solutions. Experience with other Salesforce clouds is a plus. Strong experience with release management, sandbox testing, regression testing, and production smoke testing.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=77fac23123db796f&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:20",
        "skills_needed": ["data visualization","communication","sql","statistics","strategy","python","data analysis","business analysis","excel"]
    },
    {
        "id": "60",
        "session_id": "1",
        "job_unique_id": "job_6262f632c990ba4e",
        "job_title": "Visual Designer",
        "company_name": "RLA Engineering, LLC",
        "location_name": "Vancouver, WA",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$53.80 per hour",
        "accessibility_status": "True",
        "job_description": "The Visual Designer will create compelling visual assets across the client’s product portfolio, including services, digital marketing, and eCommerce. Responsibilities include collaborating with cross-disciplinary teams, drafting design specifications, creating high-quality mockups, and managing design systems. The role requires expertise in design tools like Figma, Miro, Adobe Creative Suite, and more.",
        "job_requirement": "Bachelor’s degree in Design, Graphic Design, HCI, Visual Arts, or related field. 7-10 years of experience as a Visual Designer, with 3-5 years focused on eCommerce and UX. Proficiency in design tools such as Figma, Adobe Creative Suite, and others. Experience with user-centered design principles and design systems is required. Must be eligible to work in the U.S. without sponsorship.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=6262f632c990ba4e&xpse=SoBS67I34aPCYNQrEx0LbzkdCdPP&xfps=6952df8e-5b85-4425-a7ef-02f9ad964b60&xkcb=SoDz67M34Frz1TQGXx0DbzkdCdPP&vjs=3",
        "timestamp": "2024-11-30 12:46:24",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "61",
        "session_id": "2",
        "job_unique_id": "job_bdb3c08b990310e0",
        "job_title": "Data Engineering Architect",
        "company_name": "UST Global",
        "location_name": "Aliso Viejo, CA",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$116,000 - $174,000 per year",
        "accessibility_status": "True",
        "job_description": "As a Data Engineering Architect, you will design and optimize scalable ETL/ELT pipelines using Databricks and Apache Spark. The role involves architecting data solutions across cloud platforms like AWS, Azure, and GCP, working with AI/ML concepts, and ensuring data lakes and lakehouses are efficiently managed. You'll engage with stakeholders, lead code reviews, and stay updated on industry trends.",
        "job_requirement": "Bachelor's degree in Computer Science or related field. 10+ years in data engineering with expertise in Databricks, Apache Spark, and cloud platforms (AWS, Azure, GCP). Experience with AI/ML concepts and IT consulting (preferably in Healthcare, Retail, BFSI) is preferred. Proficiency in PySpark, SQL, Python, and architectural leadership is required.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=bdb3c08b990310e0&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:24",
        "skills_needed": ["tableau","sql","statistics","docker","python","cloud computing","java","kubernetes","data analysis","excel","power bi","c++"]
    },
    {
        "id": "62",
        "session_id": "2",
        "job_unique_id": "job_0209edfacd6ace39",
        "job_title": "Outage Manager",
        "company_name": "FieldCore",
        "location_name": "Atlanta, GA",
        "job_type": "Remote",
        "job_time": "Full-time - (Overtime, Weekends, Holidays as needed)",
        "salary": "$101,900 - $167,600 a year",
        "accessibility_status": "True",
        "job_description": "The Outage Manager is responsible for preparation, planning, leading execution, and close out of complex planned/emergent Outage events for gas turbine, steam turbine, and generator agreements while supporting the development of the business strategy for field fulfilment excellence in FieldCore. The role involves managing outage schedule development, cost planning, customer management, mobilization planning, and site execution. The Outage Manager will lead outage events and manage teams during outages to ensure Fulfilment-5 goals are met and improve outage cost, productivity, and on-time delivery.",
        "job_requirement": "Bachelor's degree in Science/Engineering or equivalent 4 years of experience in the power generation industry. 8+ years of applicable experience in gas/steam turbine or generator maintenance. 3+ years of specialized experience in outage planning and execution for gas/steam turbines and auxiliary systems. Proficiency in English. Strong Project Management skills, preferably with Primavera scheduling tool. Strong technical knowledge in turbines and generators. Ability to manage multiple projects simultaneously and work in cross-functional teams.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=0209edfacd6ace39&from=serp&vjs=3",
        "timestamp": "2024-11-30 12:46:24",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "63",
        "session_id": "2",
        "job_unique_id": "job_eef5f5ce92671579",
        "job_title": "Industrial Engineer II",
        "company_name": "Southwire Company, LLC",
        "location_name": "Carrollton, GA",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "This role provides industrial engineering support for all Customer Service Centers, leading continuous improvement initiatives, cost reduction projects, capital project justifications, plant efficiency determination, and work measurement. The individual will work to ensure Lean objectives are met, retrieve and analyze data from SAP and BI, lead cost reduction projects, and improve Excel tools for reporting. Additional responsibilities include maintaining training documentation, participating in Lean events, and solving problems with standard procedures.",
        "job_requirement": "Bachelor's Degree in Industrial Engineering and 3+ years of related experience required. Strong analytical, time management, and problem-solving skills. Excellent leadership, communication, and interpersonal skills. Proficiency in Excel, Word, and PowerPoint. Ability to work efficiently in a fast-paced office setting with limited oversight. Ability to travel up to 25%.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=eef5f5ce92671579&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:24",
        "skills_needed": ["Time Management", "Problem Solving", "Industrial Engineering", "Data Analysis", "Lean Manufacturing", "SAP", "Excel", "Project Management", "Leadership"]
    },
    {
        "id": "64",
        "session_id": "2",
        "job_unique_id": "job_3631197def4ffec7",
        "job_title": "Engineer - Failure Analysis",
        "company_name": "Sms Infocomm Corporation",
        "location_name": "Austin, TX 73301",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "The Failure Analysis Engineer is responsible for investigating product failures and performing first-level failure analysis on customer-returned server/workstation computers. Responsibilities include visual mechanical inspection of components, troubleshooting and repairing system failures, conducting failure analysis to identify root causes, and communicating findings both internally and with the client. The role requires expertise in using electronic test equipment, database management, and performing component-level troubleshooting.",
        "job_requirement": "Bachelor's degree in Electronics, Mechanical/Electrical Engineering, Computer/Server repair, or related field. 0-2 years of experience in a failure analysis role or 4+ years in electronics quality inspection. Strong knowledge of computer systems, troubleshooting skills, and proficiency in using electronic test equipment. Familiarity with MS Office, especially Excel, and the ability to read and interpret schematics and system board layouts. Ability to work cross-functionally with minimal supervision. Fluency in English is required, Mandarin Chinese is a plus.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=3631197def4ffec7&xpse=SoCz67I34aBGAIRSlR0LbzkdCdPP&xfps=a38a974b-1818-4fc8-a99f-3ce506b5bbf9&xkcb=SoDg67M34Frz1TQGXx0HbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:24",
        "skills_needed": ["Failure Analysis", "Troubleshooting", "Electronics", "Mechanical Inspection", "Database Management", "System Repair", "Communication", "MS Office", "Analytical Skills", "Mandarin Chinese (preferred)"]
    },
    {
        "id": "65",
        "session_id": "2",
        "job_unique_id": "job_4952b93456d11fd5",
        "job_title": "Business Development Manager",
        "company_name": "Sensience",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "The Business Development Manager will lead strategic planning and market intelligence efforts, driving growth through partnerships and revenue generation. Responsibilities include developing business development strategies, identifying new market opportunities, managing relationships with key decision-makers, and reporting on pipeline and revenue progress. The role requires collaboration with cross-functional teams and a proven track record of meeting sales quotas in a manufacturing environment.",
        "job_requirement": "Bachelor’s degree in Engineering, Business, or a related field. 3+ years of sales experience in a hunter role within manufacturing, with a proven ability to close six-figure deals. A history of meeting and exceeding sales quotas. Proficiency in MS Office (Word, Excel, PowerPoint, Outlook) and CRM tools. Excellent verbal and written communication skills.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=4952b93456d11fd5&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:25",
        "skills_needed": ["jira","communication","strategy","project management","data analysis","business analysis","excel","leadership"]
    },
    {
        "id": "66",
        "session_id": "2",
        "job_unique_id": "job_046babe81c34ce1d",
        "job_title": "Hardware Design-Digital Engineer",
        "company_name": "Arrow Electronics, Inc.",
        "location_name": "Cedar Rapids, IA 52402",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$77,000 - $154,000 a year",
        "accessibility_status": "True",
        "job_description": "The Hardware Design-Digital Engineer will design and implement high-reliability electronic systems, including PCBs, embedded systems, and power electronics. Responsibilities include all aspects of circuit card design lifecycle, from requirements capture to testing and troubleshooting. The role requires proficiency in schematic capture tools, FPGA design, and compliance with industry standards such as DO-254 and DO-160. Experience with requirement management tools and hardware verification/validation is essential.",
        "job_requirement": "Bachelor's degree in Electrical Engineering or a related field. Experience in hardware design, including circuit card design, FPGA, processor, DDR memory, and industry interfaces like Ethernet, PCIe, USB, I2C, LVDS, and SERDES. Proficiency with schematic capture tools like Siemens Mentor Graphics, Altium, Cadence Allegro, and tools for requirement management such as IBM Doors or Jama. Familiarity with Agile methodologies for hardware development is a plus. Experience with hardware verification/validation to DO-254 standards.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=046babe81c34ce1d&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:25",
        "skills_needed": ["Hardware Design", "Circuit Card Design", "FPGA", "Schematic Capture", "Signal Integrity", "Requirements Management", "DO-254", "DO-160", "Agile", "Microsoft Office"]
    },
    {
        "id": "67",
        "session_id": "2",
        "job_unique_id": "job_009a1d72229609cc",
        "job_title": "Run Rate Quote Representative",
        "company_name": "RLA Engineering, LLC",
        "location_name": "Vancouver, WA",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$16.60 per hour",
        "accessibility_status": "True",
        "job_description": "The Run Rate Quote Representative is responsible for supporting sales, revenue, and bookings goals by generating and delivering service renewal quotations. The role involves data analysis, research, and collaboration with sales, service ops, partners, and order management. Responsibilities also include addressing customer issues, performing data entry, and tracking quoting metrics. The ideal candidate will have a background in sales support, data analysis, and CRM systems.",
        "job_requirement": "Associate’s degree preferred or equivalent experience. 2+ years in sales support or related fields. Proficiency in Microsoft Office Suite (Word, Excel, Outlook, PowerPoint, Visio, Teams, and SharePoint). Familiarity with SAP S4 and Siebel systems is preferred. Experience with CRM systems and working in sales operations. Strong communication and customer service skills.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=009a1d72229609cc&xpse=SoCA67I34aFybagFub0LbzkdCdPP&xfps=7928ded9-9691-4d8d-a5ab-6f8eb394f4ba&xkcb=SoB967M34Frz1TQGXx0EbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:25",
        "skills_needed": ["Data Analysis", "Sales Support", "CRM", "SAP S4", "Oracle", "Microsoft Office", "Customer Service", "Reporting"]
    },
    {
        "id": "68",
        "session_id": "2",
        "job_unique_id": "job_05601e11b37a306f",
        "job_title": "Technical Service Support Manager",
        "company_name": "Black & Decker (U.S.) Inc.",
        "location_name": "Towson, MD 21286",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Competitive Salary (Not specified)",
        "accessibility_status": "True",
        "job_description": "The Technical Service Support Manager will manage technical service information and product serviceability plans for the Authorized Network. Responsibilities include developing serviceability strategies, training modules, product tear-down events, and collaborating with engineering and manufacturing teams. The manager will handle service notifications, manage product recalls, forecast spare parts, and collaborate with IT for system enhancements. Experience in SAP, Windchill, and project management is required.",
        "job_requirement": "Bachelor's Degree in Engineering, Business Administration, or a related field. Minimum of 5 years of experience in technical service management or a related role. Strong familiarity with engineering systems (Windchill, SAP), project management, and problem-solving. Experience in forecasting, inventory management, and cross-functional collaboration is preferred.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=05601e11b37a306f&xpse=SoCz67I34aGEIiQhxB0LbzkdCdPP&xfps=4b4e9ff9-b696-4dd1-95e5-2e5c358b15cb&xkcb=SoBa67M34Frz1TQGXx0bbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:25",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "69",
        "session_id": "2",
        "job_unique_id": "job_52cdcf08f439456c",
        "job_title": "Tactical Radio Network Engineer",
        "company_name": "MAG Aerospace",
        "location_name": "Aberdeen Proving Ground, MD 21005",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$140,000 - $170,000 a year",
        "accessibility_status": "True",
        "job_description": "MAG Aerospace is seeking a Tactical Radio Network Engineer to support and advise the Product Manager for Terrestrial Spectrum Warfare (PdM TSW) on tactical radios and related networks. This role involves network architecture design, configuration, testing, training, and collaboration with various stakeholders including the Army acquisition community. The position requires expertise in running and modifying simulations, network/system design analysis, and coordination of communications and networking requirements.",
        "job_requirement": "Minimum of 10 years of experience with DoD tactical radios and related networks. BS in Electrical Engineering, Computer Science, or similar field. Active TS/SCI clearance is required. Preferred qualifications include a Master's degree in Computer Science or related field. Experience with simulations, analysis, and multi-disciplinary team coordination. Ability to travel up to 25% within CONUS.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=52cdcf08f439456c&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:25",
        "skills_needed": ["Tactical Radio Networks", "DoD", "Network Design", "Simulation", "Systems Analysis", "Stakeholder Coordination", "MS Office", "TS/SCI Clearance"]
    },
    {
        "id": "70",
        "session_id": "2",
        "job_unique_id": "job_271f286037b3be33",
        "job_title": "Senior Account Manager",
        "company_name": "Danfoss",
        "location_name": "Ames, IA",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Danfoss is looking for a Senior Account Manager with expertise in hydraulics and electromobility, focusing on OEM customers in agriculture, construction, and off-highway sectors. Responsibilities include achieving sales growth, identifying new sales opportunities, managing customer relations, and applying Danfoss' sales and pricing methodologies. The role involves coordination with internal teams, trade shows, and participation in sales planning and development.",
        "job_requirement": "Bachelor's degree in Hydraulics or related field, with 5-8 years of technical sales experience in the hydraulics industry. Strong communication skills and experience working with diverse teams. Preferred qualifications include a Bachelor's degree in Engineering or Business, and IFPS certifications.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=271f286037b3be33&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:25",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "71",
        "session_id": "2",
        "job_unique_id": "job_5e7590bb54c0b4be",
        "job_title": "Sr. Staff Electrical System Engineer",
        "company_name": "Rivian and Volkswagen Group Technology",
        "location_name": "Remote",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "The Sr. Staff Electrical Systems Engineer will contribute to the integration and testing of vehicle power, communications, architecture, and energy distribution for low-voltage electrical systems. Responsibilities include creating and executing test plans, analyzing test outcomes, collaborating with cross-functional teams, debugging hardware and software issues, and supporting the integration of next-gen electrical systems.",
        "job_requirement": "BS + 10 years or MS + 8 years or PhD + 3 years in electrical engineering or related field. Strong understanding of electrical systems, system integration, and software. Proficiency in test and measurement tools, scripting languages (Python), and the ability to work in fast-paced, challenging environments. Automotive experience preferred.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=5e7590bb54c0b4be&xpse=SoD267I34aG3-IQrJR0LbzkdCdPP&xfps=30949250-4060-4e24-8f47-e5355b6a546c&xkcb=SoDH67M34Frz1TQGXx0YbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:25",
        "skills_needed": ["simulink","circuit design","matlab","power systems"]
    },
    {
        "id": "72",
        "session_id": "2",
        "job_unique_id": "job_dfb18326aeba99b9",
        "job_title": "CAD Administrator",
        "company_name": "Fieldstone Architecture & Engineering",
        "location_name": "Tampa, FL",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "The CAD Administrator supports project teams with expert CAD knowledge and BIM techniques. Responsibilities include providing technical user support, troubleshooting Autodesk Architecture-related issues, creating training materials, and maintaining CAD systems. The role involves training new employees, performing software maintenance, planning future system upgrades, and providing feedback on project activities.",
        "job_requirement": "High school diploma required; Bachelor's in architecture, engineering, or related field preferred. 10 years of modeling experience with expertise in Autodesk Architecture, Revit, and other BIM tools. Proficiency in MS Office, with experience in programming languages (C#, Java, VBA, Python) and web development (HTML, CSS, JavaScript) preferred.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=dfb18326aeba99b9&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:25",
        "skills_needed": ["Autodesk Architecture", "Revit", "BIM Tools", "MS Office", "C#", "Java", "VBA", "Python", "HTML", "CSS", "JavaScript"]
    },
    {
        "id": "73",
        "session_id": "2",
        "job_unique_id": "job_386c73025f6b4e62",
        "job_title": "FS-Quality Assurance Engineer",
        "company_name": "The New IEM, LLC",
        "location_name": "Ashburn, VA",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "The FS-Quality Assurance Engineer supports Quality and ISO 9001 in manufacturing and process functions at IEM. Responsibilities include analyzing and monitoring process & quality metrics, writing technical reports, optimizing manufacturability, reviewing product performance, conducting corrective actions, developing quality procedures, and facilitating problem-solving techniques. The role involves working closely with engineering teams and suppliers to drive continuous improvement.",
        "job_requirement": "Degree in Engineering or related field; 2-3 years of experience in quality assurance. Proficiency in Six Sigma methodology (Green Belt minimum, Black Belt preferred), experience with electrical connectors, harnesses, and testing equipment. Knowledge of IPC-620 and ISO 9001 QMS systems required. Proficiency in Microsoft Office (Excel, Outlook, Access, PowerPoint).",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=386c73025f6b4e62&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:25",
        "skills_needed": ["Six Sigma", "ISO 9001", "Quality Assurance", "Manufacturing Process", "Solidworks", "Failure Analysis", "Microsoft Office", "UL/CSA", "Problem Solving", "Process Improvement"]
    },
    {
        "id": "74",
        "session_id": "2",
        "job_unique_id": "job_16eebd6743eeb803",
        "job_title": "Corrosion Engineer",
        "company_name": "Universal Technical Resource Services, Inc.",
        "location_name": "Richmond, VA",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$122,000 - $202,000 a year",
        "accessibility_status": "True",
        "job_description": "The Corrosion Engineer will design, assess, and commission cathodic protection systems, including galvanic and impressed current systems. This role involves reviewing specifications, performing site investigations, and leading client meetings. The position requires 20% out-of-state travel, with current projects in multiple states, including Texas, Illinois, and Virginia. The engineer will also develop testing plans, perform calculations, and direct field repairs.",
        "job_requirement": "Certification in corrosion technology or related field; 10+ years of experience in cathodic protection systems; AMPP/NACE certified Cathodic Protection Specialist (CP Level 4 or equivalent certification). Experience with transit systems and water pipelines preferred. Professional Engineering (PE) license in Illinois is a plus. Must have a valid TWIC card and driver's license. Physical ability to lift objects up to 40 pounds and work in varied environments.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=16eebd6743eeb803&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:25",
        "skills_needed": ["Cathodic Protection", "Corrosion Technology", "Galvanic Systems", "Impressed Current Systems", "Transit Systems", "Water Pipelines", "Testing Plans", "Client Meetings", "Field Repairs", "AMPP/NACE Certification", "PE License", "TWIC Card"]
    },
    {
        "id": "75",
        "session_id": "2",
        "job_unique_id": "job_e2d0856fdf74e373",
        "job_title": "Remote Visual Inspection (RVI) - Mechanical/Military/Avionics",
        "company_name": "Applied Technical Services LLC",
        "location_name": "214 Pelham Davis Circle, Greenville, SC 29615",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Applied Technical Services, LLC (ATS) is a leading provider of critical testing, inspection, certification, and compliance services, serving industries such as manufacturing, aerospace, medical, and defense. The company is headquartered in Marietta, GA, and has over 95 locations across the U.S. Remote Visual Inspection (RVI) involves the use of technology like video borescopes, push cameras, robotics, and drones for visual examinations of customer assets. RVI work is performed in diverse industries including Nuclear Power Plants, Gas Turbine Plants, Refineries, and Paper Mills. Technicians may inspect turbines, reactor heads, tanks, pipes, or vessels.",
        "job_requirement": "Applicants must have excellent communication skills, a high school diploma or GED, a valid driver's license, and the ability to pass a drug screen. U.S. Persons only due to export control regulations. Experience with industrial environments and prior military or engineering backgrounds are preferred but not required.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=e2d0856fdf74e373&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:27",
        "skills_needed": ["Communication skills", "Technical inspection", "RVI equipment setup", "Report writing", "Industrial safety"]
    },
    {
        "id": "76",
        "session_id": "2",
        "job_unique_id": "job_f8a9801b103849ae",
        "job_title": "Steel Erection Project Manager",
        "company_name": "Mastercraft Labor Services",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$110,000 - $130,000 a year",
        "accessibility_status": "True",
        "job_description": "The Project Manager is responsible for the overall health of projects, including schedule, cost, safety, quality, and customer relationships. The role involves managing resources, budgets, schedules, and job cost models, ensuring that construction work is completed on schedule. Responsibilities include overseeing the erection of structural steel, miscellaneous metals, joist, and metal decks for commercial projects, while also ensuring safety standards and quality controls are followed.",
        "job_requirement": "A Bachelor's degree in engineering or construction management or at least five years of experience in the construction industry with a minimum of three years in commercial structural steel erection. Strong communication, problem-solving, and planning skills required. Ability to manage multiple projects concurrently, read structural steel shop drawings, and coordinate with internal teams. Experience with construction scheduling and safety procedures is necessary. U.S. applicants only.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=f8a9801b103849ae&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:27",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "77",
        "session_id": "2",
        "job_unique_id": "job_e72a176be720e01f",
        "job_title": "ICAM Engineer",
        "company_name": "TechSur Solutions",
        "location_name": "Herndon, VA",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Depends on experience",
        "accessibility_status": "True",
        "job_description": "TechSur Solutions is seeking an ICAM Engineer to provide technical support for analyzing and implementing an ICAM solution for a Federal Agency. Responsibilities include managing MFA lifecycle processes, conducting gap analysis, designing future state solutions, and supporting the agency's ICAM strategy. The engineer will evaluate new technologies, provide recommendations for improvements, and assist with vendor solicitations. A key part of the role involves developing technical documentation, including architectures, diagrams, and reports.",
        "job_requirement": "6+ years of experience in designing, deploying, and supporting enterprise ICAM architectures. Proficiency in MFA, SAML, OpenID Connect, OAuth 2.0, SCIM, ZTA, and relevant security technologies. Strong communication skills and experience with Enterprise Architecture frameworks like TOGAF and Zachman. Familiarity with federal security regulations, NIST guidelines, and federal security benchmarks is required. A Bachelor’s degree in computer science or related field is preferred, but equivalent practical experience will be considered.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=e72a176be720e01f&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:27",
        "skills_needed": ["MFA", "SAML", "OpenID Connect", "OAuth 2.0", "SCIM", "ZTA", "ICAM architecture", "Federal security regulations", "TOGAF", "Zachman", "System integration", "Technical documentation"]
    },
    {
        "id": "78",
        "session_id": "2",
        "job_unique_id": "job_73fc1cdaf90874c0",
        "job_title": "Agile Manager",
        "company_name": "CoreAVI",
        "location_name": "Fort Worth, TX",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "CoreAVI is looking for an Agile Manager to drive the introduction and implementation of Agile methodologies within software engineering teams, while managing an Integrated Master Schedule. The role involves monitoring progress, identifying risks, managing resources, and ensuring compliance with DO-178C and ISO 26262 standards. Responsibilities also include coaching team members in Agile best practices, risk management, and performance tracking to improve KPIs and meet project milestones.",
        "job_requirement": "Bachelor's degree in engineering, computer science, or equivalent proven work experience. 7+ years of project management experience in both Waterfall and Agile frameworks, preferably in aerospace or automotive engineering. Experience with MS Project, Jira/Confluence, and project management certifications (PMP/PgMP, PMI-ACP) is highly desirable. Familiarity with DO-178C, ISO 26262, and AS9100 standards is beneficial. Strong communication, leadership, and analytical skills required.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=73fc1cdaf90874c0&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:27",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "79",
        "session_id": "2",
        "job_unique_id": "job_93fb54ba52a98cd3",
        "job_title": "Professional Forensic Engineer (Florida Panhandle)",
        "company_name": "HireUp Talent",
        "location_name": "Tallahassee, FL",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "From $120,000 a year",
        "accessibility_status": "True",
        "job_description": "The Professional Forensic Engineer will be responsible for managing and conducting field reconnaissance for forensic engineering exploration projects, drafting engineering reports, and maintaining client relationships. The role includes providing quality assurance/quality control (QA/QC) reviews, leadership to junior staff, and traveling for work as needed. The position requires a Professional Engineer license and the ability to work in a fast-paced environment.",
        "job_requirement": "A Bachelor's degree in Engineering and a valid Professional Engineer (PE) license in Georgia, Texas, Louisiana, and Florida are required. The ability to multi-task and prioritize tasks in a fast-paced environment is essential. Working knowledge of Microsoft Word and Outlook is necessary. The role also requires the ability to travel (up to five business days) and a valid driver's license compliant with commercial vehicle insurance requirements.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=93fb54ba52a98cd3&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:27",
        "skills_needed": ["Forensic engineering", "Field reconnaissance", "Engineering reports", "Quality assurance", "Quality control", "Client relationship management", "Leadership", "Microsoft Word", "Microsoft Outlook", "Professional Engineer license"]
    },
    {
        "id": "80",
        "session_id": "2",
        "job_unique_id": "job_66438916bbde52b5",
        "job_title": "Sr. Product Manager",
        "company_name": "Perfect Path, LLC, d/b/a Trajector Services",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$130,000 - $160,000 a year",
        "accessibility_status": "True",
        "job_description": "The Senior Product Manager is responsible for leading strategic and tactical product initiatives, aligning product strategy with the organization's goals, and overseeing cross-functional teams. This role includes managing product releases, data analysis, customer advocacy, stakeholder collaboration, market analysis, and team leadership in a B2B SaaS environment. The Senior Product Manager reports to the corporate office in Gainesville, Florida and works remotely.",
        "job_requirement": "The ideal candidate should have 8-10 years of professional experience, including at least 5 years in product management within a SaaS B2B environment. A Bachelor's degree in business, engineering, or a related field is required, and an advanced degree is a plus. Candidates must be authorized to work in the U.S. and have experience in Agile methodologies, using tools like JIRA and Aha! Experience with mobile app products and advanced data analysis is preferred.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=66438916bbde52b5&xpse=SoDz67I34aZ76axOCR0LbzkdCdPP&xfps=6a808abb-c3f6-4543-8d2e-aecacadb75ee&xkcb=SoDn67M34FrzOsRS3Z0ObzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:28",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "81",
        "session_id": "2",
        "job_unique_id": "job_5aa00b36214a003c",
        "job_title": "Automation Engineer - Gauging",
        "company_name": "Altair Engineering",
        "location_name": "Sterling Heights, MI",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Competitive Salary",
        "accessibility_status": "True",
        "job_description": "The Automation Engineer will be responsible for gauging engineering support and gauge PC and software development. The role involves gauging system programming and requires 10+ years of experience in automation programming. This is a fully remote position. The position requires high school education plus relevant experience.",
        "job_requirement": "The ideal candidate should have over 10 years of experience in automation programming and have high school plus experience. The role requires expertise in gauging system programming and software development. Familiarity with Altair products is beneficial, and the position is fully remote.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=5aa00b36214a003c&xpse=SoAK67I34aoncPQrCx0LbzkdCdPP&xfps=70522e1d-b60c-419a-90c6-2cce2e0bcc4d&xkcb=SoB667M34FrzOsRS3Z0NbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:28",
        "skills_needed": ["Automation programming", "Gauging system programming", "PC software development", "Engineering support", "Altair products", "Remote work"]
    },
    {
        "id": "82",
        "session_id": "2",
        "job_unique_id": "job_d318057cf1258449",
        "job_title": "Senior Analyst 2 – Consulting (Chemical Market Analytics)",
        "company_name": "Dow Jones",
        "location_name": "New York, United States",
        "job_type": "Hybrid",
        "job_time": "Full-time",
        "salary": "$75,000 - $95,000 a year",
        "accessibility_status": "True",
        "job_description": "As a Senior Analyst in Consulting, you will be responsible for conducting research and providing commercial and techno-economic insights into the petrochemical industry. You will collaborate with cross-functional teams, assist in project proposals, and lead execution of project tasks. The role involves working with chemicals like olefins, plastics, aromatics, and syngas. You will also contribute to market analysis and pricing insights, primarily for consulting projects.",
        "job_requirement": "At least 4 years of experience in petrochemical or market consultancy, knowledge of the petrochemicals business and economic aspects, and a B.Sc. or equivalent work experience. Postgraduate qualifications in science or business management are preferred. Refining sector experience is a plus.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=d318057cf1258449&xpse=SoDi67I34ao1mgSg4p0LbzkdCdPP&xfps=92fe053f-69ce-4f03-9230-d5fc0a750a9a&xkcb=SoDO67M34FrzOsRS3Z0MbzkdCdPP&vjs=3",
        "timestamp": "",
        "skills_needed": ["data visualization","sql","statistics","python","business analysis"]
    },
    {
        "id": "83",
        "session_id": "2",
        "job_unique_id": "job_c4852e8e2cde3ca4",
        "job_title": "Software Engineering Manager (C++)",
        "company_name": "Veson Nautical",
        "location_name": "Boston, MA 02110",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Competitive compensation",
        "accessibility_status": "True",
        "job_description": "As an Engineering Manager at Veson Nautical, you will be responsible for leading a software engineering team in designing and building software for the company's SaaS platform. Your role will involve managing a team, contributing to the codebase, guiding the architecture and design of business logic, and ensuring high-quality software delivery. The role also includes mentoring and coaching team members while balancing management and hands-on engineering tasks.",
        "job_requirement": "7+ years of software development experience, including at least 2 years in a managerial role. Proficiency in C++ is required. Experience with SQL databases and cloud-based microservice architecture is a plus. Experience in managing large-scale SaaS platforms and familiarity with technologies like TypeScript, React, and C# are preferred.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=c4852e8e2cde3ca4&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:28",
        "skills_needed": ["jira","communication","sql","leadership","docker","python","project management","cloud computing","java","kubernetes","excel","c++"]
    },
    {
        "id": "84",
        "session_id": "2",
        "job_unique_id": "job_dfc9fbc1be851acb",
        "job_title": "Traffic Simulation Modeler",
        "company_name": "Lochmueller Group",
        "location_name": "St. Louis, MO",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Competitive compensation (includes benefits like 401k, loan repayment program)",
        "accessibility_status": "True",
        "job_description": "The Traffic Simulation Modeler will develop and update traffic simulation models, analyze transportation network performance, and evaluate traffic control measures, infrastructure projects, and operational strategies. The role requires expertise in traffic flow theories, data analysis, and simulation software to study traffic behaviors and improve transportation safety and mobility.",
        "job_requirement": "Bachelor's or Master's degree in Civil Engineering, Transportation Engineering, Urban Planning, Computer Science, or a related field. At least 2+ years of industry experience in traffic simulation and analysis. Proficiency in traffic simulation software (VISSIM, TransModeler, Synchro, Aimsun), Python/R programming, and data analysis tools. Strong communication and collaborative skills required.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=dfc9fbc1be851acb&xpse=SoDJ67I34apjMwzxTZ0LbzkdCdPP&xfps=1805d523-32e0-4fbf-9187-ab73fa0a2967&xkcb=SoCT67M34FrzOsRS3Z0CbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:28",
        "skills_needed": ["Traffic Simulation", "VISSIM", "TransModeler", "Synchro", "Aimsun", "Data Analysis", "GIS Software", "Python", "R", "Traffic Engineering", "Transportation Planning"]
    },
    {
        "id": "85",
        "session_id": "2",
        "job_unique_id": "job_b9783d106532c944",
        "job_title": "Construction Manager",
        "company_name": "Bilfinger",
        "location_name": "Chicago, IL",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Competitive pay (includes 401k benefits)",
        "accessibility_status": "True",
        "job_description": "The Construction Manager at Bilfinger will manage detailed planning and scheduling of construction work, ensure safety procedures, and handle construction cost management. This role involves working closely with procurement, engineering, and subcontractors to ensure timely and safe project completion while adhering to design, budget, and schedule requirements.",
        "job_requirement": "Bachelor's degree in Engineering or Construction Management. 2-3 years of industrial construction experience. OSHA 30 Certification required. Strong time management, organizational, and communication skills. Proficiency in Microsoft Office Suite. Experience with LEAN principles and work permitting processes preferred.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=b9783d106532c944&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:28",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "86",
        "session_id": "2",
        "job_unique_id": "job_8ee405b5afd1b59f",
        "job_title": "Manager, Research Engineering",
        "company_name": "Thomson Reuters",
        "location_name": "Las Vegas, NV",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$137,900 - $281,700 a year",
        "accessibility_status": "True",
        "job_description": "As Manager of Research Engineering at Thomson Reuters Labs, you will lead the design and delivery of AI solutions, collaborating with cross-functional teams to drive product development and ensure successful large-scale rollouts. You will foster innovation and growth, while managing teams and guiding complex AI/ML projects from concept to production. Responsibilities also include mentorship, recruiting, and promoting best practices for software delivery in AI/ML applications.",
        "job_requirement": "Bachelor's degree in IT, Computer Science or equivalent. Master’s/PhD preferred. 7+ years in software development with experience managing teams in an agile environment. Expertise in Python, MLOps, cloud infrastructure (AWS, Azure), ML pipelines, microservices, model monitoring, and governance. Proven track record of AI/ML application leadership.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=8ee405b5afd1b59f&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:28",
        "skills_needed": ["jira","communication","sql","leadership","docker","python","project management","cloud computing","java","kubernetes","excel","c++"]
    },
    {
        "id": "87",
        "session_id": "2",
        "job_unique_id": "job_c7d538f4164d43d7",
        "job_title": "Controls Engineer - Technical Support",
        "company_name": "QuEST Global",
        "location_name": "Grand Rapids, MI",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Candidates will help customers troubleshoot and resolve issues. They will provide technical support to the triaging team on the same. Troubleshoot programming and electrical issues that arise on site or remotely. Interact directly with the customer on site or remotely. Write PLC code for semi-complex systems utilizing standard practices. Provides support in semi-complex material specification, schematic preparation, bill-of-materials development, and appropriate follow-up. Participates in recommending ideas related to productivity improvement, cost reduction and improvement in customer satisfaction. Independently run semi-complex projects through the project life cycle, including all design, documentation, and forecasting. Assist in complex technical interchange and knowledge transfer for both processes and application of products to system design.",
        "job_requirement": "Candidates will have a minimum of 4-8 years experience in controls engineering. Qualified candidates are proficient in project planning, creating schematic and electrical layout drawings, working with PLCs and HMIs, and implementation and commissioning of engineering design projects. Hands-on experience with Programmable Logic Controllers. Expertise with Allen Bradley, Schneider Unity, or Siemens TIA Portal required. Must demonstrate a working understanding of design, layout and use of current networks such as Profibus, ASi, and Ethernet. Experience in writing descriptions of operations and developments of controls based physical layouts is expected. Proficient with AutoCAD Electrical preferred. Demonstrated ability to manage numerous opportunities and deadlines. Demonstrate excellent verbal and written communication skills. Experience with material handling systems is preferred. 4-8 years of successful experience in related field and successful demonstration of responsibilities as presented above. Advanced degree MAY be substituted for experience, where applicable. Bachelor's Degree or equal in a related discipline.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=c7d538f4164d43d7&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:28",
        "skills_needed": ["PLC", "HMIs", "AutoCAD Electrical", "Allen Bradley", "Schneider Unity", "Siemens TIA Portal", "Profibus", "ASi", "Ethernet"]
    },
    {
        "id": "88",
        "session_id": "2",
        "job_unique_id": "job_4b8eaf8b0151abd8",
        "job_title": "National Sales Manager (Precast Concrete)",
        "company_name": "Leviat",
        "location_name": "Atlanta, GA 30338",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Leviat is searching for a results-oriented National Sales Manager to drive sales activity with Precast / Prestressed manufacturers. In this critical role, you will expand sales volume and profitability through strategic sales management of a strong team of District Sales Managers. Lead sales and drive revenue for the business. Serve as a coach to the sales team and establish a winning and collaborative culture. You will measure and report on KPIs for your team, use technology to implement processes and tools to inform sales decisions, and create revenue opportunities. This position typically has 8-10 direct reports covering multiple states. Coaching and developing talent is critical to success in this role. Ensure all projects, initiatives, and processes align with Leviat strategic objectives.",
        "job_requirement": "10+ years in sales/account management in building materials, construction, industrials or related. Demonstrated successful history of building and managing top-performing sales teams. Bachelor’s degree in business/engineering or equivalent experience. 5+ years of sales management experience. Willingness to travel up to 70%.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=4b8eaf8b0151abd8&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:28",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "89",
        "session_id": "2",
        "job_unique_id": "job_d5a2eb5c712081ed",
        "job_title": "Senior Full Stack Software Engineer - Operations Engineering & Industrial Automation",
        "company_name": "thredUP Inc",
        "location_name": "Oakland, California",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "As a Senior Full Stack Software Engineer at ThredUp, you will be responsible for designing, developing and maintaining web applications and services that support our core business functions. You will work closely with our Industrial Engineering team to integrate industrial automation systems such as conveyors, carousels, image scanners, and robots into our software platform. You will have the opportunity to work on challenging and impactful projects that span across the full stack, from front-end to back-end, from cloud to edge. Your responsibilities will include partner with cross-functional teams on warehouse automation, fulfillment, and logistics projects, full stack development of scalable systems, debugging and resolving production issues, supporting on-call systems, and contributing to security and updates.",
        "job_requirement": "Bachelor's degree in Computer Science, Engineering or related field, or equivalent work experience. 8+ years of professional software development experience using C#, .NET, Ruby on Rails, MySQL, AWS and other web technologies. Proficient in web development technologies such as HTML, CSS, JavaScript, and React. Experience in developing and consuming RESTful APIs and microservices. Experience in working with industrial automation systems via PLCs, OPC UA, MQTT, TCP/IP and IoT. Familiarity with software engineering best practices such as code reviews, testing, debugging, and documentation. Excellent communication and collaboration skills. Ability to work independently and as part of a cross-functional team. Willingness to learn new technologies. Nice to have: React Native, experience in using Inductive Automation Ignition platform for industrial automation applications & Human Machine Interfaces.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=d5a2eb5c712081ed&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:28",
        "skills_needed": ["sql","docker","python","cloud computing","java","kubernetes","c++"]
    },
    {
        "id": "90",
        "session_id": "2",
        "job_unique_id": "job_13bdbaa15eb7fc19",
        "job_title": "Senior Electrical Engineer, PE - Remote",
        "company_name": "Tetra Tech",
        "location_name": "Atlanta, GA",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "As a Senior Electrical Engineer at Tetra Tech, you will perform electrical systems planning, design, and calculations. This includes developing detailed electrical and control schematics, designing medium and low-voltage power systems, lighting, grounding, and other low-voltage systems. You will assist in preparing project-specific technical specifications, incorporate design changes using AutoCAD/Revit, and ensure work is completed within budget and on schedule. You will also provide construction administration support, mentor less experienced staff, and maintain strong client relationships. The position requires 10-15% travel, and some construction-related responsibilities.",
        "job_requirement": "Bachelor’s Degree in Electrical Engineering. Licensed Professional Engineer (PE), or ability to obtain within 12 months. 10+ years of related electrical engineering experience. Familiarity with industry codes and standards (NEC, IEEE, etc.). AutoCAD/Revit Design-Drafting Experience. Power systems analysis software experience (ETAP) a plus. Valid Driver’s License with an acceptable driving record. Ability to work with clients and maintain strong client relationships.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=13bdbaa15eb7fc19&xpse=SoBT67I34arFP6RNR50LbzkdCdPP&xfps=a7fff095-dd08-4121-807a-c3063440b139&xkcb=SoAA67M34FryiFwGbZ0LbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:30",
        "skills_needed": ["simulink","circuit design","matlab","power systems"]
    },
    {
        "id": "91",
        "session_id": "2",
        "job_unique_id": "job_2b84cff2bc1bb081",
        "job_title": "Civil Engineering Consultant",
        "company_name": "Aster Brands",
        "location_name": "Remote",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Aster Brands is seeking a proactive Civil Engineer to support engineers and contractors globally using Aster Brands products in retaining wall, hardscape, and light pole base design. Responsibilities include providing technical support, creating design manuals, and expanding engineering resources. You will assist in software training for retaining wall analysis, attend trade shows, and offer technical presentations. The position also involves travel to visit customers for training and meetings.",
        "job_requirement": "4-year degree in Civil Engineering (Geotechnical, Structural, or General Civil preferred). 2-10 years of work experience in a related field. Professional Engineering license preferred. Proficiency in AutoCAD, technical data analysis, and customer interfacing. Understanding of geotechnical engineering, retaining wall analysis and design, and construction industry practices. Experience with analysis software like SRWall or MSEW is a plus.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=2b84cff2bc1bb081&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:30",
        "skills_needed": ["sql","docker","python","cloud computing","java","kubernetes","c++"]
    },
    {
        "id": "92",
        "session_id": "2",
        "job_unique_id": "job_70e9c9a27588b182",
        "job_title": "Quality & Process Automation Engineer - Lead",
        "company_name": "Saint Gobain",
        "location_name": "Courbevoie, Île-de-France",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$99,900 - $154,800 a year",
        "accessibility_status": "True",
        "job_description": "The Multi-Site Quality & Process Automation Engineer will design, implement, and optimize automation systems for vinyl siding manufacturing, including creating and setting up automated systems using vision systems and robotics, and ensuring systems provide instant feedback to reduce defects. The role also involves process optimization, implementing SPC methods, system integration, and maintaining inspection equipment. The engineer will collaborate with various teams to improve efficiency, quality, and reduce downtime.",
        "job_requirement": "Bachelor’s Degree in Engineering, Manufacturing/Industrial Engineering, or a related technical field. 5+ years of experience in automation engineering with Industry 4.0, particularly in vinyl/plastic manufacturing. Experience with statistical process control (SPC) and automated inspection systems. Proficiency with machine vision systems, cameras, sensor integration (e.g., Cognex, Keyence), PLC programming (Siemens, Allen-Bradley), HMI systems, and connecting with Manufacturing Execution Systems (MES). Six Sigma Green Belt certification preferred.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=70e9c9a27588b182&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:31",
        "skills_needed": ["Automation Engineering, Industry 4.0, Vinyl Manufacturing, Process Optimization, Statistical Process Control (SPC), Vision Systems, Cognex, Keyence, PLC Programming, HMI Systems, Manufacturing Execution System (MES), Six Sigma Green Belt, Machine Vision, Quality Control, Process Integration"]
    },
    {
        "id": "93",
        "session_id": "2",
        "job_unique_id": "job_a3d5183042f87249",
        "job_title": "Strategic Communications Manager",
        "company_name": "IT Concepts",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "The Strategic Communications Manager will lead communications for the Endpoint Support and Operations Monitoring (ESOM) Contract. This role involves developing and executing communication strategies, creating communication materials, conducting research, and promoting the capabilities of the EUO (End User Operations) across the agency and contractors. Responsibilities also include crisis management, policy updates, and maintaining ICT deliverables with Section 508 conformance.",
        "job_requirement": "Bachelor’s degree in engineering, computer science, business, or a related field (8 years of additional relevant experience may be substituted). 10+ years of communications experience. Expertise in managing high-pressure situations, crafting messaging during crises, and effective communication at multiple levels within large organizations. Excellent writing, editing, and collaboration skills. Section 508 conformance knowledge. PMP certification preferred. Must be able to obtain Public Trust Clearance.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=a3d5183042f87249&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:31",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "94",
        "session_id": "2",
        "job_unique_id": "job_b444df84f86315dc",
        "job_title": "Transmission Line Engineer",
        "company_name": "Substation Engineering Company",
        "location_name": "Reading, PA",
        "job_type": "Remote",
        "job_time": "Full-time - 8 hour shift",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Mid to senior level structural engineering position focusing on the design and performance of high voltage transmission lines (69kV through 765kV). The role involves preparing calculations, drawings, construction documents, and estimates, developing design standards, and leading and mentoring team members. The position also involves supporting construction, evaluating LiDAR survey data, and ensuring adherence to codes, standards, and utility practices.",
        "job_requirement": "Bachelor’s Degree in Engineering (BSEE preferred), with at least 5 years of experience in designing steel, wood, and concrete structures. EIT license preferred. Proficiency in PLS-CADD, PLS-TOWER, and PLS-POLE is required. Strong written and verbal communication skills in English are necessary. Ability to independently manage projects and mentor less experienced team members. Attention to detail and meeting deadlines are critical.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Substation-Engineering-Company&t=Engineer&jk=b444df84f86315dc&xpse=SoDO67I34ag9RDwGaJ0LbzkdCdPP&xfps=87cb86f5-ca49-4884-95f8-8c77ca15abed&xkcb=SoCn67M34FryiFwGbZ0ObzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:31",
        "skills_needed": ["Structural Engineering, Transmission Line Design, PLS-CADD, PLS-TOWER, PLS-POLE, Construction Support, Leadership, Engineering Estimates, LiDAR Survey Evaluation, Team Mentoring, Project Management, Code Compliance, Foundation Engineering, Design Standards"]
    },
    {
        "id": "95",
        "session_id": "2",
        "job_unique_id": "job_3c6bedea4bb2854b",
        "job_title": "Knowledge Management Manager",
        "company_name": "IT Concepts",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time - Eastern Time working hours",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Lead and support Knowledge Management services for SharePoint and internal websites. Responsibilities include system design, deployment, and support, conducting regular assessments, and ensuring compliance with security policies. The role also involves leading training, collaborating with IT teams, and managing projects for knowledge availability and performance improvement.",
        "job_requirement": "Bachelor’s degree in engineering, computer science, or related field (8 years of relevant experience may substitute for education). 10+ years of experience in Knowledge Management and IT project management, particularly with SharePoint and website management. PMP certification is preferred. Strong problem-solving, communication, and project management skills are required. Experience supporting federal clients is a plus.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=3c6bedea4bb2854b&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:31",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "96",
        "session_id": "2",
        "job_unique_id": "job_670ffddcb7f2ee82",
        "job_title": "Electrical Systems Engineer",
        "company_name": "E-Business International",
        "location_name": "Concord, MA",
        "job_type": "Remote",
        "job_time": "Full-time - Monday to Friday, 8-hour shift",
        "salary": "$103,664 - $155,000 per year",
        "accessibility_status": "True",
        "job_description": "As an Electrical Systems Engineer, you will be responsible for coordinating and designing electrical systems for substation, solar, and battery energy storage systems (BESS). You will handle AC/DC one-lines, layout drawings, power quality studies, and various engineering calculations. You will provide engineering support for proposals, procurement, and construction, and perform site visits to ensure construction matches engineering designs.",
        "job_requirement": "A Bachelor's degree in Electrical Engineering or related field with 8-10 years of relevant experience. Experience with utility-scale solar/PV projects and substation design is highly preferred. Must be proficient in MS Office, AutoCAD, Blue Beam, AmpCalc, and other engineering software. Strong analytical, communication, and problem-solving skills are necessary.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=E--Business-International&t=Electrical+Engineer&jk=670ffddcb7f2ee82&xpse=SoAl67I34ahf5KwrEx0LbzkdCdPP&xfps=d1075ce8-9c32-4454-a2ff-46eb81f630f9&xkcb=SoCO67M34FryiFwGbZ0MbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:31",
        "skills_needed": ["simulink","circuit design","matlab","power systems"]
    },
    {
        "id": "97",
        "session_id": "2",
        "job_unique_id": "job_2f5a374e6475356f",
        "job_title": "Sr. Software Engineer, Platform Engineering",
        "company_name": "DroneUp",
        "location_name": "Virginia Beach, VA",
        "job_type": "Remote",
        "job_time": "On call",
        "salary": "$125,000 - $155,000 a year",
        "accessibility_status": "True",
        "job_description": "DroneUp is seeking a Senior Platform Engineer responsible for developing, maintaining, and improving internal and client-facing IT infrastructure as well as the internal developer platform. The ideal candidate should be strong in development and operations, with experience in cloud technologies, CI/CD, and observability.",
        "job_requirement": "Bachelor's degree in Computer Science or related field, or 5+ years of experience as a software engineer. Proficiency in Kubernetes, extensive experience in Unix/Linux, polyglot programming skills (Golang, Python, HCL), and knowledge of multi-cloud environments (AWS, Azure, GCP) required. Experience with Terraform, Docker, Kubernetes, Open Telemetry, and observability tools preferred.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=2f5a374e6475356f&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:31",
        "skills_needed": ["sql","docker","python","cloud computing","java","kubernetes","c++"]
    },
    {
        "id": "98",
        "session_id": "2",
        "job_unique_id": "job_54d18ec27f677bc3",
        "job_title": "Portfolio Manager (VA ESOM)",
        "company_name": "IT Concepts",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "IT Concepts is seeking an experienced Portfolio Manager to support the VA-ESOM-End Point Support and Operations Monitoring contract. The role involves managing IT-related projects, overseeing budget tracking, risk mitigation, and ensuring successful project execution. Experience in Portfolio and Project Management methodologies, including SAFe and PMI, is essential.",
        "job_requirement": "Bachelor’s degree in engineering, Computer Science, Business, or related field (or 8+ years of experience). 12 years of relevant experience in Portfolio / Project management. Familiarity with SAFe, PMI, Scrum, Hybrid frameworks. PMP certification is required. Strong leadership and communication skills. Ability to mentor project managers and handle multiple projects.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=54d18ec27f677bc3&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:31",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "99",
        "session_id": "2",
        "job_unique_id": "job_06c432038fc76a44",
        "job_title": "Project Manager & Budget Lead (VA ESOM)",
        "company_name": "IT Concepts",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "IT Concepts is seeking an experienced Project Manager & Budget Lead to support the VA-ESOM-End Point Support and Operations Monitoring contract. This role involves managing IT projects, tracking budgets, costs, and schedules, and mitigating risks. The position requires extensive experience in project lifecycle management and stakeholder management.",
        "job_requirement": "Bachelor’s degree in engineering, computer science, business, or related field (or 8+ years of relevant experience). 10 years of project leadership experience in IT project management methodologies (Agile, Waterfall, Hybrid). Experience in budget tracking, cost and performance monitoring, and risk mitigation. PMP or equivalent certification required.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=06c432038fc76a44&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:32",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "100",
        "session_id": "2",
        "job_unique_id": "job_1791751ae40e483b",
        "job_title": "Electrical Construction Design Engineer",
        "company_name": "E-Business International",
        "location_name": "Concord, MA",
        "job_type": "Remote",
        "job_time": "Full-time - 8-hour shift, Day shift, Monday to Friday",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "The Electrical Construction Design Engineer will lead design and construction of building electrical and fire alarm systems. The role involves team leadership, engineering calculations, equipment selection, and ensuring sustainable energy options. Requires a current Massachusetts PE license and at least 5 years of experience.",
        "job_requirement": "BS in Engineering, current Massachusetts PE license or any other location PE license, and a minimum of 5 years of experience in the design and construction of electrical and fire alarm systems. Experience in renewable energy systems and building energy conservation strategies required.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=E--Business-International&t=Electrical+Designer&jk=1791751ae40e483b&xpse=SoCZ67I34aiYyXyg4p0LbzkdCdPP&xfps=8e2dc545-65e4-4b78-a55e-64b92e9e5e2f&xkcb=SoB067M34FryiFwGbZ0HbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:32",
        "skills_needed": ["simulink","circuit design","matlab","power systems"]
    },
    {
        "id": "101",
        "session_id": "2",
        "job_unique_id": "job_eebaf056cec4dfc7",
        "job_title": "Senior Technical Program Manager – Productivity Engineering (M365, Exchange, SharePoint)",
        "company_name": "GEICO",
        "location_name": "Chevy Chase, MD",
        "job_type": "Remote",
        "job_time": "Full-time - Monday to Friday, Day shift",
        "salary": "$115,000 - $260,000 a year",
        "accessibility_status": "True",
        "job_description": "The Senior Technical Program Manager will lead programs focused on collaboration and communication services like Exchange Email, Slack, Zoom, Webex, SharePoint, etc. The position involves working with various stakeholders to define scope, develop project plans, and execute strategies to improve governance and retention policies.",
        "job_requirement": "7+ years of experience in IT project/program management, strong knowledge of collaboration platforms, and project management methodologies. Bachelor's degree in Computer Science, Information Systems, Supply Chain, or equivalent work experience. Proven ability to manage complex projects and drive change.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=eebaf056cec4dfc7&xpse=SoA567I34ailUowrDJ0LbzkdCdPP&xfps=f9831292-6fa8-4767-a96b-06ee1b0e1245&xkcb=SoDA67M34FryiFwGbZ0GbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:32",
        "skills_needed": ["jira","communication","sql","leadership","docker","python","project management","cloud computing","java","kubernetes","excel","c++"]
    },
    {
        "id": "102",
        "session_id": "2",
        "job_unique_id": "job_d42e2401bceb71ed",
        "job_title": "Engineering Team Lead, Xen.AI Intelligent Document Processing",
        "company_name": "Xen.AI",
        "location_name": "Wilmington, Delaware",
        "job_type": "Remote",
        "job_time": "Part-time - Choose your own hours",
        "salary": "$1.00 per year (Revenue-based compensation for 1st year)",
        "accessibility_status": "True",
        "job_description": "Lead the development lifecycle of Xen.AI’s Intelligent Document Processing (IDP) product, focusing on automating data extraction from business documents in verticals such as BFSI, Healthcare, and Industrial. Collaborate with teams to shape the product roadmap, enhance features, and ensure seamless product deployment.",
        "job_requirement": "Bachelor’s degree in Computer Science or related field. 10+ years of SaaS product development experience, 5+ years in leadership roles. Strong expertise in Azure platform, Visual Studio Code, Angular, and programming languages like Python, JavaScript/TypeScript. Proven experience with cloud services, deployment, and secure, scalable SaaS solutions.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Xen.ai&t=Engineering+Lead&jk=d42e2401bceb71ed&xpse=SoAY67I34ajLSEwrJR0LbzkdCdPP&xfps=2aad3dd7-5511-4f4b-a081-1172f95c79d6&xkcb=SoBd67M34FryiFwGbZ0FbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:32",
        "skills_needed": ["sql","docker","python","cloud computing","java","kubernetes","c++"]
    },
    {
        "id": "103",
        "session_id": "2",
        "job_unique_id": "job_3c56aad6512c2c82",
        "job_title": "Fully Remote Structural Engineer",
        "company_name": "Franklin A&E, LLC",
        "location_name": "New York, NY",
        "job_type": "Remote",
        "job_time": "Full-time - Monday to Friday",
        "salary": "$120,888 - $145,000 per year",
        "accessibility_status": "True",
        "job_description": "Lead structural engineer responsible for providing structural solutions, conducting assessments, writing building reports, managing project timelines, and estimating property renovations over $150k. Collaborate with a growing team while managing statewide travel.",
        "job_requirement": "BSCE with emphasis on Structural Engineering. PE License required. 3+ years of experience inspecting buildings and estimating property renovations. Ability to thrive under pressure, excellent communication skills, and problem-solving ability. Valid driver's license and willingness to travel (25%-50%) throughout New Jersey.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Franklin-A%2526E%2C-LLC&t=Structural+Engineer&jk=3c56aad6512c2c82&xpse=SoBv67I34ajtUuSsQp0LbzkdCdPP&xfps=d69d5d07-f4d4-4973-9a2a-9c3fbe5b232e&xkcb=SoDO67M34FryiFwGbZ0bbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:32",
        "skills_needed": ["Structural Engineering", "PE License", "Building Assessments", "Estimating Renovations", "Project Management", "Communication", "Problem-solving", "Team Collaboration", "Creative Solutions"]
    },
    {
        "id": "104",
        "session_id": "2",
        "job_unique_id": "job_a6a37d41a19fe4bf",
        "job_title": "Electrical Engineer III",
        "company_name": "e Business International Inc.",
        "location_name": "Initial Training in Indianapolis, IN",
        "job_type": "Remote",
        "job_time": "Full-time - Monday to Friday",
        "salary": "$120,000 - $140,000 per year",
        "accessibility_status": "True",
        "job_description": "Provide technical support for existing and new products, research and implement replacements for end-of-life components, design and implement new solutions, and assist with product testing and troubleshooting. Involves project planning, engineering change orders, and mentorship of junior engineers.",
        "job_requirement": "Bachelor’s degree in Electrical Engineering, 6-9 years of experience, previous experience in medical device design highly desirable, hands-on experience with testing equipment (oscilloscopes, power meters, etc.), knowledge of circuit board layout, RF, and electro-mechanical assemblies. Experience with multi-layer circuit design and Altium is preferred. Must be willing to travel to Indianapolis for initial training.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=e-Business-International-Inc.&t=Senior+Electrical+Engineer&jk=a6a37d41a19fe4bf&xpse=SoA467I34ajh4kSsQp0LbzkdCdPP&xfps=ba641263-ded1-4f86-a7ef-52045b365dea&xkcb=SoB667M34FryiFwGbZ0abzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:32",
        "skills_needed": ["simulink","circuit design","matlab","power systems"]
    },
    {
        "id": "105",
        "session_id": "2",
        "job_unique_id": "job_452a5f9f28bcb984",
        "job_title": "West Coast Field Sales Engineer",
        "company_name": "Fortec US",
        "location_name": "West Coast",
        "job_type": "Remote",
        "job_time": "Full-time - 8 hour shift",
        "salary": "From $75,000 per year (Base pay, excluding commission)",
        "accessibility_status": "True",
        "job_description": "Maintain and grow the current account base and develop new clients for Fortec's line of Display Assemblies, Embedded Computers, and Power Supplies in the western United States. Responsibilities include providing technical support, conducting product demonstrations, and collaborating with project management teams to ensure successful product implementation.",
        "job_requirement": "Bachelor’s degree preferred. Proven experience in field engineering or related technical sales roles. Strong knowledge of TFT displays, touch technologies, embedded computers, and power supplies. 3+ years in technical sales and 5+ years in sales. Valid driver’s license and willingness to travel 50% required.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Apollo-Display-Technologies-Corp&t=Field+Engineer&jk=452a5f9f28bcb984&xpse=SoDB67I34aj1PewGaJ0LbzkdCdPP&xfps=eac82a54-cc3b-4713-a493-a927f0b29803&xkcb=SoAb67M34FryH5ADNL0LbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:34",
        "skills_needed": ["Technical Sales", "Field Engineering", "TFT Displays", "Touch Technologies", "Embedded Computers", "Power Supplies", "Customer Support", "Product Demonstrations", "Project Management", "Travel"]
    },
    {
        "id": "106",
        "session_id": "2",
        "job_unique_id": "job_1e3432ca59eec353",
        "job_title": "Principal AD Engineering Solutions Architect - Remote SD, ND or MN",
        "company_name": "Sanford Health",
        "location_name": "Sioux Falls, SD 57104",
        "job_type": "Remote",
        "job_time": "Full-time - 8-hour shift, Day shift",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Lead the design, implementation, and management of Active Directory (AD) and Microsoft 365 (M365) environments. Act as the technical authority and subject matter expert, ensuring security, scalability, and continuous improvement of the systems. Manage AD-related migrations, upgrades, and integration of third-party solutions. Lead incident management, disaster recovery, and system resiliency efforts. Mentor junior engineers and drive technical improvements.",
        "job_requirement": "Bachelor's degree (required) or Master's degree with 10 years experience. 15+ years of IT and infrastructure leadership or hands-on experience. Expertise in Active Directory, Microsoft 365, system design, and disaster recovery. Strong project management, technical documentation, and mentoring skills. On-call rotation required.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=1e3432ca59eec353&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:34",
        "skills_needed": ["sql","docker","python","cloud computing","java","kubernetes","c++"]
    },
    {
        "id": "107",
        "session_id": "2",
        "job_unique_id": "job_27d8b37f26b91bda",
        "job_title": "Regional Vibration Analyst",
        "company_name": "I-Care Reliability",
        "location_name": "New Orleans, LA",
        "job_type": "Remote",
        "job_time": "Full-time - 8-hour shift, Overtime",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Responsible for condition monitoring services, including setting up and maintaining CM technology databases, troubleshooting lubrication issues, conducting equipment inspections, managing change processes, and ensuring safety compliance. The Analyst is also a technical resource for clients and I-care employees. Mentoring of employees, reporting, and communication with clients are essential parts of the role. The position includes on-call work and overtime as needed.",
        "job_requirement": "Experience in condition monitoring and vibration analysis, ability to manage CM technology databases, provide troubleshooting support, and oversee safety compliance. Experience in mentoring, reporting, and communicating with clients. Must be able to perform on-call work and overtime as required.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=I--Care-Reliability&t=Regional+Vibration+Analyst&jk=27d8b37f26b91bda&xpse=SoDR67I34akZCDwvxR0LbzkdCdPP&xfps=d546c110-5e2a-4b5c-bea3-369b4ae533c6&xkcb=SoAy67M34FryH5ADNL0JbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:35",
        "skills_needed": ["data visualization","sql","statistics","python","business analysis"]
    },
    {
        "id": "108",
        "session_id": "2",
        "job_unique_id": "job_854cf847a8a95226",
        "job_title": "Senior SCADA & Communication Engineer / Specialist",
        "company_name": "Orbital Engineering, Inc.",
        "location_name": "Pittsburgh, PA",
        "job_type": "Remote",
        "job_time": "Full-time - 8 hour shift",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "The Senior SCADA & Communication Engineer/Specialist will design, implement, and manage communication systems such as microwave, wireless, and fiber optic systems for industrial settings like electric substations. Responsibilities include designing wireless point-to-point systems, conducting microwave path surveys, performing engineering calculations, and ensuring compliance with FCC and FAA rules. The role requires field surveys, creating technical reports, and overseeing projects from design to implementation.",
        "job_requirement": "Proficiency in communication system design (microwave, wireless, fiber optics), AutoCAD, and engineering software like PathLoss, MatLab, and RadioSoft. Knowledge of microwave propagation, RF safety, and communication tower standards (TIA-222) is essential. Project management experience and certifications (PMP, CAPM) are preferred. A degree in Electrical Engineering is required, with 5+ years of relevant experience in SCADA and communication systems.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=854cf847a8a95226&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:35",
        "skills_needed": ["SCADA", "Microwave Systems", "Fiber Optic Systems", "Communication Design", "Path Loss", "MatLab", "AutoCAD", "RF Safety", "Project Management", "Tower Design", "Technical Reporting", "Field Survey"]
    },
    {
        "id": "109",
        "session_id": "2",
        "job_unique_id": "job_d773b707020beb38",
        "job_title": "Civil Engineer",
        "company_name": "Donan",
        "location_name": "Sacramento, CA 94203",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$100,000 - $120,000 a year",
        "accessibility_status": "True",
        "job_description": "Donan Engineering is seeking a full-time Civil Engineer to join their team in Sacramento. This role involves conducting site studies on residential and commercial structures, including roof systems, foundations, water intrusion, cladding elements, and structural systems. The engineer will produce technical reports, provide customer service, and occasionally offer expert testimony. The role requires travel within the assigned region and offers opportunities for professional development and career growth. Benefits include medical, dental, and vision insurance, 401(k) with match, paid time off, and more.",
        "job_requirement": "Candidates must be registered as an active Professional Engineer (P.E.) in the state applied for or have an active NCEES record. A minimum of a bachelor's degree in Civil or Structural Engineering or related disciplines is required. Two to three years of experience in failure analysis, knowledge of residential and commercial construction, and building codes are highly preferred. Strong technical writing abilities, proficiency in Microsoft Office tools, and excellent communication skills are essential. The candidate must be willing to travel and work remotely with minimal supervision.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=d773b707020beb38&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:35",
        "skills_needed": "Technical Writing, Failure Analysis, Residential Construction, Commercial Construction, Building Codes, Design, Customer Service, Travel, Microsoft Word, Microsoft Excel, Microsoft PowerPoint, Civil Engineering, Structural Engineering"
    },
    {
        "id": "110", 
        "session_id": "2",
        "job_unique_id": "job_2f36a368c1e9ccce",
        "job_title": "Regional Sales Manager",
        "company_name": "Alkon Corporation",
        "location_name": "Fremont, OH 43420",
        "job_type": "Hybrid",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "ALKON Corporation is a prominent manufacturer in North America, specializing in pneumatic and hydraulic components designed for both industrial and mobile markets. The Regional Sales Manager must effectively manage all sales activities in the assigned territory and maintain existing accounts while further developing and growing sales. Responsibilities include promoting ALKON solutions, supporting after-sales services, and understanding pneumatic control valves, fittings, and cylinders in the Truck & Trailer industries.",
        "job_requirement": "Bachelor's degree or related experience (Technical/Engineering degree preferred). 3-5 years truck & trailer industry experience. 5+ years selling experience. Pneumatic valve sales experience preferred. Ability to travel 50% of the time. Eligible to work in the United States without sponsorship.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Alkon-Corporation&t=Regional+Sales+Manager&jk=2f36a368c1e9ccce&xpse=SoAx67I34alOPVQrCx0LbzkdCdPP&xfps=877548c1-4583-48ae-901b-9ed7e6c59893&xkcb=SoC867M34FryH5ADNL0ObzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:35",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "111",
        "session_id": "2",
        "job_unique_id": "job_bee214a8503f840c",
        "job_title": "Forensic Engineer",
        "company_name": "Donan",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$100,000 - $120,000 a year",
        "accessibility_status": "True",
        "job_description": "Donan Engineering, a leader in the property insurance intelligence industry, is seeking a full-time Forensic Engineer. The role involves traveling within your assigned region to perform on-site investigations, producing reports based on expert findings, and providing excellent customer service to both internal and external customers. The company offers competitive compensation, career growth, professional development, and a diverse work environment.",
        "job_requirement": "Must have an active Professional Engineer (P.E.) license, or be eligible to obtain within 90 days. Bachelor's degree in Civil or Structural Engineering (or related). 2-3 years of experience in failure analysis or related fields preferred. Strong technical writing abilities and proficiency with Microsoft Word required. Must have a valid driver’s license and be able to travel as needed.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=bee214a8503f840c&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:35",
        "skills_needed": ["Technical writing, Engineering analysis, Customer service, Microsoft Word, Technical reports, Failure analysis, Construction knowledge"]
    },
    {
        "id": "112",
        "session_id": "2",
        "job_unique_id": "job_6b07d08330058896",
        "job_title": "Senior Technical Support Engineer - SONiC Specialist",
        "company_name": "TMS LLC",
        "location_name": "New York, NY",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "The client is seeking a Senior Technical Support Engineer with expert knowledge of SONiC, network architectures, and protocols used in enterprise data centers, web-scale content providers, and cloud hosting networks. This role involves troubleshooting complex issues, replicating customer issues in the lab, and providing escalation support. The ideal candidate has experience with AI infrastructure networks and extensive knowledge of protocols like BGP, OSPF, EVPN, and VXLAN.",
        "job_requirement": "BS in Electrical Engineering, Computer Engineering, Computer Science, or related field (MS preferred). Minimum of 3-5 years working with SONiC in production environments. 10+ years of experience in the computer networking field. Proven ability to act as a Level 3 support engineer. Strong troubleshooting skills across distributed networks and various Network Operating Systems.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=6b07d08330058896&xpse=SoCz67I34altgRgFub0LbzkdCdPP&xfps=25ff278b-4b18-4f6a-9b6f-94a53f9a6a6f&xkcb=SoCV67M34FryH5ADNL0MbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:35",
        "skills_needed": ["SONiC, Networking protocols, BGP, OSPF, EVPN, VXLAN, MPLS, RDMA, Linux, Docker, Troubleshooting"]
    },
    {
        "id": "113",
        "session_id": "2",
        "job_unique_id": "job_da5d071afca9baaa",
        "job_title": "CNC/Manufacturing Engineer",
        "company_name": "E-Business International",
        "location_name": "Phoenix, AZ",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "The role involves CNC Lathe and Mill Programming in Siemens NX, developing documentation (setup sheets, tool list), and creating process routings using Epicor ERP. The ideal candidate will have experience in aerospace industry machining and process engineering, as well as proficiency in CAD and CAM software. The engineer will also analyze production methods, assist with RFQs, and review design documentation to ensure quality and contract requirements are met.",
        "job_requirement": "Minimum 5+ years of aerospace industry experience with process engineering in advanced manufacturing operations (Lathe, 5-Axis Mills, Grind). Lean manufacturing experience and proficiency in CAD software (Siemens NX, SolidWorks, Fusion 360). BS in Engineering or related field, or 5+ years of experience in Aerospace manufacturing with CAD/CAM experience.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=E--Business-International&t=Manufacturing+Engineer&jk=da5d071afca9baaa&xpse=SoC467I34alhzJRStp0LbzkdCdPP&xfps=74ef1493-50cc-4d0a-a96c-955bc259e7a3&xkcb=SoB867M34FryH5ADNL0DbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:05:36",
        "skills_needed": ["Siemens NX, CNC programming, Aerospace industry, Lean manufacturing, CAD/CAM, SolidWorks, Fusion 360"]
    },
    {
        "id": "114",
        "session_id": "2",
        "job_unique_id": "job_a2d61699a85387ea",
        "job_title": "Integration Engineering Specialist (Spring 2025 grad)",
        "company_name": "Bastian Solutions, LLC",
        "location_name": "Indianapolis, Indiana",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "The Integration Engineering Specialist works with customers, suppliers, and Bastian Solutions teams to integrate material handling systems. Responsibilities include commissioning, testing, system integration, and troubleshooting, as well as developing and validating smart engineered solutions. The role involves managing quality, supporting project schedules, and leading system testing efforts.",
        "job_requirement": "Bachelor’s degree or equivalent experience. Experience in automation, conveyor-based material handling systems, and proficiency with PLCs (Allen Bradley or Siemens). Hands-on troubleshooting and CAD experience preferred. Willingness to travel up to 80% for onsite project work. Strong computer literacy with MS Office.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=a2d61699a85387ea&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:36",
        "skills_needed": ["sql","docker","python","cloud computing","java","kubernetes","c++"]
    },
    {
        "id": "115", 
        "session_id": "2",
        "job_unique_id": "job_66a8e7ab497eba68",
        "job_title": "Principal Engineer",
        "company_name": "Chesterfield County, VA",
        "location_name": "Chesterfield, VA",
        "job_type": "Remote",
        "job_time": "Full-time - Monday to Friday; 8:30 a.m. - 5:00 p.m.",
        "salary": "$80,815 - $123,244 a year",
        "accessibility_status": "True",
        "job_description": "The Principal Engineer will serve as a manager within the Development Section of the Department of Utilities, responsible for managing a team of Senior Engineers and Senior Engineering Assistants in various utility engineering tasks. This includes plan review, permit review, capital project management, water distribution and wastewater collection system evaluation, and system modeling. The position involves collaboration with multiple departments and agencies and ensuring the successful completion of water and wastewater projects.",
        "job_requirement": "Bachelor’s degree in civil engineering or a related field, with at least 5 years of engineering experience in water or wastewater systems. Professional Engineer (PE) designation, water modeling, project management, and supervisory experience preferred. The candidate should possess strong technical aptitude, excellent technical writing and oral communication skills, and proficiency in Microsoft Office applications.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=66a8e7ab497eba68&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:36",
        "skills_needed": ["Water and wastewater systems, Project management, Supervisory skills, Water modeling, Technical writing, Civil engineering"]
    },
    {
        "id": "116", 
        "session_id": "2",
        "job_unique_id": "job_f9655bd701e8582b",
        "job_title": "Manager, Technical Customer Service",
        "company_name": "UPM",
        "location_name": "Helsinki, FI",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "The Technical Customer Service Manager will oversee paper performance for assigned customers and printers, provide troubleshooting and analysis to improve paper performance, and lead the claim process. This includes educating end users, maintaining customer relationships, identifying leads, advising UPM mills, and leading trial runs. The role requires collaboration with multiple teams and ensuring timely reporting, and managing customer complaints and claims.",
        "job_requirement": "A relevant commercial or engineering degree, technical understanding of complex products, and sales skills. Product and application knowledge in paper, experience in the paper industry and market, strong communication and interpersonal skills, and the ability to work in a matrix organization are required. Experience in paper sales, customer service, and troubleshooting is preferred.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=f9655bd701e8582b&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:36",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "117", 
        "session_id": "2",
        "job_unique_id": "job_86c63f56d44cb893",
        "job_title": "Senior Vice President of Software Engineering",
        "company_name": "AutoStore",
        "location_name": "Nedre Vats",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "The Senior Vice President of Software Engineering is responsible for leading a team of 70 to 100 employees, providing technical direction, and overseeing the end-to-end management of software development. This includes driving innovation, managing large diverse teams, ensuring high-quality software delivery, and integrating AI technologies. The role involves fostering a collaborative culture, managing multiple projects, and optimizing engineering processes. The SVP will also work on scaling cloud platforms and building strategies for a flexible workforce.",
        "job_requirement": "Bachelor’s degree in Computer Science or related field; 15+ years of software engineering experience, with at least 7 years in a senior leadership role managing large teams (200+ employees). Proven experience in scaling organizations, building AI platforms, managing complex software projects, and collaborating with hardware engineering teams. Strong knowledge of modern software development practices, agile methodologies, SDLC, CI/CD processes, and business alignment skills required.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=86c63f56d44cb893&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:36",
        "skills_needed": ["sql","docker","python","cloud computing","java","kubernetes","c++"]
    },
    {
        "id": "118",
        "session_id": "2",
        "job_unique_id": "job_97d7c5b1443f246f",
        "job_title": "Specification Writer",
        "company_name": "Engineering Design Technologies, Inc.",
        "location_name": "Marietta, GA",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Responsible for researching, developing, preparing, and implementing project manual technical specifications. Coordinates preparation of project manuals, revisions, and addenda. Manages and updates Guide Specifications, creating new specification sections when needed. Reviews edits prepared by engineers and architects. Advises on the use of new materials and systems for construction. Assists with seminars and performs other related duties.",
        "job_requirement": "Bachelor’s degree in Architecture, Engineering, or a related field. Five years of professional technical writing experience, preferably in construction specifications. Professional membership in CSI and certification as a Contract Document Technologist (CDT) or ability to obtain within two years. A Georgia license is preferred. Experience with new construction and rehabilitation projects is essential.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=97d7c5b1443f246f&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:36",
        "skills_needed": ["Technical writing, Construction specifications, Project manual preparation, Product research, Communication, Problem-solving, Analytical skills, Computer applications, Architecture, Engineering"]
    },
    {
        "id": "119",
        "session_id": "2",
        "job_unique_id": "job_f9db8fb860b7d5e4",
        "job_title": "Application Engineer",
        "company_name": "Gates Corporation",
        "location_name": "Pittsburgh, PA 15201",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Provide engineering service to customers in the application and selection of fluid power products. Present technical and product training to customers. Work with sales, product line managers, and marketing to meet organizational goals. Troubleshoot customer inquiries, build relationships, and analyze application requirements. Provide failure analysis and recommend solutions using Gates products.",
        "job_requirement": "Bachelor’s Degree plus 5+ years of progressive engineering experience, OR 5-10 years of progressive engineering experience. Preferred background in Mechanical and Fluid Power systems. Strong problem-solving and interpersonal skills. Ability to manage customer relationships and project timelines. Must be able to travel (minimum 50%). Power transmission experience preferred. Proficient in Microsoft Office. Must be authorized to work in the US.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=f9db8fb860b7d5e4&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:05:36",
        "skills_needed": ["android","application development","ios","java","flutter"]
    },
    {
        "id": "120",
        "session_id": "2",
        "job_unique_id": "job_e571a17a8ba480f9",
        "job_title": "Senior Animator – Temp (SFD / Cinematics)",
        "company_name": "Blizzard Entertainment (part of Activision Blizzard)",
        "location_name": "Irvine, CA 92618",
        "job_type": "Hybrid",
        "job_time": "Temporary - Part-time, Full-time",
        "salary": "$38.85 - $71.83 an hour",
        "accessibility_status": "True",
        "job_description": "Blizzard Entertainment is looking for a dedicated 3D animator to assist the Cinematics team in creating epic animated films. The role involves animating characters, showcasing diverse styles, and collaborating with a passionate team. Experience in animating characters and creatures is required, with an emphasis on body mechanics, character acting, and animation principles.",
        "job_requirement": "6+ years' experience in game development, TV, or film industry with expertise in Maya or equivalent 3D programs. Strong skills in body mechanics and character acting. Experience working with Directors and Animation Supervisors to maintain high-quality cinematic animations. A demo reel showcasing high-quality hand-keyed animations is essential. Passion for film, animation, and video games, with good communication skills and a team-player attitude. Familiarity with rigging, scripting, FX, and cinematography is a plus.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=e571a17a8ba480f9&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:17",
        "skills_needed": ["3D animation", "Character animation", "Body mechanics", "Animation principles", "Maya", "Film making", "Cinematography", "Rigging", "Scripting", "Storyboarding"]
    },
    {
        "id": "121",
        "session_id": "3",
        "job_unique_id": "job_59415c28eac84ae9",
        "job_title": "Children's Storybook Illustrator (Amazon KDP)",
        "company_name": "Barbara Howard",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Part-time - Choose your own hours",
        "salary": "$500.00 per project",
        "accessibility_status": "True",
        "job_description": "We are seeking a talented illustrator to bring a children's storybook to life. This position involves creating illustrations, providing initial sketches for feedback, and revising based on author input. The illustrator must ensure that the final artwork is optimized for Amazon KDP, delivering the illustrations in print-ready formats.",
        "job_requirement": "Proven experience in children's book illustration. Proficiency in digital illustration software like Adobe Illustrator, Photoshop, or Procreate. Experience with formatting artwork for Amazon KDP (image size requirements, bleed, DPI). Strong attention to detail, ability to provide sketches and revisions, and manage time efficiently. Portfolio required showing previous work in children's book illustration.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Barbara-Howard&t=Illustrator&jk=59415c28eac84ae9&xpse=SoDJ67I34anXjixO9B0LbzkdCdPP&xfps=60c36136-5594-4ac9-ba70-3fb6a2dd971b&xkcb=SoAL67M34FsXtWTS2h0JbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:17",
        "skills_needed": ["illustrator","adobe suite","photoshop"]
    },
    {
        "id": "122", 
        "session_id": "3",
        "job_unique_id": "job_71f2609cb9f04e99",
        "job_title": "Carpet Designer",
        "company_name": "Stark Carpet",
        "location_name": "New York, United States",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$60,000 - $80,000 a year",
        "accessibility_status": "True",
        "job_description": "STARK is seeking an experienced Carpet Designer to create custom designs for Hospitality and Contract projects. The ideal candidate will work with the Design Studio Director, Account Managers, and clients to create designs for rugs and broadloom carpets. The position allows remote work, with occasional travel to the New York showroom. Candidates should have a portfolio with examples of Axminster and Hand-Tufted qualities.",
        "job_requirement": "Minimum of 2-3 years of experience in Hospitality and Contract carpet design. Bachelor's degree in Surface Pattern Design, Textile Design, Graphic Design, or related fields. Proficiency in Kaledo, Ned Graphics, APSO, Microsoft Excel, Adobe Suite, and PowerPoint. Strong understanding of carpet production processes, attention to color matching, and design skills.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=71f2609cb9f04e99&xpse=SoCJ67I34anlAuwUrJ0LbzkdCdPP&xfps=24a74545-9ea7-48d2-827d-8d29e42aa7cd&xkcb=SoC_67M34FsXtWTS2h0IbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:17",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "123", 
        "session_id": "3",
        "job_unique_id": "job_9bd5e8fbc1fa3fb9",
        "job_title": "Manager, Human Resources Benefits",
        "company_name": "Academy of Art University",
        "location_name": "San Francisco, CA 94109",
        "job_type": "Remote",
        "job_time": "Full-time - 8am to 5pm (PST)",
        "salary": "$75,000 - $95,000 a year",
        "accessibility_status": "True",
        "job_description": "As a subject matter expert, you will ensure compliance with the Affordable Care Act, San Francisco Healthcare Security Ordinance, and University procedures. You will oversee benefit communications, manage 401(k) plan audits, implement benefit strategies, and maintain benefit plan documents, all while managing a team to improve customer service and operational efficiency.",
        "job_requirement": "Bachelor's degree in Human Resources, Business Administration or a related field (strongly preferred). Experience with HRIS (Workday preferred), advanced Excel knowledge, and proven ability to manage complex projects, negotiate with third-party providers, and lead a team. Knowledge of federal and state regulations including HIPAA, COBRA, 401(k), ACA, and Section 125 is required.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=9bd5e8fbc1fa3fb9&xpse=SoBN67I34a4Ok8wrCx0LbzkdCdPP&xfps=547c22ed-72b7-49e9-9874-57fa2465cafd&xkcb=SoAx67M34FsXtWTS2h0PbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:17",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "124",
        "session_id": "3",
        "job_unique_id": "job_a4e39b1ff40276b7",
        "job_title": "Illustrator and Animator",
        "company_name": "MarcoPolo Learning",
        "location_name": "New York, United States",
        "job_type": "Remote",
        "job_time": "Part-time - Flexible, collaborate across BST and ET",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "MarcoPolo Learning is seeking a talented and collaborative Illustrator and Animator to create engaging and playful educational content. You will develop 2D illustrations and animations that captivate audiences and enhance their learning experience. This is a remote contract role, requiring availability to collaborate across BST and ET (Eastern Time).",
        "job_requirement": "Proven experience as an Illustrator and Animator, proficiency in industry-standard software (e.g., Adobe Illustrator, Photoshop, After Effects), strong 2D animation skills, and a portfolio demonstrating expertise. Ability to collaborate effectively, adapt to feedback, and meet project goals while working remotely.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=a4e39b1ff40276b7&xpse=SoAG67I34a4uAWRWAx0LbzkdCdPP&xfps=a0fc50bd-ee52-49fa-8887-42fcafdda8c5&xkcb=SoCF67M34FsXtWTS2h0ObzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:17",
        "skills_needed": ["illustrator","adobe suite","photoshop"]
    },
    {
        "id": "125",
        "session_id": "3",
        "job_unique_id": "job_53f6d71819284ea2",
        "job_title": "Webmaster / Designer (WordPress & WooCommerce Specialist)",
        "company_name": "Box Out Productions",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Part-time - Flexible, 5–20 hours per week",
        "salary": "$30 - $50 an hour",
        "accessibility_status": "True",
        "job_description": "Box Out Productions is seeking a skilled Webmaster/Designer to maintain and enhance their WordPress-based website and WooCommerce store. This role involves managing website updates, troubleshooting, optimizing site performance, and ensuring a seamless online store experience. The ideal candidate is proficient in Themify Builder, with a strong design sense and the ability to improve user engagement.",
        "job_requirement": "At least 3 years of experience with WordPress and WooCommerce. Strong technical expertise with WordPress, WooCommerce, Themify Builder. Design skills to create user-friendly web designs, experience optimizing for SEO, problem-solving skills, and clear communication for collaboration with non-technical team members.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Box-Out-Productions&t=Webmaster&jk=53f6d71819284ea2&xpse=SoBX67I34a47v3Qhwx0LbzkdCdPP&xfps=6fccdcb9-02cf-4885-bff9-ba747d6a6c54&xkcb=SoAY67M34FsXtWTS2h0NbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:17",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "126",
        "session_id": "3",
        "job_unique_id": "job_cf746cd7c6f6a7d3",
        "job_title": "Franchise Sales Representative",
        "company_name": "Shot Of Art",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time - Monday to Friday, CST hours",
        "salary": "$1,600 - $6,000 a month",
        "accessibility_status": "True",
        "job_description": "Shot of Art is seeking a motivated and charismatic Franchise Sales Representative to manage leads, present franchise opportunities, and drive sales. The role involves engaging with potential franchisees, guiding them through the sales process, and closing deals. This is a fully remote position with significant autonomy and growth opportunities.",
        "job_requirement": "Excellent spoken and written English skills, at least 1 year of sales experience (preferably in franchise sales), strong interpersonal and relationship-building skills, self-motivated, tech-savvy (comfortable with CRM systems, video conferencing tools, Microsoft Office/Google Suite), and availability to work during CST hours.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Shot-Of-Art&t=Sales+Representative&jk=cf746cd7c6f6a7d3&xpse=SoAO67I34a5J2RSg450LbzkdCdPP&xfps=8d0036c2-cf4e-49fe-b3b2-a7b591c324d2&xkcb=SoCs67M34FsXtWTS2h0MbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:17",
        "skills_needed": ["Sales, Franchise Sales, CRM, Communication, Negotiation, Relationship Building"]
    },
    {
        "id": "127",
        "session_id": "3",
        "job_unique_id": "job_fc8b27cfe17e4881",
        "job_title": "Patent Illustrator",
        "company_name": "IlarCo",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Part-time - Choose your own hours",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "IlarCo is seeking a skilled Patent Illustrator to create accurate and high-quality patent drawings based on 3D files. The role involves converting 3D models into 2D drawings that comply with USPTO and international standards. This position offers flexibility in hours and the opportunity to work on multiple ongoing projects.",
        "job_requirement": "At least 2 years of experience in patent illustrations, proficiency in software for converting 3D models to 2D drawings, strong attention to detail, and understanding of patent illustration standards. Ability to meet deadlines while working on multiple projects.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=IlarCo&t=Illustrator&jk=fc8b27cfe17e4881&xpse=SoAw67I34a5cDfxSyh0LbzkdCdPP&xfps=4edf8513-2b18-44bb-8b54-61fd230cffea&xkcb=SoBF67M34FsXtWTS2h0DbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:17",
        "skills_needed": ["illustrator","adobe suite","photoshop"]
    },
    {
        "id": "128",
        "session_id": "3",
        "job_unique_id": "job_85bb8935e8e067ab",
        "job_title": "Senior Graphic Designer",
        "company_name": "Times Media Group",
        "location_name": "Tempe, Arizona",
        "job_type": "Remote",
        "job_time": "Full-time - Monday to Friday",
        "salary": "$40,000 - $50,000 per year",
        "accessibility_status": "True",
        "job_description": "Times Media Group is seeking a Senior Graphic Designer to join its remote design team. This role involves ad design, production, and pagination for a series of print and digital publications. The ideal candidate will have at least 3 years of experience in newspaper and magazine production, with proficiency in Adobe Creative Suite, especially InDesign.",
        "job_requirement": "At least 3 years of graphic design experience, including ad design and publication layout. Proficiency in Adobe Creative Suite programs, particularly InDesign. Experience with Adobe Illustrator is preferred.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Times-Media-Group&t=Senior+Graphic+Designer&jk=85bb8935e8e067ab&xpse=SoB-67I34a5sejAFub0LbzkdCdPP&xfps=ef7588b9-a2fd-41d8-9e1f-2102f7a57f7b&xkcb=SoDx67M34FsXtWTS2h0CbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:17",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "129",
        "session_id": "3",
        "job_unique_id": "job_65cf2a87e1472cf0",
        "job_title": "Licensed Addiction Counselor",
        "company_name": "The ART Center",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Part-time - 4 hour shift",
        "salary": "$45 - $70 an hour",
        "accessibility_status": "True",
        "job_description": "The ART Center is seeking a compassionate and dedicated Licensed Addiction Counselor. The role involves providing support and guidance to individuals struggling with addiction through individual and group counseling, crisis intervention, and developing personalized treatment plans. The counselor will also contribute to research activities and facilitate workshops for clients and their families.",
        "job_requirement": "Master's Degree in psychology, social work, counseling, or related field. Licensure as an addiction counselor preferred. 2+ years of experience in addiction counseling. Familiarity with medical documentation and ethical standards in counseling. Experience with program development and supervision. Ability to work in a team and maintain confidentiality.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=The-ART-Center&t=Addiction+Counselor&jk=65cf2a87e1472cf0&xpse=SoDy67I34a55puwvxR0LbzkdCdPP&xfps=f1314970-ef3d-4edf-b48a-4c69cef6d474&xkcb=SoBs67M34FsXtWTS2h0BbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:17",
        "skills_needed": ["Addiction Counseling, Behavioral Health, Crisis Intervention, Program Development, Supervision"]
    },
    {
        "id": "130",
        "session_id": "3",
        "job_unique_id": "job_e97ba5b69f8f2552",
        "job_title": "Videographer",
        "company_name": "Milan Art",
        "location_name": "Sarasota, FL",
        "job_type": "On-site",
        "job_time": "Full-time",
        "salary": "Depends on experience",
        "accessibility_status": "True",
        "job_description": "We are looking for a skilled and cinematic videographer to join our dynamic team. Someone who loves using the camera to capture cinematic shots and tell stories through visual poetry. This person will play a crucial role in capturing, creating, and facilitating the editing of video content that aligns with our brand and enhances our audience’s learning experience. The ideal candidate will be adaptable, flexible, and collaborative with a strong understanding of cinematography.",
        "job_requirement": "Experience in videography, ability to set up lights and production elements, knowledge of various video production technologies, ability to film and collaborate effectively with a team. Must submit a video showing creative and technical skills.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=e97ba5b69f8f2552&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:17",
        "skills_needed": ["Videography", "Cinematography", "Lighting", "Camera Setup", "Video Editing", "Team Collaboration", "Storytelling", "Creative Direction"]
    },
    {
        "id": "131",
        "session_id": "3",
        "job_unique_id": "job_ffdcc5234b55e4b4",
        "job_title": "Graphic Design Team Lead",
        "company_name": "WebstaurantStore",
        "location_name": "Lititz, PA 17543",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Competitive pay (annual bonuses)",
        "accessibility_status": "False",
        "job_description": "WebstaurantStore is the leading restaurant supply & equipment e-commerce retailer. The Graphic Design Team Lead will manage a variety of design projects, from email marketing to web design. Responsibilities include mentoring the design team, providing feedback, and overseeing project timelines and quality. The role requires proficiency in Adobe Creative Cloud, leadership skills, and the ability to collaborate across teams to align design with broader business objectives.",
        "job_requirement": "Proficiency in Adobe Photoshop, Illustrator, and other Adobe Creative Cloud apps; experience in digital design, marketing strategies, and managing multiple projects. Leadership abilities to mentor and provide constructive feedback. Familiarity with basic HTML, CSS, UX, and print design is a plus.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=ffdcc5234b55e4b4&xpse=SoA-67I34a6dVKzxTZ0LbzkdCdPP&xfps=c945d9fc-b149-43a9-a76d-5674f12ef376&xkcb=SoBW67M34FsXtWTS2h0HbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:17",
        "skills_needed": ["Adobe Photoshop", "Adobe Illustrator", "Adobe Creative Cloud", "Digital Design", "Marketing Strategies", "Team Leadership", "Project Management", "HTML", "CSS", "UX", "Print Design"]
    },
    {
        "id": "132",
        "session_id": "3",
        "job_unique_id": "job_13206da0100bc6c0",
        "job_title": "Sr. Graphic Designer & Merchandising Specialist (Contract)",
        "company_name": "Zephyr Ventilation",
        "location_name": "Alameda, CA",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$30 - $35 an hour",
        "accessibility_status": "True",
        "job_description": "Zephyr Ventilation is seeking a Senior Graphic Designer with merchandising expertise to join the team on a contract basis. The role requires strong graphic design skills and a keen eye for appliance market trends, to create compelling product content for print and digital campaigns. You will collaborate with the marketing team to produce high-quality marketing materials, email campaigns, social media content, and product collateral.",
        "job_requirement": "5+ years of graphic design experience, proficiency in Adobe Creative Suite (Illustrator, Photoshop, InDesign, Acrobat Pro), experience with digital content editing, email marketing platforms like Mailchimp, and a Bachelor’s degree in Graphic Design, Marketing, or related field.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Pacific-Zephyr-Range-and-Hood&t=Senior+Graphic+Designer&jk=13206da0100bc6c0&xpse=SoAj67I34a6sP3wrAB0LbzkdCdPP&xfps=c9cbad06-871c-4b41-b691-81493249bf13&xkcb=SoDi67M34FsXtWTS2h0GbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:17",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "133",
        "session_id": "3",
        "job_unique_id": "job_dbfeae183fd6f4b0",
        "job_title": "Senior Illustrator and Graphic Designer",
        "company_name": "Ripple Effect",
        "location_name": "Rockville, MD",
        "job_type": "Remote",
        "job_time": "Part-time - Flexible",
        "salary": "$29.00 - $34.21 an hour",
        "accessibility_status": "True",
        "job_description": "Ripple Effect is seeking a Senior Illustrator and Graphic Designer with 4+ years of experience to support public health initiatives. The role involves creating visual concepts using computer software for various topic areas, including infographics, storyboards, metaphors, and more. Responsibilities include conceptualizing, iterating on designs, developing visual identity standards, and delivering creative work for digital and print collateral.",
        "job_requirement": "Bachelor's degree in Communications, Marketing, or Graphic Design. Minimum 4 years of relevant professional experience. Expertise in Adobe Creative Suite (InDesign, Illustrator, Photoshop), experience with various illustration styles, and the ability to manage projects from concept to completion. Strong portfolio with varied illustration styles required. Experience with 2D/3D animation, multimedia, human-centered design principles, and government consulting is a plus.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=dbfeae183fd6f4b0&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:17",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe suite","adobe xd"]
    },
    {
        "id": "134", 
        "session_id": "3",
        "job_unique_id": "job_00472244448b1285",
        "job_title": "Senior 3D Designer",
        "company_name": "Nike",
        "location_name": "Beaverton, OR 97078",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Design footwear by driving digital creation from ideation to manufacturing through all design phases; craft conceptual prototypes and proficiency in preparing 3D assets for prototyping; use digital tools and 3D modeling to enable the creation of innovative concepts and designs that reflect Nike's design philosophy; build and present assets that communicate the design's intent to a variety of stakeholders; and collaborate with other members of the design team including product, materials, and computations designers.",
        "job_requirement": "Employer will accept a Master’s degree in Architecture, Design, Industrial Design, Architectural Design, or Product Design and two (2) years of experience in the job offered or in a designer-related occupation. Experience must include: Architectural modelling, Revit, AutoCAD, Sketchup, Rhino, NURBS and Parametric Modelling with Rhinoceros 3D and Grasshopper, Creative Design with Adobe Creative CloudSuite, Modelling still renders and motion design including Cinema4D and FX motion simulation tools in Houdini, Rendering visualization using Redshift, Vray, Unreal for lighting, camera movement and tracking, 2D/3D Manufacturing techniques like 3D Printing, CNC Milling, and Lasercutting.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=00472244448b1285&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:20",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "135", 
        "session_id": "3",
        "job_unique_id": "job_c5f922268952d5d4",
        "job_title": "Lead Designer",
        "company_name": "Nike",
        "location_name": "Beaverton, OR 97078",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Develop, support, and implement virtual and immersive product experiences that include a variety of different disciplines centered around environment art assets, rigging, animation, visual effects, lighting, and in engine setup. Work with the Immersive Team Lead to determine skills and knowledge development areas valuable to the team and can be applied to the team’s projects. Deliver real-time immersive product experiences to consumers that push the boundaries of creativity and help Nike create the future of sport. Perform a diverse range of 3D responsibilities (i.e. animation, rigging, modeling, texturing, lighting, effects) to create and deliver immersive experiences with the team. Concept new ways to present products and storytelling elements “in engine” while collaborating with design and technology teams.",
        "job_requirement": "Must have a Bachelor’s degree in Computer Science, Design, Computer Animation and 3 years of experience in the job offered or a design-related occupation. Experience must include: 3D Character/Hard Surface modeling, 3D animation, Character Rigging, Unreal Engine, Autodesk Maya, 3D rendering, Zbrush, 3D level creation, Look Development, Substance, Designer/Painter.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=c5f922268952d5d4&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:20",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "136", 
        "session_id": "3",
        "job_unique_id": "job_bbcf66d71ceb5d0c",
        "job_title": "Diseñador Gráfico",
        "company_name": "Mavity",
        "location_name": "Miami, FL",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "En Mavity, nos dedicamos a potenciar la creatividad y la innovación a través de diseños impactantes. Buscamos a un Diseñador Gráfico que pueda llevar a cabo múltiples proyectos, abarcando el mundo del branding, diseño de presentaciones, material impreso y digital, así como elementos atractivos para email marketing y redes sociales. Nuestro equipo está conformado por profesionales talentosos, y esta es una oportunidad para contribuir en diversas etapas de desarrollo creativo.",
        "job_requirement": "Buscamos una persona con sólida experiencia en el uso de herramientas como Adobe Creative Suite, Figma y Canva. Debe tener conocimientos específicos en diseño de emails para plataformas de CRM y, idealmente, experiencia en edición de video utilizando CapCut o herramientas similares. Valoramos la capacidad de gestionar múltiples proyectos simultáneamente y la creatividad para abordar diferentes desafíos de diseño. La persona ideal debe ser detallista, organizada y capaz de trabajar en un ambiente dinámico.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=bbcf66d71ceb5d0c&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:20",
        "skills_needed": ["Adobe Creative Suite, Figma, Canva, diseño de emails para plataformas de CRM, edición de video utilizando CapCut o herramientas similares"]
    },
    {
        "id": "137",
        "session_id": "3",
        "job_unique_id": "job_82b38aa40db2bdf0",
        "job_title": "Secondary English Language Arts Curriculum",
        "company_name": "Hurix Digital",
        "location_name": "Mumbai, Maharashtra",
        "job_type": "Remote",
        "job_time": "Part-time",
        "salary": "$10 - $30 an hour",
        "accessibility_status": "True",
        "job_description": "We are looking for US based SMEs for one of our leading USA based online University, to take part in the beta test project for the course. The Beta Testers will answer the assessment questions, as a student would, to determine the effectiveness of the product before its launch. The ideal candidate is proficient, but not an expert in the required material.",
        "job_requirement": "SMEs should have a Bachelor's degree in Secondary English, English, or a closely related field, and 2+ years of relevant secondary classroom work experience. These individuals should closely reflect what the Client's students will look like after graduation. The Client's alumni are used for this group whenever possible.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Hurix-Digital&t=Language+Arts+Teacher&jk=82b38aa40db2bdf0&xpse=SoBU67I34a8rt-Sg4p0LbzkdCdPP&xfps=9feae329-89a9-41cb-9049-730a532d28e7&xkcb=SoCZ67M34FsWmBSg0J0NbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:20",
        "skills_needed": ["Secondary English, English, Education, Classroom Experience"]
    },
    {
        "id": "138",
        "session_id": "3",
        "job_unique_id": "job_f72f086fd5f64493",
        "job_title": "Remote Interior Design Specialist",
        "company_name": "Keller Executive Search",
        "location_name": "New York, United States",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$80,000 - $110,000 a year",
        "accessibility_status": "True",
        "job_description": "Delcoi US is seeking a creative and detail-oriented Remote Interior Design Specialist to join the team. In this role, you will work closely with clients to provide innovative design solutions that reflect their personal style and functional needs. Your expertise will help create beautiful, functional spaces in a variety of environments, from residential to commercial.",
        "job_requirement": "Bachelor's degree in Interior Design, Architecture, or a related field. 2+ years of experience in interior design, preferably with a focus on remote projects. Proficiency in design software such as AutoCAD, SketchUp, or similar. Strong communication and interpersonal skills. Detail-oriented with strong organizational skills. Ability to work independently and manage multiple projects simultaneously. A portfolio showcasing a diverse range of design projects.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=f72f086fd5f64493&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:20",
        "skills_needed": ["Interior Design, SketchUp, AutoCAD, Architecture, Communication, Design Software"]
    },
    {
        "id": "139",
        "session_id": "3",
        "job_unique_id": "job_2b159427a0733cf8",
        "job_title": "Motion Designer",
        "company_name": "Meta",
        "location_name": "Menlo Park, CA",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$126,000 - $175,000 a year",
        "accessibility_status": "True",
        "job_description": "Meta is committed to accelerating the development of fundamental technologies, social platforms, and creative tools to bring the Metaverse to life. As a Motion Designer within the HorizonOS Metaverse Pillar, you will play a key role in creating branded educational content for next-generation VR/MR devices. Your responsibilities will include educating users about the innovative features of our devices, developing best practices, and implementing scalable systems with cutting-edge tools to uphold the highest quality standards.",
        "job_requirement": "7+ years of experience in motion design, proficiency in After Effects, Adobe Animate, Cinema 4D, or similar, demonstrated experience in 2D and 3D animation, knowledge of Lottie, JSON, prototyping, and organizational and project management skills.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=2b159427a0733cf8&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:21",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "140",
        "session_id": "3",
        "job_unique_id": "job_76030d451b82e1ca",
        "job_title": "Website & Graphic Design Manager",
        "company_name": "WebAct",
        "location_name": "Parker, CO 80134",
        "job_type": "Hybrid",
        "job_time": "Part-time",
        "salary": "From $16 an hour",
        "accessibility_status": "True",
        "job_description": "WebAct is a small web design and marketing company located in Denver, Colorado, specializing in affordable websites, design, and digital marketing for growing businesses. We are looking to add a Web Design Manager to our team to create professional, user-friendly websites and marketing campaigns. This is a work-from-home position that involves designing websites, managing projects, and collaborating with teams to ensure great user experiences.",
        "job_requirement": "A great eye for design, ability to learn new platforms quickly, proficiency in Photoshop and Illustrator, knowledge of HTML, CSS, and JavaScript, and excellent communication skills. A portfolio of websites built is required, along with a short cover letter explaining why you want to join the WebAct team.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=WebAct&t=Web+Designer&jk=76030d451b82e1ca&xpse=SoBD67I34a9p4cQhxB0LbzkdCdPP&xfps=cef484a5-73ec-4935-8da9-20c5f9998770&xkcb=SoBw67M34FsWmBSg0J0CbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:21",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "141",
        "session_id": "3",
        "job_unique_id": "job_61630d4f8af432f0",
        "job_title": "CA CTE Teachers: Arts and Business",
        "company_name": "YaizY",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Part-time",
        "salary": "From $50 an hour",
        "accessibility_status": "True",
        "job_description": "YaizY is a company transforming K-12 education by offering engaging online CTE and high-interest electives courses. They are looking for credentialed teachers passionate about providing hands-on learning experiences to middle and high school students, helping them prepare for in-demand careers and industry-recognized certifications.",
        "job_requirement": "A degree in a subject-related field (e.g., Visual Arts, Business, Marketing), Preliminary or Clear CTE teaching credential in CA, previous teaching experience at the middle or high school level, proficiency in designing inclusive learning experiences, and a reliable computer device with internet connection.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Yaizy&t=Business+Teacher&jk=61630d4f8af432f0&xpse=SoCh67I34a991fQhwx0LbzkdCdPP&xfps=475c5f9e-3752-4e47-8e5e-187b9bbe11aa&xkcb=SoDt67M34FsWmBSg0J0BbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:21",
        "skills_needed": ["communication","strategy","data analysis","business analysis","excel"]
    },
    {
        "id": "142",
        "session_id": "3",
        "job_unique_id": "job_d82fdbaedc56ffac",
        "job_title": "Tour Designer",
        "company_name": "Keller Executive Search",
        "location_name": "New York, United States",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$30,000 - $50,000 a year",
        "accessibility_status": "True",
        "job_description": "Triper Israel is looking for a creative and detail-oriented Tour Designer to create unique travel itineraries that meet the needs and preferences of clients. The role involves researching and selecting destinations, coordinating with vendors, and staying informed about travel trends to deliver memorable experiences.",
        "job_requirement": "Bachelor's degree in Travel/Tourism, Hospitality, or a related field (preferred). Minimum of 2 years of experience in tour design or itinerary planning. Strong knowledge of travel destinations, excellent organizational and communication skills, proficiency in travel planning software, and attention to detail.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=d82fdbaedc56ffac&xpse=SoDO67I34a-PsRSsQp0LbzkdCdPP&xfps=934ebabd-e208-4131-8a38-742af07fd308&xkcb=SoBZ67M34FsWmBSg0J0AbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:21",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "143",
        "session_id": "3",
        "job_unique_id": "job_04845aeb06ee9ac6",
        "job_title": "Junior Designer, Square Enix Manga and Books (Remote)",
        "company_name": "Penguin Random House LLC",
        "location_name": "New York, NY 10019",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$53,000 a year",
        "accessibility_status": "True",
        "job_description": "Assist the Design Director in maintaining the manga and book design lifecycle, track deadlines, and design English-edition manga covers and other materials. Collaborate with editors and senior staff to refine designs and establish branding.",
        "job_requirement": "1+ years of on-staff design experience or a design degree. Proficiency in Adobe Creative Suite, typography, and logo design. Strong organizational skills and the ability to manage schedules in a high-volume, deadline-driven environment. Interest in manga, anime, and/or video games is a must.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=04845aeb06ee9ac6&xpse=SoB767I34a-AWRwrGZ0LbzkdCdPP&xfps=93c6f6d9-6f89-423f-a5a3-8ab4a5261c5e&xkcb=SoDX67M34FsWmBSg0J0HbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:21",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "144",
        "session_id": "3",
        "job_unique_id": "job_0ab6a48ec395f9d8",
        "job_title": "Freelance Brand Designer",
        "company_name": "Syneos Health Commercial Solutions",
        "location_name": "Morrisville, NC 27560",
        "job_type": "Remote",
        "job_time": "Freelance",
        "salary": "From $45 an hour",
        "accessibility_status": "True",
        "job_description": "Collaborate with the core team and Design Director to fulfill the creative vision for the customer, maintaining brand equity through design choices. Create design solutions for print and digital executions, researching design processes and trends.",
        "job_requirement": "4-7 years of experience in an agency setting, preferably in pharma/healthcare. Proficiency in Adobe CC (InDesign, Photoshop, Illustrator), Figma, and Sketch. Strong communication skills and creative problem-solving abilities.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=0ab6a48ec395f9d8&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:21",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "145",
        "session_id": "3",
        "job_unique_id": "job_48487314eaaf38e1",
        "job_title": "Diseñador Digital Bilingüe",
        "company_name": "LeytonMedia",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Diseño gráfico y audiovisual de alta calidad, creación de campañas, contenido digital y colaboración con el equipo para garantizar la alineación con la estrategia de marketing de la empresa. Realización de briefs y propuesta de ideas para potenciar estrategias.",
        "job_requirement": "Título en Diseño Gráfico, más de 2 años de experiencia, inglés avanzado, dominio de Adobe Suite (Photoshop, Illustrator, Premiere). Experiencia en agencias es preferible. Conocimiento en Wordpress y Growth Marketing son opcionales.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=48487314eaaf38e1&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:21",
        "skills_needed": ["Adobe Suite (Photoshop, Illustrator, Premiere)", "Diseño Gráfico", "Inglés avanzado", "Trabajo en equipo", "Creatividad", "Growth Marketing", "Wordpress"]
    },
    {
        "id": "146",
        "session_id": "3",
        "job_unique_id": "job_336f06979a1fc5fa",
        "job_title": "Senior Art Director, Creative Development - Temporary",
        "company_name": "Dentsu",
        "location_name": "New York, United States",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$94,000 - $152,375 a year",
        "accessibility_status": "True",
        "job_description": "Develop innovative concepts, lead art direction for campaigns, storyboards, mockups, and manage multiple projects. Collaborate with creative teams and account partners to create compelling content for technology clients, focusing on microchips and AI. Transform corporate narratives into human-centered concepts.",
        "job_requirement": "4-7 years of experience in advertising or creative roles, Bachelor's in Advertising, Graphic Design, or related field. Strong knowledge of Photoshop, InDesign, Illustrator. Leadership skills, strong client relations, and presentation abilities. Familiarity with Premiere and After Effects is a plus.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=336f06979a1fc5fa&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:23",
        "skills_needed": ["Leadership", "Photoshop", "InDesign", "Illustrator", "Premiere", "After Effects", "Creative Direction", "Client Relations", "Team Collaboration", "Attention to Detail"]
    },
    {
        "id": "147",
        "session_id": "3",
        "job_unique_id": "job_6a97b30a9eff6716",
        "job_title": "Production Artist- Background Illustrator",
        "company_name": "Mousetrappe",
        "location_name": "Burbank, CA 91502",
        "job_type": "Remote",
        "job_time": "Full-time - December 2024 - February 2025",
        "salary": "$45 - $55 an hour",
        "accessibility_status": "True",
        "job_description": "Mousetrappe is seeking a candidate with Animation Background Layout and Paint experience. Looking for candidates capable of illustrating in a range of styles and aesthetics, with a quick and flexible hand, comfortable creating elements from scratch based on reference material. The work produced will range from highly rendered CG Animation styles to more illustrative painterly finishes. The Production Artist will collaborate with the Creative Director to build elements used throughout an animated sequence.",
        "job_requirement": "Must be organized and clean, with expert knowledge of Photoshop. Experience with illustration, design, and digital asset creation is required. Broad experience with various illustration styles and techniques. Comfortable troubleshooting minor technical issues. 1-3 years of experience preferred. Software knowledge: Photoshop, Shotgun, Slack.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=6a97b30a9eff6716&xpse=SoAl67I34a_M7ORNR50LbzkdCdPP&xfps=f2fac997-1926-411a-a2d3-c127a00f280c&xkcb=SoBr67M34FsWb4wvzx0KbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:23",
        "skills_needed": ["illustrator","adobe suite","photoshop"]
    },
    {
        "id": "148",
        "session_id": "3",
        "job_unique_id": "job_0b1ce25329095168",
        "job_title": "Symbol Illustrator",
        "company_name": "PRC-Saltillo",
        "location_name": "Wooster, OH",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$53,000 - $65,000 a year",
        "accessibility_status": "True",
        "job_description": "PRC-Saltillo is looking for a Symbol Illustrator responsible for creating clear, engaging, and universally understood sets of symbols for their communication software worldwide. This role involves collaborating with linguists, content owners, and customers to develop effective symbols, ensuring consistency with existing libraries and contributing to the creation of new symbol sets.",
        "job_requirement": "High school diploma or equivalent required; Bachelor's degree in graphic design, illustration, visual arts, or a related field preferred. Proven experience in illustration or graphic design, particularly in creating symbols or icons. Strong portfolio demonstrating a range of illustrative styles and techniques. Proficiency in Adobe Illustrator and Adobe Creative Suite is preferred. Ability to work with a multidisciplinary team and manage multiple projects and deadlines.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=0b1ce25329095168&xpse=SoBh67I34a_XbdQhxB0LbzkdCdPP&xfps=38e150bc-ca58-43e9-ae70-edf7c94e5dbe&xkcb=SoD267M34FsWb4wvzx0JbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:23",
        "skills_needed": ["illustrator","adobe suite","photoshop"]
    },
    {
        "id": "149",
        "session_id": "3",
        "job_unique_id": "job_d69de31b7757661b",
        "job_title": "Graphic Designer",
        "company_name": "Top Rated Ecomm",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time - Monday to Friday",
        "salary": "$20 - $30 an hour",
        "accessibility_status": "True",
        "job_description": "Top Rated Ecomm is seeking a skilled and creative Graphic Designer to join their team. The role involves designing visually compelling graphics and images for Facebook Business and other social media platforms, collaborating with marketing teams, and managing content creation projects using Canva and Adobe Creative Suite. Additionally, video editing skills are required to enhance content for marketing purposes. The designer will also stay updated on industry trends to ensure fresh and engaging content.",
        "job_requirement": "At least 2 years of experience in graphic design with a portfolio showcasing work for social media and digital marketing. Strong proficiency in Canva and Adobe Creative Suite (Photoshop, Illustrator, InDesign). Familiarity with Facebook Business tools and best practices for social media. Working knowledge of video editing software. Ability to manage multiple projects and meet deadlines.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Express-Home-Solutions&t=Graphic+Designer&jk=d69de31b7757661b&xpse=SoBQ67I34a_tX3xSlR0LbzkdCdPP&xfps=4eeefffa-38e6-4cdf-95b0-d225765c65b4&xkcb=SoBC67M34FsWb4wvzx0IbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:23",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "150",
        "session_id": "3",
        "job_unique_id": "job_f3c58726c6ec2d20",
        "job_title": "Event Set Designer | Production Designer",
        "company_name": "Meeting Tomorrow",
        "location_name": "Chicago, Illinois",
        "job_type": "Remote",
        "job_time": "Full-time - Monday to Friday",
        "salary": "$71,000 - $95,000 a year",
        "accessibility_status": "True",
        "job_description": "Meeting Tomorrow is seeking an experienced Event Set Designer to create visually captivating event designs. The role involves collaborating with various teams and clients to develop concepts, creating 3D renderings, and designing elements such as stages, furniture, decor, and more. The designer will work closely with vendors, ensuring designs meet client needs and budget requirements. Strong proficiency in 3D rendering software (SketchUp, Vray, Vectorworks), CAD software, and Adobe Creative Cloud (Photoshop, Illustrator) is required.",
        "job_requirement": "Experience creating solutions in the corporate event space. Proficiency in CAD and 3D rendering software (SketchUp, Vray, Vectorworks). Mastery of Adobe Creative Cloud software (Photoshop, Illustrator). Experience in project and timeline management, with the ability to create technical drawings, floor plans, and lighting/rigging plots. A strong portfolio showcasing concept development, design skills, and real-world event documentation is required.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=f3c58726c6ec2d20&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:24",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "151", 
        "session_id": "3",
        "job_unique_id": "job_0861930d985d980a",
        "job_title": "Associate Brand Designer",
        "company_name": "Upside",
        "location_name": "New York, United States",
        "job_type": "Hybrid",
        "job_time": "Full-time",
        "salary": "$84,937.50 - $103,812.50 a year",
        "accessibility_status": "True",
        "job_description": "Meet Upside: We created Upside to transform brick-and-mortar commerce. Our technology uses the sophistication of online retail—profit measurement, attribution, and incrementality—to provide users with more value on their everyday purchases and brick-and-mortar businesses with new, profitable customers. We've helped millions of users earn 2 to 3 times more cashback than any other product, and hundreds of thousands of brick-and-mortar businesses earn measurable profit. Billions of dollars in commerce run through the Upside platform every year, and that value goes directly back to our retailer partners, the consumers they serve, and important sustainability initiatives.",
        "job_requirement": "2+ years of brand design experience in retail, financial technology, or e-commerce. Proficiency with Figma and Adobe Suite (Photoshop, Illustrator, InDesign, After Effects, and Premier). A portfolio that highlights your brand design skills.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=0861930d985d980a&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:24",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "152",
        "session_id": "3",
        "job_unique_id": "job_b284abe424ed1745",
        "job_title": "Jr. Graphic Designer",
        "company_name": "Shamir Insight Inc.",
        "location_name": "San Diego, CA",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "From $20 an hour",
        "accessibility_status": "True",
        "job_description": "We are seeking a creative and motivated Junior Graphic Designer to join our dynamic team. In this role, you will assist in the development of visually appealing designs that align with our brand identity and marketing goals. You will work closely with senior designers and other team members to create engaging graphics for various platforms, including web and print.",
        "job_requirement": "Proficiency in Adobe Creative Suite (Photoshop, Illustrator, After Effects). Familiarity with Figma or similar design tools. Basic knowledge of JavaScript for web design projects is a plus. Experience or coursework in graphic design, web design, or a related field is beneficial.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Shamir-Optical&t=Junior+Graphic+Designer&jk=b284abe424ed1745&xpse=SoDV67I34awp0kQrAB0LbzkdCdPP&xfps=7d16c85b-acb5-4922-910d-d07efb669a5f&xkcb=SoDl67M34FsWb4wvzx0NbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:24",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "153",
        "session_id": "3",
        "job_unique_id": "job_7450da80d626511a",
        "job_title": "Art Consultant",
        "company_name": "Millennium Fine Art Inc.",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Part-time",
        "salary": "$1.00 - $100,000.00 per year (Commission pay)",
        "accessibility_status": "True",
        "job_description": "Millennium Fine Art Inc. (MFAI) is looking to bring on board an art consultant for sales commission-based compensation. The consultant will contact and serve as a liaison with art galleries throughout the Southwestern United States to exhibit and sell a new collection of gemstone sculptures. The role involves building and maintaining relationships with galleries, collectors, and curators.",
        "job_requirement": "Minimum 5 years of experience in Art Gallery Management or Art Consulting. Bachelor's degree in Fine Art, Art History or related field. Strong communication skills, self-motivated, and focused. Knowledge of Fine Art and Art history is preferred.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Millennium-Fine-Art-Inc.&t=Art+Consultant&jk=7450da80d626511a&xpse=SoD_67I34aw96DxQAJ0LbzkdCdPP&xfps=c20c4c20-1c49-4bd9-b765-522d7541e3b6&xkcb=SoBR67M34FsWb4wvzx0MbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:24",
        "skills_needed": ["Sales, Art Gallery Management, Art Consulting, Fine Art, Art History, Communication"]
    },
    {
        "id": "154",
        "session_id": "3",
        "job_unique_id": "job_c5e713b2771426e7",
        "job_title": "Commercial Interior Designer",
        "company_name": "WRG",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$65,000 - $80,000 a year",
        "accessibility_status": "True",
        "job_description": "WRG is a family-owned furniture dealer located in Houston, TX, looking for a Commercial Interior Designer to work independently on increasingly complex projects. The designer will assist in project production, help develop sales strategies, create block plans, layouts, and specifications, and maintain contact with clients during critical phases. The role involves working with sales, project management, and customer engagement teams to ensure project success.",
        "job_requirement": "Bachelor's or associate's degree in interior design. 2+ years of dealership experience or closely related experience. Systems furniture and office furniture dealership experience preferred. Strong organizational, prioritization, and problem-solving skills. Excellent interpersonal and communication skills.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=WRG&t=Interior+Designer&jk=c5e713b2771426e7&xpse=SoBQ67I34axN0LgFvz0LbzkdCdPP&xfps=df6bbaee-93e8-4042-8a97-88f6ab0dbcf8&xkcb=SoC467M34FsWb4wvzx0DbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:24",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "155", 
        "session_id": "3",
        "job_unique_id": "job_5c932312b43e4e33",
        "job_title": "Graphic Designer",
        "company_name": "PartnersGlobal",
        "location_name": "Washington, DC",
        "job_type": "Remote",
        "job_time": "Full-time - December 6, 2024 to March 3, 2025",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "PartnersGlobal seeks a Graphic Designer to create professional dissemination materials focusing on compliance with federal regulations for USG-funded projects. The work includes designing instructional guides, communicational documents, presentations, and videos for a training program on federal regulations.",
        "job_requirement": "Minimum associate's degree in graphic design, communication, visual design, arts, or related fields. 2-5 years of experience in developing professional design and creating audiovisual material. Strong writing, research, and communicational skills. Fluency in spoken and written English is required.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=5c932312b43e4e33&xpse=SoAt67I34axAHHxf2J0LbzkdCdPP&xfps=34b9bd3f-f789-4c81-b626-10f2642102af&xkcb=SoAM67M34FsWb4wvzx0CbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:24",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "156",
        "session_id": "3",
        "job_unique_id": "job_36d77cff1b18adf9",
        "job_title": "Environment Outsource Artist (Project Hire)",
        "company_name": "That's No Moon Entertainment",
        "location_name": "Los Angeles, CA",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$85,000 - $114,000 a year",
        "accessibility_status": "True",
        "job_description": "That's No Moon is seeking an Environment Outsource Artist to support the creation of assets for AAA game titles. This role involves working with internal teams and external partners to establish visual direction, create briefs, collect reference materials, and oversee asset production. The position will also involve in-game testing, asset integration, and final asset polishing.",
        "job_requirement": "Experience in ZBrush and AAA game production, proficiency with tools like Photoshop, Substance Designer/Painter, ZBrush, Maya, Perforce, and Unreal. Experience working with external outsource partners and understanding in-game art asset creation is required. Set dressing experience in Unreal is a plus. Strong foundational skills in design and color theory, and ability to manage tasks from start to finish.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=36d77cff1b18adf9&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:25",
        "skills_needed": "ZBrush, Photoshop, Substance Designer/Painter, Maya, Perforce, Unreal Engine, Game Asset Production, Set Dressing, AAA Game Experience"
    },
    {
        "id": "157", 
        "session_id": "3",
        "job_unique_id": "job_2a05e40ca54037da",
        "job_title": "Communications / Presentation Designer",
        "company_name": "Vercel",
        "location_name": "San Francisco, California",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$140,000 - $180,000 a year",
        "accessibility_status": "True",
        "job_description": "Are you passionate about creating presentations that captivate and inspire? As a Communications / Presentation Designer, you’ll leverage your expertise in tools like PowerPoint, Figma, Keynote, and Google Slides to craft impactful visual narratives. This role will report to the Director of Creative Design on our Creative/Brand team and will be Remote (U.S. based). You will lead the full lifecycle of presentation design projects, collaborate with speakers to tailor visuals, integrate multimedia, and design high-impact visuals for corporate events and product launches.",
        "job_requirement": "4+ years in visual communication or multimedia design, Expert proficiency in Google Slides, Keynote, PowerPoint and Figma, Experience with multimedia elements like audio, video, and animations, Experience in developing visuals for B2B SaaS products or services.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=2a05e40ca54037da&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:25",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "158", 
        "session_id": "3",
        "job_unique_id": "job_2421a9f25c5acf25",
        "job_title": "Graphic Designer (Part-Time)",
        "company_name": "Drum Corps International",
        "location_name": "Indianapolis, Indiana",
        "job_type": "Remote",
        "job_time": "Part-time - Hourly (10 hours/week)",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Drum Corps International (DCI) seeks a part-time graphic designer to create and support visual assets for DCI programs and events. This role involves designing digital assets for websites, email marketing, social media, online ads, and other digital channels. The designer will collaborate with marketing and social media teams, maintaining brand consistency and fulfilling bi-weekly marketing requests. Reporting to the Director of Communications, the designer will also assist with asset management and attend weekly meetings.",
        "job_requirement": "Bachelor’s degree or equivalent experience in Graphic Design or Visual Arts, 2+ years of design experience (e-commerce or digital marketing preferred), Proficiency in Adobe Creative Suite (Photoshop, Illustrator, InDesign), Familiarity with social media platforms and their design requirements, Understanding of digital design principles (UX/UI, typography, color theory), Excellent time management, strong communication skills, and a collaborative mindset.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=2421a9f25c5acf25&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:25",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "159", 
        "session_id": "3",
        "job_unique_id": "job_0b11f2cb4f04df7b",
        "job_title": "Senior Visual Designer (Digital)",
        "company_name": "Blackairplane",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$85,000 - $120,000 a year",
        "accessibility_status": "True",
        "job_description": "As a Senior Visual Designer at Black Airplane, you will elevate the visual quality of projects, collaborating with UX designers, engineers, and stakeholders to transform UX foundations into visually stunning designs. You’ll create high-quality, polished visual concepts for digital products, craft brand-supporting assets, and develop scalable design systems. The role requires designing web and mobile apps with pixel-perfect execution and exceptional visual polish. This position is remote (US only).",
        "job_requirement": "Bachelor’s degree in Graphic Design, Visual Arts, or equivalent industry experience. 6+ years of experience in visual design, with a strong portfolio showcasing polished digital product designs. Expert knowledge of design principles, typography, color theory, and layout design. Proficiency in Figma and Adobe Creative Suite (Photoshop, Illustrator, Premiere, After Effects). Experience in crafting user interfaces for digital products, creating brand-supporting assets (illustrations, logos, motion graphics). Strong communication skills and ability to manage multiple projects independently.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=0b11f2cb4f04df7b&xpse=SoDT67I34ayd7ZysQp0LbzkdCdPP&xfps=e7338e2c-b177-4fe4-a7f3-4c82c5be91fb&xkcb=SoAf67M34FsWb4wvzx0GbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:25",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "160",
        "session_id": "3",
        "job_unique_id": "job_d75bb6fc2797042a",
        "job_title": "Sr. Designer Brand Studio",
        "company_name": "OpenTable",
        "location_name": "New York, United States",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$75,000 - $100,000 a year",
        "accessibility_status": "True",
        "job_description": "As a Sr. Designer at OpenTable, you will work across various design disciplines, including Brand Identity, Communication Design, Editorial Design, Information Graphics, and Environmental Design. You will shape how the brand is represented across digital and physical media, including logos, typography, photography, video, trade shows, consumer events, packaging, and internal communications. You will collaborate with internal partners and present original concepts to drive the brand's visual presence in the world.",
        "job_requirement": "5+ years of experience in the creative industry, with a strong portfolio featuring multi-channel design projects. Experience in brand identity, editorial design, art direction, and digital design. Experience working with product design teams and collaborating with multiple internal or external partners. Strong problem-solving and presentation skills. Experience working across international markets is a bonus.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=d75bb6fc2797042a&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:25",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "161",
        "session_id": "3",
        "job_unique_id": "job_efa6685d24ef56e0",
        "job_title": "Multi Talented Graphic Designer",
        "company_name": "Hobart Brands",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Part-time",
        "salary": "$40 an hour",
        "accessibility_status": "True",
        "job_description": "We are looking for a creative and detail-oriented graphic designer to join our team. Responsibilities include designing digital products for Etsy, YouTube thumbnails, Facebook/Instagram ad graphics, Keynote/PowerPoint presentations, and eCommerce product infographics. Designs will cover categories such as online business education, travel/digital nomad content, and giftable ecommerce physical products.",
        "job_requirement": "2+ years of graphic design experience. Proficiency in Adobe Illustrator, InDesign, Photoshop, Canva, and Keynote/PowerPoint. Fluent English required. Available for 10 hours per week (additional hours available).",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Hobart-Brands&t=Graphic+Designer&jk=efa6685d24ef56e0&xpse=SoDg67I34ayjBNxf2J0LbzkdCdPP&xfps=447e3ad7-d72b-496f-a519-3332d8d7911b&xkcb=SoDJ67M34FsV8VQGXx0LbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:27",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "162",
        "session_id": "3",
        "job_unique_id": "job_4894d853b4d28d04",
        "job_title": "Graphic Designer",
        "company_name": "Rare Enterprises, LLC",
        "location_name": "Deming, NM",
        "job_type": "Remote",
        "job_time": "Full-time - Evening shift, Monday to Friday",
        "salary": "$15 - $25 an hour",
        "accessibility_status": "True",
        "job_description": "We are seeking a talented and motivated Remote Graphic Designer to produce custom designs for print shop clients. The role includes creating designs for marketing materials, packaging, and other print projects, collaborating with clients, and ensuring designs are print-ready. Candidates must have proficiency in Adobe Creative Suite and a strong understanding of print production processes.",
        "job_requirement": "Proven experience as a graphic designer, proficiency in Adobe Creative Suite (Photoshop, Illustrator, InDesign), understanding of print production processes, strong communication skills, and a portfolio showcasing print materials. Basic knowledge of web design and digital graphics is a plus.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=rare-enterprises-llc&t=Graphic+Designer&jk=4894d853b4d28d04&xpse=SoCm67I34ayw4_wh350LbzkdCdPP&xfps=d1a20c5d-7e50-463b-8398-4fb76474b08e&xkcb=SoB967M34FsV8VQGXx0KbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:27",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "163",
        "session_id": "3",
        "job_unique_id": "job_af90426d8f7d0024",
        "job_title": "Visual Designer",
        "company_name": "Lyra Health",
        "location_name": "Burlingame, CA 94010",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$76,000 - $116,000 a year",
        "accessibility_status": "True",
        "job_description": "Lyra Health is seeking a Visual Designer to join their Brand Design team. This role involves creating engaging digital and print experiences for Lyra's brand, including digital PDFs, display ads, social media graphics, and layout design. The Visual Designer will collaborate with peers in the marketing team, work iteratively on designs, and deliver on-time projects that align with Lyra's brand and mission.",
        "job_requirement": "3+ years of experience in visual design, web design, or related fields. Bachelor's degree in Graphic Design or related field. Proficiency in Figma, Adobe Creative Suite, and interactive prototyping tools. A strong portfolio demonstrating design expertise and problem-solving abilities. Knowledge of web-based interaction design principles and UX methodologies. Experience working with creative, marketing, and web development teams.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=af90426d8f7d0024&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:27",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "164",
        "session_id": "3",
        "job_unique_id": "job_f7f5a2a7552e3ed9",
        "job_title": "Graphic Design Specialist",
        "company_name": "ServiceMaster",
        "location_name": "Atlanta, Georgia",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "The Graphic Design Specialist is responsible for creating and delivering creative materials consisting of both print and digital assets suitable for multiple channels and audiences, both internally for SMB Corporate (internal communications, human resources, franchise development) and/or for individual SMB brands (ServiceMaster Restore, ServiceMaster Clean, Merry Maids, TWO MEN AND A TRUCK, and Aftermath Services).",
        "job_requirement": "1-5 years’ experience in graphic design or related field required. High level of proficiency in Adobe InDesign, Illustrator, Photoshop, Acrobat, Adobe Express. Exceptional creativity, time management, organizational skills, and the ability to meet deadlines. Strong communication skills and attention to detail.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=f7f5a2a7552e3ed9&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:27",
        "skills_needed": ["Graphic Design, InDesign, Photoshop, Illustrator, Adobe Express, Time Management, Organizational Skills, Communication"]
    },
    {
        "id": "165",
        "session_id": "3",
        "job_unique_id": "job_e990befc6c89c612",
        "job_title": "Multimedia/Video Designer with Federal Experience",
        "company_name": "Fathom Management LLC",
        "location_name": "Washington, DC 20004",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$75,000 - $85,000 a year",
        "accessibility_status": "True",
        "job_description": "Seeking a Multimedia Designer to join our Design and Digital Services practice. The right individual has a strong background in creating video and multimedia products in support of marketing, communications, or outreach campaigns, typography and layout, video production (recording and editing video, motion graphics, and light animation), and visual storytelling with the ability to brainstorm and present original ideas.",
        "job_requirement": "Bachelor's Degree in Graphic Design, Fine Arts, Photography, Communications, Media, or related field. 3-5 years of experience in creative, PR/marketing, government contracting, or nonprofit sectors. Skilled use of Adobe Creative Suite (Photoshop, Illustrator, InDesign, Premiere, After Effects, Audition). Experience in multimedia video production (pre-production, post-production, editing, color correction). Strong graphic design, typography, and layout skills. Must have ability to obtain a US government security clearance.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=e990befc6c89c612&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:28",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "166",
        "session_id": "3",
        "job_unique_id": "job_6f91723a91f80c76",
        "job_title": "Graphic Designer with Federal Experience",
        "company_name": "Fathom Management LLC",
        "location_name": "Washington, DC 20004",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$70,000 - $80,000 a year",
        "accessibility_status": "True",
        "job_description": "Seeking a Graphic Designer to join our Design and Digital Services practice. The right individual has a strong background in creating graphic design products in support of marketing, communications, outreach campaigns, typography and layout, and visual storytelling, with the ability to brainstorm and present original ideas.",
        "job_requirement": "Bachelor's Degree in Graphic Design, Fine Arts, Photography, Communications, Media, or related field. 3-5 years of experience in creative, PR/marketing, government contracting, or nonprofit sectors. Skilled use of Adobe Creative Suite (Photoshop, Illustrator, InDesign). Strong graphic design skills and understanding of typography, layout, and color. Ability to develop and design in print and digital mediums. Must have ability to obtain a US government security clearance.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=6f91723a91f80c76&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:28",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "167", 
        "session_id": "3",
        "job_unique_id": "job_7dac14b837a8984f",
        "job_title": "Creative Design Project Manager",
        "company_name": "Onda",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$17 - $25 an hour",
        "accessibility_status": "True",
        "job_description": "We're a dynamic, fully remote agency comprising a network of talented freelancers, and we're on the lookout for a Freelance Creative Director / Senior Brand Designer. The key responsibilities involve spearheading creative strategies for our eCommerce D2C clients, maintaining brand consistency, and ensuring effective communication across all platforms. This pivotal role demands an individual capable of guiding clients in crafting their messaging and value propositions, as well as developing compelling visual moodboards for brands and campaigns. Must be highly experienced within actual design development work.",
        "job_requirement": "Over 6 years of experience in creative leadership, preferably in an agency environment. Bachelor's degree in Graphic Design, Advertising, Marketing, or related field or equivalent work experience. Track record of leading successful creative campaigns. Diverse portfolio showcasing design and creative projects. Experience with eCommerce D2C clients. Bonus if you have proficiency in Adobe Creative Suite.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=7dac14b837a8984f&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:28",
        "skills_needed": ["jira","communication","project management","excel","leadership"]
    },
    {
        "id": "168", 
        "session_id": "3",
        "job_unique_id": "job_e055e3e833fccce0",
        "job_title": "Animator",
        "company_name": "Inkgility Inc.",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$135,000 a year",
        "accessibility_status": "True",
        "job_description": "At Inkgility, we believe that animation is not just about movement; it's about telling stories and evoking emotions. As a dynamic and innovative advertising company, we work on a wide array of projects spanning across digital, traditional, and interactive media. We're looking for an Animator to join our team and help us bring compelling narratives to life through top-tier animation across a range of exciting projects. You’ll play a key role in creating captivating animations for video games, commercials, television, films, and online content, ensuring high production standards and storytelling impact.",
        "job_requirement": "Professional Experience: 3+ years as an animator, with a diverse portfolio. Proficiency in animation software (Maya, Blender, Cinema 4D, After Effects). Mastery of character animation, rigging, and body mechanics. Experience with VFX and motion graphics. Solid understanding of timing, pacing, and storytelling. Bonus if you have experience with game engines (Unity, Unreal Engine) or rigging/modeling.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?cmp=Inkgility-Inc.&t=Animator&jk=e055e3e833fccce0&xpse=SoBo67I34a0THmRSyh0LbzkdCdPP&xfps=03e87e1b-b6d2-44f8-b510-199f0ebfb70b&xkcb=SoBH67M34FsV8VQGXx0MbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:28",
        "skills_needed": ["Unity, Animation Software (Maya, Blender, After Effects), Character Animation, VFX & Motion Graphics, Storytelling & Timing, Rigging & Modeling"]
    },
    {
        "id": "169", 
        "session_id": "3",
        "job_unique_id": "job_eb5fb7234deb96d7",
        "job_title": "Visual Designer (Mid to Senior Level)",
        "company_name": "Owlet Baby Care, Inc.",
        "location_name": "Lehi, UT",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Owlet is searching for a talented Visual Designer (Contract-Remote) to join our design team for 10-15 hours per week. The role involves collaborating closely with designers and the marketing team to shape the brand's visual identity and create campaigns and digital experiences. You will design for websites, social media, email campaigns, packaging, and more, aiming to create emotional connections with customers and boost engagement. You will help expand and refine our design system, using data and insights to inform design decisions.",
        "job_requirement": "4+ years of professional experience in Graphic, Brand, or Visual Design. Portfolio showcasing strong visual craft. Comfortable with cross-functional teams, balancing speed and quality. Strong understanding of design principles, typography, color theory, and current trends. Proficient in Figma, Adobe CC. Bonus: Illustration and/or motion design experience.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=eb5fb7234deb96d7&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:28",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "170", 
        "session_id": "3",
        "job_unique_id": "job_df01880ba2d7c279",
        "job_title": "Senior Python Web Developer",
        "company_name": "Art+Logic",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$30 - $40 an hour",
        "accessibility_status": "True",
        "job_description": "Art+Logic is looking for Senior Python Web Developers for long-term relationships on custom software projects. Developers must thrive in a remote, minimal supervision environment and work well in small teams. The role requires Python web development experience, JavaScript front-end development, and knowledge of Vue.js or React. The company values work-life balance, and meetings are kept to a minimum. The position pays $30-$40/hour.",
        "job_requirement": "5+ years of Python experience in web development. 5+ years of JavaScript front-end development. Deep knowledge of Python 3. Experience with Vue.js or React. Strong verbal and written communication skills in English. Experience with Django, SQLAlchemy, AWS, and AWS Lambda is a plus.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=df01880ba2d7c279&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:28",
        "skills_needed": ["javascript","react","html","css","node.js","python","java"]
    },
    {
        "id": "171",
        "session_id": "3",
        "job_unique_id": "job_3742ede3930168bf",
        "job_title": "Senior Visual Designer (Digital)",
        "company_name": "Black Airplane",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$85,000 - $120,000 a year",
        "accessibility_status": "True",
        "job_description": "Black Airplane is a digital product agency focused on creating impactful digital products. As a Senior Visual Designer, you will elevate the visual quality of projects, collaborating with UX designers, engineers, and stakeholders. You will craft polished visual concepts, transforming wireframes into stunning designs and extending client brands across digital platforms. This role is remote but only available to candidates in the US, excluding specific states (AK, CA, HI, MA, NY, OR, PA, WA).",
        "job_requirement": "6+ years of experience in visual design with a strong portfolio showcasing polished digital product designs. Expertise in design principles, typography, color theory, and layout. Proficiency in Figma and Adobe Creative Suite. Strong communication skills for presenting and justifying design decisions. Experience in creating brand-supporting assets such as logos, illustrations, and motion graphics.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=3742ede3930168bf&xpse=SoAD67I34a1IIZRNTB0LbzkdCdPP&xfps=6610543f-abab-4f27-8d4a-ebf2f64391c1&xkcb=SoCH67M34FsV8VQGXx0BbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:29",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "172",
        "session_id": "3",
        "job_unique_id": "job_94993789870b3b79",
        "job_title": "Senior Graphic Designer",
        "company_name": "Madison Avenue Worldwide",
        "location_name": "Dodgeville, WI",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$60,000 - $70,000 a year",
        "accessibility_status": "True",
        "job_description": "Madison Avenue Worldwide is hiring for two Senior Graphic Designer positions to work remotely. The role involves creating and updating tactics for print and digital, designing animated projects, social graphics, and cinemographs, as well as developing storyboards and sourcing images/assets. This fast-paced environment requires proficiency in Adobe Creative Suite, including After Effects and Premiere, and is ideal for those who thrive under pressure. The work schedule is Monday through Friday, 7:30 am to 4:30 pm CST, with occasional after hours/weekends.",
        "job_requirement": "Proficiency in Adobe Creative Suite (InDesign, Illustrator, Photoshop, After Effects, Premiere), Figma, Sketch, and Microsoft Office. Experience with time tracking and T-Sheets. Ability to work quickly and efficiently in a fast-paced environment, and a proactive 'What else can I do?' attitude. Strong communication skills and attention to detail. Experience in animation, cinemagraphs, and creating design assets for digital and print.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=94993789870b3b79&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:29",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "173",
        "session_id": "3",
        "job_unique_id": "job_1da0d275fc05cf12",
        "job_title": "Remote Graphic Designer",
        "company_name": "Texas Oncology",
        "location_name": "Dallas, TX 75251",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Texas Oncology, part of The US Oncology Network, is hiring a Remote Graphic Designer. The role involves leading the design process, creating visually impactful designs, and collaborating with cross-functional teams. The designer will work on print collateral, digital assets, marketing materials, and presentations, ensuring alignment with brand guidelines. The ideal candidate has 5+ years of experience, proficiency in Adobe Creative Suite, and the ability to manage multiple projects simultaneously in a fast-paced environment. A background in healthcare design is a plus.",
        "job_requirement": "Bachelor's degree in Graphic Design or a related field. Minimum of 5 years of graphic design experience with a strong portfolio. Proficiency in Adobe Photoshop, Illustrator, and InDesign. Strong understanding of typography, color theory, and layout design. Excellent communication, organizational, and time management skills. Experience in the healthcare industry is preferred. Attention to detail and ability to manage multiple projects effectively.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=1da0d275fc05cf12&xpse=SoDw67I34a1RLfxf2J0LbzkdCdPP&xfps=7bc8bc53-1ad3-4835-9e4c-4677e5fa9dab&xkcb=SoC967M34FsV8VQGXx0HbzkdCdPP&vjs=3",
        "timestamp": "2024-12-03 06:09:29",
        "skills_needed": ["photoshop","figma","ui/ux","illustrator","adobe xd"]
    },
    {
        "id": "174",
        "session_id": "3",
        "job_unique_id": "job_28f3dac61a149f0e",
        "job_title": "English Language Arts Item Writer",
        "company_name": "Cambium Learning Group",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "Not specified",
        "accessibility_status": "True",
        "job_description": "Join the ELA Team at Cambium Learning Group, developing academic tests covering Reading and Literacy. As an Item Writer II, you will craft test items, develop passages, and create new questions for various client-specific projects. The role requires interdisciplinary collaboration to measure student learning, utilizing state-of-the-art tools to create interactive tasks. You'll assist in assembling test forms, creating materials for test interpretation, and contribute to the development of new assessments.",
        "job_requirement": "Bachelor's degree in English or a related field. 2-3 years of relevant experience. Demonstrated imagination, analytical skills, and attention to detail. Ability to conceptualize solutions and work collaboratively. Strong task prioritization and deadline management. Required travel: 1-6 weeks per year, mostly in June/July for 2-3 days at a time.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=28f3dac61a149f0e&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:29",
        "skills_needed": ["English Language Arts", "Test Development", "Item Writing", "Attention to Detail", "Collaboration", "Problem Solving", "Task Prioritization", "Deadline Management"]
    },
    {
        "id": "175",
        "session_id": "3",
        "job_unique_id": "job_4e23558732609d04",
        "job_title": "Art Director",
        "company_name": "Cella",
        "location_name": "Virtual",
        "job_type": "Remote",
        "job_time": "Full-time",
        "salary": "$50 - $53 per hour",
        "accessibility_status": "True",
        "job_description": "We are looking for an Art Director to inspire and elevate the team while driving customer-first creative solutions. This role involves collaborating with designers, copywriters, and business partners to develop luxury-focused campaigns across multiple platforms. You will shape creative workflows, lead brainstorming sessions, and align strategies with business goals. If you're passionate about design and leadership, this role is for you!",
        "job_requirement": "Strong leadership and communication abilities. Expertise in luxury design principles and messaging hierarchy. Ability to collaborate seamlessly across functions. Passion for luxury culture and trends. Experience in creative agency environments and managing design teams. Background in luxury hospitality or lifestyle brands preferred.",
        "link_logo": "",
        "job_link": "https://www.indeed.com/viewjob?jk=4e23558732609d04&from=serp&vjs=3",
        "timestamp": "2024-12-03 06:09:29",
        "skills_needed": ["Leadership", "Luxury Design", "Creative Direction", "Collaboration", "Branding", "Digital Design", "Communication"]
    }
]
